[{"Id":"aa665054","ImdbId":"tt3211170","OriginalTitle":"Say Yes to Love","Title":"Say Yes To Love","Description":"Say Yes to Love is a 2012 romance Hindi film directed by Marukh Miraz Beig. The story synopsis is as follows...\r\n\r\nSay Yes To Love is a love story. Vijay (Aasad MIrza) is a young boy who is molested by a prostitute when he is forcibly taken to the red-light area by his school friends. He escapes from there but the molestation leaves him so traumatized that he develops fear and his affects his interaction with girls.\r\n\r\nHis father (Aditya Raj Kapoor) meets a bold and beautiful girl, Sarah Jones (Nazia Hussain), who tells him that she can erase the trauma from his son's life. The father promises to pay her the hefty fee she demands. Sarah Jones now enters Vijay's life and, slowly but surely, she makes him comfortable in the company of a girl something which wasn't the case because of Vijay's traumatic past. What's more, as Vijay and Sarah Jones keep meeting more often, she with a desire to fulfill her contract with Vijay's father, the two youngsters end up falling in love with one another. \r\n\r\nOnce Sarah Jones has completed her part of the contract, Vijay's father pays her off. What happens then? Does the father accept the fact that his son and Sarah are in love? Does he ever know this fact? Does he get Sarah and his married? Or does Sarah walk out of Vijay's life? In short, do the lovers ever meet or never meet? If they do meet, how do they meet? And if they do not meet, why do they not meet?","TrailerLink":"https://www.youtube.com/watch?v=EUoDtk_8mco","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/EUoDtk_8mco\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":16,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"3/16/2012","Runtime":115,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A3F4462BD1C646573E8B98414423C9BC.jpg"},{"Id":"c306ec09","ImdbId":"tt2191641","OriginalTitle":"Chaar Din Ki Chandni","Title":"Chaar Din Ki Chandni","Description":"Chaar Din Ki Chandni is a 2012 Hindi romantic comedy film directed and produced by Samir Karnik. The film stars Tusshar Kapoor and Kulraj Randhawa in the lead roles while Anupam Kher, Om Puri and Anita Raj appear in supporting roles. It released on 9 March 2012, received generally negative reviews, and also failed to do well at the box office. The summary is as follows...\r\n\r\nChaar Din Ki Chandni true to its title is a Comedy with the essence of romance, set against the backdrop of Rajasthan at a four-day wedding. A complete family entertainer revolves around a Rajput family and a family from Punjab, who are caught in a situation to create the comedy of errors. In words to say both are SINGHS but who is the real KING.","TrailerLink":"https://www.youtube.com/watch?v=UhJxquHCih4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/UhJxquHCih4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":9,"Rating":2.1,"CensorRating":"U/A","ReleaseDate":"3/9/2012","Runtime":126,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1D2F39A915C1745DFE7004B12245B30E.jpg"},{"Id":"a899c438","ImdbId":"tt2158633","OriginalTitle":"Married 2 America","Title":"Married 2 America","Description":"Married 2 America is a 2012 Hindi-language drama film directed by Dilip Shankar featuring Jackie Shroff, Archana Joglekar, Anjali Malhotra, Shweta Tiwari, Raghuveer Yadav, Chetan Pandit in the lead roles. The film was released on 17 February 2012 to mixed reviews.\r\n\r\nA short summary is as follows....\r\n\r\nAnjali Malhotra comes to India in search of her husband. But she has to face corruption everywhere and is left clueless about the mystery of her missing husband.\r\n\r\nLooking into the causes of a dam burst, NRI architect cum engineer Ravi Malhotra goes missing in Bihar. His anxious wife Anjali travels to India in search of her husband. But her quest is fraught with danger.","TrailerLink":"https://www.youtube.com/watch?v=s1QGaV0qM5M","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/s1QGaV0qM5M\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"2/17/2012","Runtime":128,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2E6072860A73DFC9DFF07AA261B49727.JPG"},{"Id":"115bb7f0","ImdbId":"tt2378057","OriginalTitle":"?: A Question Mark","Title":"? A Question Mark","Description":"Question Mark is a 2012 Hindi language horror film written and directed by Allyson Patel & Yash Dave and produced by Trippletake Motion Pictures. It was distributed by Percept Picture Company. The film received nine nominations and two awards at the St. Tropez International Film Festival, France. Akhlaque Khan won the best actor while Udhaya Rajni won the award for best editing. The film also received a standing ovation at the Oaxaca Film Festival in Mexico.\r\n\r\nThis was the first time not only in Indian Cinema but world over that a film was being released without a title. Instead, to describe the unseen, unheard story, all that was used was a symbol, \"?\" However, the movie had to be released with a written title \"Question Mark\" due to censorship rules.\r\n\r\nIt delves into the found footage genre which is generally a subgenre in horror where the lines between reel and real become difficult to distinguish.\r\n\r\nIn November 2010, a group of friends went to a place to shoot their final year project film but never returned. A few days later, their camera was found. What happened with them was captured in the camera. The film is a compilation of the footage found from .","TrailerLink":"https://www.youtube.com/watch?v=GlwBTxbC7KQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/GlwBTxbC7KQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":11,"Rating":2.65,"CensorRating":"U/A","ReleaseDate":"2/17/2012","Runtime":102,"Budget":4000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/DD746BB22EB497CA4E968E0F50A81448.jpeg"},{"Id":"08936674","ImdbId":"tt1774473","OriginalTitle":"Love You to Death","Title":"Love You To Death","Description":"Love You To Death is a 2012 Hindi-language comedy film directed by Rafeeq Ellias, featuring Yuki Ellias, Chandan Roy Sanyal, Sheeba Chaddha in the lead roles. The films music was composed by Ronit Chaterji. The film was released on 3 February 2012.\r\n\r\nAn outrageous comedy about love that doesn't exist, about therapy that doesn't work and murder that just might happen.","TrailerLink":"https://www.youtube.com/watch?v=fFzCg059L5A","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/fFzCg059L5A\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"2/3/2012","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C859FC54DC6C5D270813752019EB82F2.jpg"},{"Id":"0fc5cc1c","ImdbId":"tt2188893","OriginalTitle":"Staying Alive","Title":"Staying Alive","Description":"The story is about two men who suffer a heart attack and share the hospital room. Aditya (Ananth Mahadevan) is a newspaper editor who has already survived two strokes in the past and has somewhat adapted to the crisis. Shaukat Ali (Saurabh Shukla), an underworld kingpin who has often witnessed death closely, gets paranoid with his first heart-attack. The story is about their interactions and exchange of ideas in the ICU room that changes Ali's perspective towards life.","TrailerLink":"https://www.youtube.com/watch?v=AkmR7bOkqpc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AkmR7bOkqpc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.85,"CensorRating":"U/A","ReleaseDate":"2/3/2012","Runtime":90,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3B6C93D9CA07D046D02D3A7A5994D378.jpg"},{"Id":"e935e03b","ImdbId":"tt1941638","OriginalTitle":"Sadda Adda","Title":"Sadda Adda","Description":"The film depicts how six bachelors live together, despite their completely different backdrops and personalities. Their home, which they call \"Sadda Adda\", is an absolute mess of beer bottles, dirty clothes, and mattresses, yet together, they carry out the tasks of cooking, cleaning and paying the rent, while sharing laughter and tears, and always standing up for each other like a family. \"Sadda Adda\" starts as a midway room to assist them while they work towards their dreams, but turns out to become their true home. The summary of the film is as follows...\r\n\r\n'The only thing that will stop you from fulfilling your dreams is you\" People have dreams, but not all of us have the guts to put faith in ourselves. Most of us lose focus and give up. We are most afraid to believe in our own dreams. Those who do are the true winners. This slice of life film is set in the backdrop of our capital city- Delhi. A city that brings in thousands of North Indians in search of opportunities that was never available in their own home towns. Like-wise, six boys from different states come together to share a two BHK apartment in a middle-class colony, which they lovingly call \"Sadda Adda\". This film is their story. It is about how six bachelors, with completely different backgrounds and personalities, live together. Their apartment \"Sadda Adda\" is a complete mess with empty beer bottles, cigarette butts, unwashed clothes, mattresses tossed all over the floor etc - yet together they cook food, clean, buy groceries, pay rent, laugh, cry, fight over insignificant issues and always stand up for each other - like a family. \"Sadda Adda\" which began as a transitional accommodation to help them work towards their dreams, becomes their home. The film takes us through a journey of their camaraderie and self-belief. The interwoven stories of these 6 characters takes us through a heart warming journey of the lives of these boys. This movie is about real characters from life who have fun, who fight the wave everyday and through very light heart moments inspire us in the most modest way. The crests and troughs that shape them into the men they will become in the future - because Boys will not always be boys.","TrailerLink":"https://www.youtube.com/watch?v=cE7oHZ3nDdQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/cE7oHZ3nDdQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":15,"Rating":3.6,"CensorRating":"U/A","ReleaseDate":"1/13/2012","Runtime":107,"Budget":100000,"Revenue":225000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7D9DE026A1710C70F564CE90CE769A55.jpg"},{"Id":"b990f11f","ImdbId":"tt2251552","OriginalTitle":"Challo Driver","Title":"Challo Driver","Description":"Challo Driver is Hindi movie released on 20 July 2012, produced by Ronicka Kandhari and starring Kainaz Motivala, Vickrant Mahajan, Prem Chopra, Manoj Pahwa, Tariq Vasudeva, Juhi Pande and Silky Khanna. \r\n\r\nThe film stars Prem Chopra as the Hero's grandfather. He (Prem) wants someone to come in his grandchild's life who would change his life completely. Hero is very strict by nature and changes his driver five times a month. So by this behaviour of his Prem becomes upset. But suddenly a female driver comes into his life and the whole story changes respectively. At last Hero marries the female driver and the story ends successfully.","TrailerLink":"https://www.youtube.com/watch?v=4nU3n70T2FM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/4nU3n70T2FM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"7/20/2012","Runtime":142,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4DE2A98756D343B52D6CCAFC8D2DE3FA.jpeg"},{"Id":"ec46ed05","ImdbId":"tt3407604","OriginalTitle":"Will You Marry Me","Title":"Will You Marry Me","Description":"The film is a copy of the Hollywood movie Tomcats – The film is about three bachelors Aarav (Shreyas Talpade), Nikhil (Muzamil Ibrahim) and Rajveer (Rajeev Khandelwal) who along with eleven other college mates sign a contract which has two clauses. The first clause says that all of them have to purchase certain number of Reliance shares, and the second rule explains all the shares will go to the man who will remain unmarried till the end. Slowly and steadily people start to break away from the rule and only Nikhil, Rajveer and Aarav remain single. Nikhil is in love with his childhood friend Anjali (Tripta Prashar) and wants to settle down with her but the other two have no such plans, but they find the proceedings interesting after discovering Anjali's best friend Sneha (Mugdha Godse) at the wedding venue. Suddenly all their plans to remain unmarried till the end vanish and the two start trying o win Sneha's heart. Meanwhile, one of Rajveer's friends gives him Rs 5 crore to keep but Rajveer being smart enough invests the money in the stock market, only to find that the company he invested in has crashed and a powerful business magnate (Paresh Rawal) is after his life. Rajveer plans to convince Aarav to get married to Sneha so that he can get all the Reliance shares and pay his due. His plans fail when Aarav manages to listen to a secret conversation.","TrailerLink":"https://www.youtube.com/watch?v=a8uiXZ-TqYM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/a8uiXZ-TqYM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"3/2/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/ADF8D632DCCE4191BC10A154C1990B8C.jpg"},{"Id":"ac365ad6","ImdbId":"tt2064849","OriginalTitle":"London Paris New York","Title":"London Paris New York","Description":"The movie starts with Nikhil Chopra being interviewed by a reporter in New York asking him about his newly directed movie and why he chose a serious subject and he replies saying that he was asked by someone to be true to yourself and this movie shows the biggest truth about him. He then receives a message and rushes outside to catch a cab.\r\n\r\nIn the cab, he remembers how he met Lalitha at the London airport in 2005. She misses her connecting flight to New York and bumps into Nikhil while collecting her luggage. They instantly strike a chord and decide to explore London as both of them do not want to head away to their homes but wish to enjoy their first day of freedom. During the day, they roam around in London, explore tourist locales, get drenched in rain and discuss personal ambitions. As the day ends, Nikhil and Lalitha become close but Lalitha declares that she cannot have a long distance relationship with him. While parting ways, Nikhil buys a ticket for himself and tells Lalitha that he will come to New York in 6 months to meet her. She says that they should not write to each other and he agrees to meet her at the New York airport.\r\n\r\nAfter 2 years, Nikhil rushes to Paris when he finds out that Lalitha has come there for an exchange program. It is revealed that Nikhil could never make it to New York as he had promised to Lalitha. Lalitha is at first angry with Nikhil for ditching her, however soon she makes peace with the fact and they set out roaming the streets of Paris. They still feel the same attraction for each other and end up spending the night together in Nikhil's hotel. Nikhil admits that he is in love with Lalitha. They start out to watch the film he has made for his course but Lalitha is unable to control her emotions on seeing it.\r\n\r\nIt is revealed that Lalitha had actually taken a trip back to London when she also realized that she was in love with Nikhil. However, she finds him in bed with his film's actress which breaks her heart. She resolved to get even with Nikhil if given a chance. Realizing that Nikhil is in love with her, she breaks his heart too and leaves for New York.\r\n\r\nThe film moves forward to present day when Nikhil lands outside Lalitha's house. They go together for a cab ride in New York City. Lalitha tells him that she is getting married to an American and relocating to Mumbai. Nikhil tries his best to win Lalitha's heart. Lalitha also apologized for breaking his heart. They again spend the night together on the streets.\r\n\r\nHowever, as morning arrives, Lalitha starts rushing for her wedding which leaves Nikhil heartbroken again as he had thought he had won back Lalitha. He takes out his anger on her, explaining how she had been all wrong in this relationship. Lalitha leaves for her house. Nikhil rushes first to her church where Lalitha was getting married and then to her house only to learn that Lalitha had called off her marriage.\r\n\r\nThey again meet outside her house and decide to spend the rest of their lives together.","TrailerLink":"https://www.youtube.com/watch?v=7vM1bFROka4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/7vM1bFROka4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":12,"Rating":2.85,"CensorRating":"U/A","ReleaseDate":"3/2/2012","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/83A187832661644D90FA195C346F2847.jpg"},{"Id":"b0b5ac28","ImdbId":"","OriginalTitle":"Thulli Ezhunthathu Kadhal","Title":"Thulli Ezhunthathu Kadhal","Description":"Nandini, Kishore, Mahesh, Scud, Bhakti, Jessica, Chandana and Sridhar / Sri are all friends from school. They all finish their final year exams and try their level best to kick start their careers while they face some interesting situations in life. Nandini and her senior Kishore are in love. But Nandini's father hardly understands his kid's yearning for some lost prestige. Mahesh and Scud haven't been on talking terms since years. Bhakti is a happy go lucky girl, or so it seems. Jessica, a foreign student, is trying to make it big in fashion in India, living as a guest with rich Chandana. Sridhar is in love with Chandana but doesn't want to express it to her before he settles down in life. And then there is Dakshayini, who is bent on stealing Sridhar from Chandana. The film covers the coming of age of all these friends, as they try to solve a Rubik's cube called life. It also covers a lot of issues like acid attacks on girls, suicides, misunderstandings, false prestige and so on.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"8/24/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2D98BA73B26D91FF54D960DAF70C1F0E.jpg"},{"Id":"72415d03","ImdbId":"tt1821480","OriginalTitle":"Kahaani","Title":"Kahaani","Description":"A poison-gas attack on a Kolkata Metro Rail compartment kills the passengers on board. Two years later Vidya Bagchi (Vidya Balan), a pregnant software engineer, arrives in Kolkata from London during the Durga Puja festivities in search of her missing husband, Arnab Bagchi. A police officer, Satyoki \"Rana\" Sinha (Parambrata Chatterjee), offers to help. Although Vidya claims that Arnab went to Kolkata on an assignment for the National Data Center (NDC), initial investigations suggest that no such person was employed by the NDC.\r\n\r\nAgnes D'Mello, the NDC's head of human resources, suggests to Vidya that her husband resembled former employee Milan Damji (Indraneil Sengupta), whose file is probably kept in the old NDC office. Before Agnes can provide any further help she is killed by Bob Biswas (Saswata Chatterjee), an assassin working undercover as a life insurance agent. Vidya and Rana break into the NDC office and find Damji's file, barely escaping an encounter with Bob, who is searching for the same information. Meanwhile, the attempts to obtain Damji's records have attracted the attention of two Intelligence Bureau (IB) officials in Delhi—the chief Bhaskaran K. (Dhritiman Chatterjee) and his deputy Khan (Nawazuddin Siddiqui). Khan arrives in Kolkata and reveals that Damji was a rogue IB agent responsible for the poison-gas attack. In spite of Khan's warnings, Vidya continues her search, fearing that Arnab's resemblance to Damji may have led him into trouble.\r\n\r\nThe address on Damji's record leads Vidya and Rana to a dilapidated flat. An errand boy from the neighbourhood tea stall identifies R. Sridhar, an NDC officer, as a frequent visitor to Damji's flat. Bob attempts to kill Vidya, but fails, and is run over by a Tempo during a chase. Examination of Bob's mobile phone leads Vidya and Rana to an IP address sending instructions to kill her. They break into Sridhar's office to verify his IP address, but he is alerted electronically and returns to his office. Vidya accidentally shoots Sridhar dead during a scuffle, which upsets Khan, who had wanted him alive.\r\n\r\nSridhar's computer data reveals a code, which when deciphered reveals Bhaskaran's phone number. Vidya calls Bhaskaran to tell him that she has retrieved sensitive documents from Sridhar's office. She asks Bhaskaran to help find her husband in exchange for the documents, but Bhaskaran tells her to contact the local police. Vidya soon gets a call from an unknown number however, warning her that she should hand over the documents to the caller if she wishes to see her husband alive. Khan thinks the caller is Milan Damji.\r\n\r\nVidya goes to meet Damji, followed by Rana and Khan. Damji cuts the meeting short when Vidya expresses her doubt that he will be able to return her husband in exchange for the sensitive file, and he attempts to leave. Vidya tries to stop him, and in the ensuing struggle Damji draws a gun on her. Vidya disarms him using the prosthetic belly she has been using to fake her pregnancy, before shooting him with his own gun. She flees into the crowd before the police arrive, leaving a thank you note for Rana and a pen drive containing data from Sridhar's computer, which leads to Bhaskaran's arrest. Rana concludes that no Vidya or Arnab Bagchi ever existed, and that Vidya had been using the police and the IB to achieve her own ends.\r\n\r\nVidya is revealed to be the widow of Arup Basu (Abir Chatterjee), an IB officer and Damji's colleague, who was killed in the poison-gas attack. In her mission to avenge his death, Vidya was helped by retired IB officer Pratap Bajpayee (Darshan Jariwala), who suspected the involvement of a top IB official.","TrailerLink":"https://www.youtube.com/watch?v=rsjamVgPoI8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rsjamVgPoI8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":18,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"3/9/2012","Runtime":128,"Budget":1200000,"Revenue":16000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/30DCE8C0DF31D41EA23C7A57974D7AF8.jpg"},{"Id":"44b01ea1","ImdbId":"tt1667460","OriginalTitle":"10ml LOVE","Title":"10Ml LOVE","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"12/7/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BCC87A8D0E32C2292DCFE1FE8E595737.jpg"},{"Id":"67c1fc4f","ImdbId":"tt2211174","OriginalTitle":"Ammaa Ki Boli","Title":"Ammaa Ki Boli","Description":"The story revolves around an old-aged husband-less mother Ammaa (Faruk Zafar), her 5 grown-up children’s and a second-rate two-seater scooter living in a small town. Ammaa’s five grown-up children’s, namely Parmu (Govind Namdev), Jeetu (Sitaram Panchal), Rukmi (Sanjay Mishra), Kalavati (Himani Shivpuri) and Hari (Zakir Hussain), are all well-settled and have their own 2-seater vehicle. However only Rukmi doesn’t have and thus he steals nearly Rs. 40,000/- from Ammaa’s safe-box and buys a second class two-seater scooter.\r\n\r\nSoon the scooter met with a strange accident because of the two local boys and so does the exposure of robbing money from Ammaa. A group meeting was then finally called up and the scooter was declared as ‘Sarvajanik Scooter’ (public scooter) where anybody and anyone in the family can use it. However this doesn’t go down well with Rukmi and the story takes a complete turn in a sheer hilarious manner, where how it changes from the key of this second-rate scooter to Ammaa’s funeral, forms the crux of the story. This film also deals with the importance of relations in present scenario, This is a satire on family relations between A mother and her Five children which explained in a form of comedy.","TrailerLink":"https://www.youtube.com/watch?v=jyHFor26puw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/jyHFor26puw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":8,"Rating":1.95,"CensorRating":"U/A","ReleaseDate":"12/14/2012","Runtime":120,"Budget":811543,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/31F547DAB7D1CF073D0A972DAE1EBFB0.jpg"},{"Id":"5c664be3","ImdbId":"","OriginalTitle":"Valentine's Night","Title":"Valentine's Night","Description":"Valentine's Night is a 2012 Hindi-language romantic thriller film directed by Krishan Kumar and Baadal, featuring Payal Rohatgi, Sangram Singh, Rahul Minz, Neha Thakur in the lead roles. The films music was composed by Astitva-The Band. The film, produced by Kirshan Kumar and Sanjeev Malhotra, was released on February 10, 2012","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"2/10/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F59E65C2FDA076BCB239C09687249F7B.jpg"},{"Id":"ebb37ead","ImdbId":"","OriginalTitle":"Kuch Spice To Make It Meetha?","Title":"Kuch Spice To Make It Meetha?","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"2/29/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BB13A09071A07545BC036FAFCE430FD1.jpg"},{"Id":"8a95efa8","ImdbId":"tt2400377","OriginalTitle":"Kaksparsh","Title":"Kaksparsh","Description":"Hari Damle (Sachin Khedekar), head of a Chitpavan Bramhin family, lives in the village Torgaon in Konkan with his wife Tara (Medha Manjrekar), their three children, his younger brother Mahadev (Abhijit Kelkar), and his widowed aunt, Namu Aatya (Savita Malpekar). Hari arranges the marriage of Mahadev with a pre-pubescent girl, Durga (Ketaki Mategaonkar), renamed as Uma after marriage. However, Mahadev dies before the consummation of the marriage. Hari performs death rituals (Śrāddha) for Mahadev but crows (symbolic of the spirit of the deceased in Hinduism) refuse to touch the offerings. Hari mumbles something while offering food after which crow touches the offerings.\r\n\r\nBrahmin community in the village now expects widow Uma to have her head shaved (a ritual). Hari opposes and does not allow any rituals to be performed for her as a widow. Hari stands behind Uma in all her difficulties which raise doubts about his intentions, including that by his wife, Tara. Years later, when Tara is diagnosed of a terminal disease, the now grown-up Uma (now played by Priya Bapat) takes charge of the household. Before Tara dies, she realises her mistakes and requests Hari to marry Uma which he readily refuses.\r\n\r\nIn the meantime, Hari gets his son Sankarshan (Saksham Kulkarni) married. Once Hari finds Uma sitting outside the room of the newly married couple, listening to their playful banter. Disgusted by Uma's behaviour, Hari starts avoiding her. Upset by this behaviour, Uma tries to talk her heart out to Hari's friend Balwant (Sanjay Khapre) and requests him to find out the reason. Coincidentally, Hari overhears this and severs his relations with Balwant. Unaware of the reason for Hari's changed behaviour, Uma starts staying aloof, while her health starts degrading. Worried Sankarshan requests his sister Shanti (Manava Naik) to talk to Uma. Frustrated and unknowing of what loss she had throughout her life, Uma opens her heart but situation raises more questions about her relation with Hari.\r\n\r\nUma decides to go on a fast and relents to none of the family member's request to quit. Hari, left with no other option, explains his behaviour. Hari reveals to Uma that when he was performing death rituals for Mahadev and offerings were not accepted by crow for a long time, he took a vow that he would not let any other man touch Uma. Thus, he did not allow practised rituals of shaving her head to be performed and also declined Tara's request of their marriage. When he learned through Tara that Uma has started loving him, he stopped talking to her, in spite of his love towards Uma.\r\n\r\nHe eventually accepts that he loves Uma and would marry her, breaking his vow. Knowing the truth, Uma forgives Hari and agrees to the proposal. Hari fetches Mangala sutra but finds out that Uma is dead. He realises that Uma has sacrificed her life for his love where she did not want Hari to break his vow.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/4/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B6DDD886FD4D84AC991053C5BDB76E8F.jpg"},{"Id":"77be7393","ImdbId":"tt2246837","OriginalTitle":"மாற்றான்","Title":"மாற்றான்","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"10/11/2012","Runtime":165,"Budget":11340000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5EAB7B946287F3E926314ED0D8C5DB8A.jpg"},{"Id":"bd6f994e","ImdbId":"tt2404027","OriginalTitle":"Arjun: The Warrior Prince","Title":"Arjun The Warrior Prince","Description":"The story is based on the early life of the Pandava brothers, loosely taken from the ancient Indian epic Mahabharata. The storyline begins with Arjun as a nine-year-old boy, and follows him until he grows into the warrior that the world knows him as. It explores his life with his brothers in Hastinapur, his training and education, and his ultimate discovery of the warrior within himself.\r\n\r\nThe movie begins with the young prince of Viratnagar asking a maid to tell him a story. The maid narrates him the story of Arjun.\r\n\r\nShe tells him that Arjun was a student of Drona, and that he learned the art of warfare from him. He was more skilled than all the students of Drona. None of his own brothers, nor his cousins - the hundred Kaurvas - could equal him in the art. Duryodhana and the other Kaurvas despised the Pandavas, for they feared that they might usurp Duryodhana's throne. When the king Dhritrashtra grew older, the rivalry between his sons the Kaurvas and the Pandavas intensified. Twice, Duryodhana attempted to kill all the Pandavas, but failed. To avoid further conflict, Dhritrashtra proclaimed Duryodhana as the crown prince of Hastinapur, and asked Yudhisthira to be the king of a distant unkempt territory of the empire.\r\n\r\nIn the meantime, Arjun won a swayamvar, and married the daughter of the King of Panchala, Draupadi. Duryodhana, who loathed the Pandavas, hatched a conspiracy with his uncle Shakuni and won all that belonged to the Pandavas in a betting game called chaupar. After losing everything, Yudhisthira betted his own brothers and Draupadi, and even himself. Draupadi was insulted in front of everyone, but Arjuna could not say anything because Yudhisthira was the king, and the king's words are the last words. The Pandavas, according to the rules of the game, had to go into exile for twelve years and an agyatavasa for one year. While all the Pandavas go one way, Arjuna travels North to do tapasya. Before leaving, Draupadi makes him promise that he will take revenge for her insult. He then leaves, and does tapasya, during which he earns a bow from the Lord Shiva.\r\n\r\nThe story then shifts back to the present day Viratnagar. It is revealed that the Pandavas are spending their secret exile, or 'agyatavasa', there, and are noticed by some of the spies of Duryodhana. According to the outcome of the game, if any one of the Pandavas is found before the end of that one year, the Pandavas will have to again go for a twelve-year exile. The spy informs Duryodhana that the Pandavas are in Viratnagar. So he launches an attack on Viratnagar with the help of his bandit friends. The king of Viratnagar leaves to thrash the marauding bandits. However, that is the bait. From the other direction Duryodhana's army comes, and it seems that the young prince of Viratnagar is the only one who is left to fight.\r\n\r\nUttar's maid drives the young prince's chariot to the field, but the prince, distraught by the number of enemies, flees. The maid stops him, and reveals her true identity: Arjun. Arjun retrieves his bow and makes prince Uttar drive his chariot. The warrior massacres the army and emerges victorious.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/24/2012","Runtime":96,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/93A6344F5F421EEA3FCD5C4B2448BE95.jpg"},{"Id":"8404c917","ImdbId":"tt2246595","OriginalTitle":"Blood Money","Title":"Blood Money","Description":"The story is about Kunal (Kunal Khemu) who believes he can do anything by trying his hardest. He receives a job offer through his friend Teeshay and his wife Nadini (Puja Gupta) in Cape Town and moves there with his wife Aarzoo (Amrita Puri). They live a happy life together, until Kunal becomes extremely workaholic. Kunal's this nature irritates Aarzoo which leads to frequent outbursts and quarrels. Kunal becomes the most trusted employee of his boss Dharmesh Zaveri (Manish Chaudhary). Kunal advances in his job. Soon Dharmesh is revealed to be an underworld gangster. The company Kunal works in deals with exporting diamonds; Kunal has no idea that it happens illegally. His boss, Mr. Zakaria, sends his hot colleague Rosa to charm Kunal and take him away from his wife. The plan works, and Kunal begins to work with Zakaria, with Aarzoo having no idea of this. Soon enough, Kunal realises the crime he is a part of and decides to and leave Cape Town. However, Zakaria knows that Kunal is aware of the illegal business and the only way to keep him silent is to kill him. Kunal gets fooled by a police officer who is joined with zakaria. Kunal decides to fight against him not knowing of the fact that the police officer has met up with zakaria. Kunal does everything against zakaria but when he reaches the plane area he gets to know about zakarias plan. Then kunal reveils to zakaria that it was his plan to do all this. Zakaria is then arrested and then it is shown at the end that kunal and aarzoo move back to madh island and kunal is shown reading hansel and gretel to little kids and the movie ends with a song.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"3/31/2012","Runtime":109,"Budget":3,"Revenue":1,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/654871B7F1F9AE63A4B5C966D4C6ECF0.jpg"},{"Id":"69af5715","ImdbId":"tt2406636","OriginalTitle":"Bhoot Returns","Title":"Bhoot Returns","Description":"Tarun, an architect, moves into a luxurious bungalow with his wife, Namrata, and their children, 10-year-old Taman and 6-year-old Nimmi. During an exploration of the house, Nimmi finds a doll, and includes someone named 'Shabbu' in all her activities. The family mistakes Nimmi's new doll to be Shabbu but are surprised when Nimmi points to an empty space and introduces her invisible friend as Shabbu. Her parents suspect her wild imagination as the reason for her new 'friend'.\r\n\r\nSoon, Tarun's younger sister, Pooja, surprises the family with a visit. As Tarun, Namrata and Pooja discuss Nimmi's fixation over Shabbu, the family servant, Laxman, is sure of a spirit's presence in the house. Laxman's worries receive severe backlash from Tarun, an ardent skeptic. Soon, each night at the bungalow seems to turn for the worse, with knocks at unearthly hours, demonic sounds and eerie movements. Tarun suspects Laxman to be the mischief-maker, trying to prove his points. As Nimmi's fixation with Shabbu increases, the family decides to consult a psychiatrist. The psychiatrist explains Nimmi's imaginary friend as a result of her loneliness and terms it as a common technique used by children to grab attention.\r\n\r\nLaxman's sudden disappearance and the increasing curiosity in Pooja to find answers for the ongoing activities make her install wireless cameras at various places in the house, which record Nimmi playing with what seems like a ghostly apparition. Tarun's mind starts reeling as he sees the captured footage; it is proof enough for the disturbed family to finally decide to leave the house. But the house has other plans: Nimmi is found missing the next morning. The police are called in to investigate but they consider the family delusional and do not take much interest in the matter.\r\n\r\nTarun receives a mysterious phone call, Nimmi's voice from the upper floor, after which they find Laxman murdered. The house seems to be on lock-down and the phones jammed. Taman is mysteriously killed. Nimmi appears possessed by the spirit and tries to kill both her parents, until she's finally burned and defeated with Pooja's help, as the remaining family flee, bloody and injured. Nimmi comes out from the building in low angle, then introduces herself as Shabbu to the neighborhood children.\r\n\r\nIt is inspired from Paranormal Activity.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"10/11/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9517E507EC62D713D23233B861376B2A.jpg"},{"Id":"cac110db","ImdbId":"tt2309987","OriginalTitle":"Hate Story","Title":"Hate Story","Description":"Kavya Krishna (Paoli Dam) and her best friend, Vicky, pull an anti-operation against one of the biggest business tycoons, which happens to be Siddharth Dhanrajgir's company. They take pictures of a few black-business deals and write an article that gets published. Siddharth, being a rich and cocky tycoon, wants revenge, so he calls Kavya up for coffee. He offers her a job in his company with a three hundred percentage raise in income, and Kavya accepts his offer immediately. They go on a business trip together, and Kavya helps Siddharth get his company a good deal. That night, Siddharth takes Kavya to dinner, where they both connect romantically and end up having sex. Upon returning, Kavya meets Vicky and gives him the gifts she got for him and says 'I love my job'. An upset Vicky is silent and sad, but does not show his feelings.\r\n\r\nThe next day, Kavya goes to work and finds out that her entry pass to the office has been cancelled. She goes to talk to Siddharth, who arrogantly talks about his plan and pulls a gun out, tortures her, and says that he never had any feelings for her; he just wanted revenge for the sting operation she pulled. He tells her that he punishes people who mess with him, and tells her to get out of his office. Heartbroken, Kavya leaves and applies for another job, with Vicky's support. While Vicky is dropping her, she runs out of the car and vomits. He takes her to the doctor, only to find out that she is now pregnant.\r\n\r\nKavya immediately meets Siddharth again, and he once again humiliates her, but she informs him that she is pregnant and says that she can prove that it's Siddharth's child (through DNA testing). That night, Siddharth calls her and pretends to be sorry for what happened. Kavya immediately runs to meet him. He kidnaps her, kills the fetus, takes out her ovaries, and dumps her. Kavya becomes a sex worker and sleeps with many people to get to Siddharth. First she contacts the CEO of Cementec, Rajdev Singh, sleeps with him and without his knowledge copies email from his phone. From there she comes to know that Cementec is going to do a joint venture with a German company due to which all shares of Delhi Cements company will fall. She leaks this information to Delhi Cements Chairman at the cost of ₹ 40 million. She reveals this to Siddharth and challenges him that she will destroy him. Siddharth then puts cameras all over her house without her knowledge but she somehow comes to know and uses his weapon against him only. Due to this Cementec suffers a loss of ₹ 100 billion. Siddharth kills Rajdev and puts the blame on Kavya by showing fake evidences. Kavya takes Cabinet minister's help to escape from jail by blackmailing him. She also offers to sleep with him at the cost of recovering the police file which contains her name and nominating her to the post of director of IIBI bank which holds accounts details of Cementec. After becoming the board member of Cementec, Kavya asks for balance sheets, all files access and all accounts passwords for tally. She goes through all papers with the help of Vicky and comes to know that Cementec has done a big scam. Kavya exposes this scam in the Annual General Meeting of Cementec. Finally Siddharth is arrested for stealing millions from share holders. Kavya goes back to her own house to get the watch gifted to her by Vicky. There she finds Rajdev's wife waiting for her with a gun. Rajdev's wife shoots Kavya thinking that she killed her husband. After killing Kavya she shoots herself too. The movie ends with Kavya's background voice saying, \"Mare hue log kabar se nahi dara karte, Vicky...\".(Dead people are not scared of Grave.)","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"4/20/2012","Runtime":140,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4EBEAE8B9E95FEE5512B6069B4C19FF8.jpg"},{"Id":"3e3501b9","ImdbId":"tt2181931","OriginalTitle":"English Vinglish","Title":"English Vinglish","Description":"Shashi Godbole (Sridevi) is a housewife who makes and sells laddoos as a home-run business. Her husband Satish, (Adil Hussain) and daughter, Sapna (Navika Kotia) take her for granted, mock her poor English skills and generally treat her with disrespect, making Shashi feel negative and insecure. However, her young son, Sagar (Shivansh Kotia) loves her as she is, and her mother-in-law (Sulabha Deshpande) offers her words of sympathy.\r\n\r\nShashi's older sister Manu (Sujatha Kumar), who lives in New York, invites Shashi's family to her daughter Meera's (Neeju Sodhi) wedding to Kevin (Ross Nathan). It is decided that Shashi will go to New York alone to help Manu organize the wedding, and her husband and children will join her as the wedding approaches. During her flight to America, Shashi is given inspirational advice by a fellow passenger (Amitabh Bachchan/Ajith Kumar). While Shashi is in New York, she has a traumatic experience at a coffee shop due to her inability to communicate in English. Using the money she made from selling laddoo's she secretly enrolls in a conversational English class that offers to teach the language in four weeks, showing her resourcefulness at navigating an unfamiliar city alone. The class comprises: David Fischer, the instructor (Cory Hibbs); Eva, a Mexican nanny (Ruth Aguilar); Salman Khan, a Pakistani cab driver (Sumeet Vyas); Yu Son, a Chinese hairstylist (Maria Romano); Ramamurthy, a Tamil software engineer (Rajeev Ravindranathan); Udumbke, a young African-Caribbean man (Damian Thompson); and Laurent, a French chef (Mehdi Nebbou). Shashi quickly becomes a promising and committed student, earns everyone's respect with her charming behavior and her cuisine, and gains self-confidence. Laurent becomes attracted to Shashi. When he tries to kiss her at the rooftop of a building, Shashi pushes him away and runs off, but fails to explain that she is married.\r\n\r\nMeanwhile, Shashi's niece Radha (Priya Anand) who is Meera's younger sister finds out about her secret English classes and is supportive of her pursuit. Shashi starts watching English films at night and does her homework assiduously. To complete the English-speaking course and get a certificate, each student must write and deliver a 5-minute speech. Shashi's family joins her in New York earlier than planned, to surprise Shashi. Shashi tries to continue attending class, but decides to quit because of schedule conflicts, and asks Radha to inform David Fischer. The test date coincides with that of the wedding, and Shashi is forced to miss the test.\r\n\r\nRadha invites David and the entire class to the wedding, where Shashi's husband Satish is taken aback at being introduced to a diverse group of people by his wife. Shashi gives a touching and enlightening toast to the married couple in English, surprising everyone who knew her as a typical, conservative, Indian housewife. In her speech, Shashi extols the virtues being married and having a family, describing the family as a safe space of love and respect where weaknesses are not mocked. Shashi's husband and daughter regret treating her with disrespect. Her teacher David declares that she has passed the course with distinction and issues her the certificate. Shashi thanks Laurent for \"making her feel better about herself\". Shashi's family return to India; during their flight home, Shashi asks the flight attendant in fluent English whether she has any Hindi newspapers in Hindi version.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":16,"Rating":3.95,"CensorRating":"U/A","ReleaseDate":"10/5/2012","Runtime":134,"Budget":150000000,"Revenue":1200000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A87298595934A82C47E0BB5B56DC7CE8.jpg"},{"Id":"5676d1b2","ImdbId":"tt1714866","OriginalTitle":"Midnight's Children","Title":"Midnight's Children","Description":"Midnight's Children is a 2012 British-Canadian film adaptation of Salman Rushdie's 1981 novel of the same name. The film features an ensemble cast of Satya Bhabha, Shriya Saran, Siddharth Narayan, Ronit Roy, Anupam Kher, Shabana Azmi, Seema Biswas, Shahana Goswami, Samrat Chakrabarti, Rahul Bose, Soha Ali Khan, Anita Majumdar and Darsheel Safary. With a screenplay by Rushdie and directed by Deepa Mehta,[3] the film began principal photography in Colombo, Sri Lanka in February 2011 and wrapped in May 2011. Shooting was kept a secret as Mehta feared protests by Islamic fundamentalist groups.[4]\r\n\r\nThe film was shown at the Toronto International Film Festival, the Vancouver International Film Festival, and the BFI London Film Festival. The film was also a nominee for Best Picture and seven other categories at the 1st Canadian Screen Awards, winning two awards.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"12/26/2012","Runtime":146,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/EC808578AEFD1E6DBBB5CB5083F5D9F0.jpg"},{"Id":"517ea299","ImdbId":"tt2387495","OriginalTitle":"Jalpari The Desert Mermaid","Title":"Jalpari The Desert Mermaid","Description":"A well-heeled family from tony neighborhood of New Delhi travels from the city through dusty roads that lead into the Madhogarh village, district Mahendragarh in Haryana, far out and buried in the debris of the past. Shreya, the tomboy of the family, finally arrives at her father’s village for the first time during her vacations, that too after coaxing her father, Dev, to the best of her abilities. She and her brother, Sam, had, in their imagination, spun the village right out of a fairytale, replete with streams, lakes and grasslands that will allow them to run free. But all they find are dusty alleys, dried up ponds and hostile playmates until they spin their magic and befriend this unknown place, especially some of its people, like the Pehelwan and the gang of kids led by Ajithe. The story revolves around Shreya and Sam’s adventures and misadventures which turn this dull place bereft of water into a land of enchantment, mischief and a million exciting exploits. But unknown places have many secrets, and here too, secret lurk at every corner. Strangely behaving villagers, a witch whom everyone seems to be terrified of, and a no-access zone beyond the hills intrigue Shreya, more so after housemaid Shabri tells her various mysterious stories about the village. Then, one night, Shreya sees Shabri and her husband Trilochan slink away, and starts following them, only to find out a horrifying secret the village harbors. At the end they were all shocked to know that they all kill the girl child before they born and they were scaring all the village at the name of a witch","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"8/31/2012","Runtime":94,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3E2D977D92AD1A1F2F5C791652DFC3D1.jpg"},{"Id":"ae793ebf","ImdbId":"tt1891755","OriginalTitle":"Billa II","Title":"Billa II","Description":"David Billa (Ajith Kumar), a Sri Lankan Tamil refugee along with several others, arrives at the town of Rameswaram in boat. After being interrogated by an arrogant civil servant, he is let into the refugee camp where he befriends Ranjith (Yog Japee). David makes his presence felt, when he slaps Muthu (Theepatti Ganesh) one of the rogue workers around for making a derogatory comment. The refugee camp is constantly terrorised by a corrupt police officer Raghubir Sinha (Krishna Kumar). After witnessing the brutal murder of one of the inmates at his hands, David attacks Raghubir when he tries to forcefully detain one of his friends. Raghubir then gets David tortured in prison, and vows to make him suffer. A few days later, Muthu calls David and Ranjith aside and promises them work. Billa and Ranjith are hired to transport fish from Rameshwaram to Chennai. But unknown to them, the truck they were driving had diamonds inside, and Raghubir had alerted his men on the highway to catch them red-handed. As per the plot they get caught in the check post, and after realising what had happened, Billa kills all the cops and drive the truck to its destination. Here they meet Selvaraj (Ilavarasu) who is pleased by Billa's loyalty and includes him in his businesses. Billa gets back and murders Raghubir as well as the arrogant civil servant he had initially met at the camp. He then goes to meet his elder sister (Janaki Sabesh) and his niece Jasmine (Parvathy Omanakuttan) in a church. When they see his gun, they realise that he is involved in crime. Not knowing what to say, Billa simply walks away.\r\n\r\nKotiswara Rao(Manoj K.Jeyan) visits Selvaraj and asks him if he could help in selling off the cocaine he had brought along with him. Billa volunteers to sell it off on a five percent commission in exchange. Billa sets off and delivers the cocaine to a local thug who however refuses to pay for it in return. In a brutal scuffle that ensues, where one of Billa's friends is slaughtered, Billa takes out the thug and his men and returns with both the money and the cocaine. Soon Billa meets Koti's boss Abbasi (Sudhanshu Pandey) who is very impressed by the former and recruits him. After a party held at his club he receives a phone call from the Russian mafia led by Dimitri (Vidyut Jamwal) telling him that his arms consignment has been held by the Indian coastal guards and he asks for his help. Billa and Ranjith retrieve the consignment for him. Both are congratulated by Dimitri for their work.\r\n\r\nSoon David Billa learns that his sister has died, and he brings Jasmine with him to live in a big villa in Goa. Jasmine displays her feelings for him, but Billa does not reciprocate, and is instead more concerned at her education and safety. Billa travels to Russia along with Koti to meet Dimitri who happens to own an arms and ammunition manufacturing unit, with Kotiswara Rao where he signs a deal with Dimitri without the knowledge of Abbasi in presence of Jagdish (Rahman), a corrupt Interpol officer helping these underworld criminals. Abbasi learns of this from Koti, and is furious at Billa's daring and disobedient behaviour. Tensions further increase when Billa beats up Satish Kumar (Rohit Khurana), son of an influential minister Praveen Kumar (Dinesh Lamba), when he tries to misbehave with Jasmine in a party. Abbasi expresses his discontent and vents at him. Billa surprised and enraged at his ingratitude, walks away with Ranjith. This is the first half of the movie.\r\n\r\nBilla then along with his henchmen Ranjith and Ram (Sarath Mandava) plots to venture into the drug business on their own during the carnival. And at the carnival, Billa is betrayed by Ram and is brutally attacked and left for dead. Billa however survives, finishes off the assailants and returns to confront Abbasi and Ram and kills them both. Now Billa becomes the most powerful crime lord extending his business without any boundaries. He also ropes in Abbasi's girlfriend, Sameera much to Jasmine's displeasure.\r\n\r\nDimitri arrives into the scene and tries to negotiate a deal with Billa. But Billa refuses for his low payment, and angered by his defiance and rebellion, Dimitri seeks to oust him. Dimitri seeks out the help of Koti, Satish and Praveen Kumar to eliminate David. They proceed to kill the Chief Minister and the blame falls upon Billa. However Billa with Ranjith's assistance is freed and Koti kidnaps Jasmine to lure him. Billa rescues her and he informs Sameera to come to a church to take Jasmine away to Malaysia to safety. But Sameera conspires against them and the goons with the minister's son arrive at the church, and hold both Billa and Jasmine captives. Billa stabbed in his abdomen, is held to the ground. He is mocked at by Satish, who slits Jasmine's throat. Unable to witness her death, Billa overpowers everyone and kills all the goons including the minister's son. This is the scene at which the film initially starts.\r\n\r\nMeanwhile, in Russia, Dimitri is having an auction of his weapons and Koti is also present with him . He shows his factory in his computer via a series of webcams and much to everyone's shock, Billa is seen destroying his factory in Georgia. He also sees his delivery train go off course. Angered with fear, he kills Koti for not killing Billa as promised, and he sets out himself to finish the task. The arms factory is completely destroyed by Billa and his friends. Dimitri arrives and follows his delivery train, when to his shock, the delivery train is blown by Billa who would be waiting for him on his own helicopter. After an intense battle, Billa kills Dimitri by throwing him out of the helicopter. In the concluding scene, Billa and Ranjith board a plane, and the former's goons eliminate the rest of the conspirators. Sameera is also killed in the process.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"7/13/2012","Runtime":129,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D130992D25ADF50E8FDEEDB4EFDAC884.jpg"},{"Id":"67ef7ff2","ImdbId":"tt2347289","OriginalTitle":"Bittoo Boss","Title":"Bittoo Boss","Description":"The movie is about a guy's journey (Pulkit Samrat) of a wedding videographer from Punjab who is young charming, ingenious calling himself a \"Sesky Video Shooter\".\r\n\r\nBittoo believes in spreading happiness through the beautiful moments he captures and keep watching for years and smile looking at them.\r\n\r\nHe falls in love with an educated and strong-headed girl (Amita Pathak) who makes him realize the importance of financial stability and monetary gains in order to gain respect and recognition.\r\n\r\nSmitten in love and bitten by the one he loves, the smart and righteous cameraman is lured to take a shortcut in order to earn a quick buck and get his life back on track. What follows is a madcap ride","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"4/13/2012","Runtime":116,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0A688D16DA489EC0F1618492DEA21D2F.jpg"},{"Id":"46e84047","ImdbId":"tt2356426","OriginalTitle":"Le Halwa Le","Title":"Le Halwa Le","Description":"Sonali (Payel Sarkar) has run away from a small village to get a job in the big city, where she hopes to make enough money to pay off the debts her family owes their landlord. Otherwise Anjali will have to marry the landlord's son, Langcha(Kanchan Mukherjee). Once she arrives in the city, the only way she can find cheap lodging is by pretending to be married to a total stranger, Subho (Hiran), an aspiring musician. Subho and Sonali initially don't get along but must make do to retain their low-rent accommodation.\r\n\r\nMeanwhile, an electronics salesman named Rahul (Soham) is struggling to find a loan to start his own business. His wealthy dad refuses to loan him a single penny, and he is quite frustrated. \r\n\r\nMeanwhile, millionaire businessman Harshavardhan BanerjeeMithun Chakrabarty), who lives in a village with his wife(Laboni Sarkar) and retains the mannerisms of a villager despite his untold riches, decides to spend a few weeks in the city. He and his wife are afraid of becoming estranged from their London-educated son when they return home; a stint in the city observing the ways of city folk seems like a good idea. Mr. Banerjee owns a large villa in the city but has never lived there, leaving it occupied by his servant Madhusudan.\r\n\r\nUnknown to Mr.Banerjee, someone has been living at his villa for the past couple of weeks, having struck a deal with Madhusudan. The plan involves pretending to be Mr.Banerjee’s son and asking Sonamoy for his daughter's hand in marriage. The plan has been working to perfection so far, with money- and status-conscious Sonamoy having visited the villa, having become impressed with that guy, and having decided to betroth his daughter to someone he believes is Mr.Banerjee’s real son. \r\n\r\nHowever, the plan is about to fall apart at the final hurdle, with news that Mr.Banerjee is unexpectedly arriving in town tomorrow. Fearful for his own employment, Madhusudan begs that guy to make some excuse to Sonamoy, leave the villa and find temporary shelter elsewhere until Mr.Banerjee has come and gone.\r\n\r\nSonali gets news of Mr.Banerjee’s arrival from a friend and pays a visit to the villa in the hope of landing a job there. She turns up for an interview, but Mr.Banerjee’s's wife does not like her husband's bubbling behavior towards the young, attractive Anjali and slams the door in her face. Desperate for a job, she decides to wait outside the door in the hope of seeing Mr.Banerjee again when he steps outside by himself. At this point, Rahul shows up at the villa to fix a stereo his shop sold Mr.Banerjee the day before. When he sees Sonali at the door, he mistakes her for the daughter of Mr.Banerjee and instinctively starts wooing Sonali.\r\n\r\nUnable to land a job at the Banerjees, Sonali later bumps into Rahul when she replies to a help wanted ad in the newspaper for work at Rahul’s new store. Rahul is perplexed as to why super-rich \"Mr. Banerjee's daughter\" would want to work a mediocre job but agrees to hire her without inquiring too deeply, realizing the golden opportunity such arrangement offers him in being able to woo her daily. Sonali, realizing Rahul’s's mistake, does not correct him, realizing she may not land the job if Rahul finds out she is a poor village girl.\r\n\r\nSubho, in the meantime, has begun to fall in love with Sonali while living with her. However, with Rahul beginning to spend a considerable amount of time with Sonali outside of work, its simply a matter of time before Subho and Rahul cross paths. When they do, the result is an immediate and highly public verbal altercation. Sonali is able to avoid Rahul discovering the fact that she knows Subho and shares a room with him. Every day after work, Rahul drops Sonali off at the Banerjee villa mistakenly believing she lives there as Mr.Banerjee’s daughter. As soon as he drives off, Sonali turns away from the front door and hastily makes her way out before the Banerjees can spot her.\r\n\r\nAs it turns out, Mrs. Banerjee also happens to be named Sonali, which leads to much confusion and misunderstanding between Rahul, Sonali, Mr. Banerjee, and Mrs. Banerjee. With Rahul often showing up at Mr. Banerjee’s villa asking Mr. Banerjee for \"Sonali\" and Mrs.Banerjee often spotting the real Sonali outside the villa where Rahul drops her off after work, soon, the Banerjees become convinced that each is having an affair with the younger counterparts. This results in several acrimonious arguments and much tantrum throwing between the elderly couple.\r\n\r\nTo make matters even more complicated, Sonali receives a letter from home, informing her that her prospective groom Langcha is coming to the city to see her. Langcha arrives the next day but is intercepted by Subho at the train station, who comes up with a plan to scare the simpleton Langcha away from the city before he can get in touch with Sonali.\r\n\r\nIn the meantime, Sonamoy, too, has visited the villa on several occasions. Upon finding the Banerjees there and Madhusudan and that guy missing missing, has become very agitated, with the honor of his daughter in the balance. Mr. Banerjee tries to explain to him that he has no son here in the city and, even if his son came here from London without his knowledge, he would never ever marry the daughter of some low-class person like Sonamoy. Tensions soon boil over between Mr.Banerjee and Sonamoy.\r\n\r\nNow Mr. Banerjee is after Rahul for his perceived dalliances with his wife; Sonamoy is after Mr.Banerjee and his missing son ; Rahul is after Mr. Banerjee for Sonali's hand in marriage; and Subho's landlord's wife has fallen for Subho and is after him about eloping with her. All the major characters start chasing after each other and end up in a warehouse, where a big melee follows.\r\n\r\nIn the end, Rahul and Subho confront Anjali and profess their love for her, forcing her to choose between them. Seemingly cornered into a difficult choice, Sonali proceeds to write Rahul and Subho's name on several chits, folds them up and asks Rahul to pick one. Whoever's name shows up, she promises to marry him. Rahul is reluctant, convinced she is in love with him, but he picks up a chit and Subho's name shows up. Sonali walks off into the sunset with Subho. When a disappointed Rahul collapses to the floor in despair and opens the other chits, they all have Subho’s name: Sonali had fallen in love with Subho along the way and the chits were written in such a way so that Rahul would not be that disappointed when he came to know the truth.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":14,"Rating":2.86786,"CensorRating":"U/A","ReleaseDate":"4/13/2012","Runtime":125,"Budget":15000000,"Revenue":25000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1BDF253C45174A678F3E49C6A4F577E0.JPG"},{"Id":"825724af","ImdbId":"","OriginalTitle":"Zindagi Tere Naam","Title":"Zindagi Tere Naam","Description":"The film starts with an old man, named Mr. Singh (Mithun Chakraborty), narrating a story to an old woman as her memory is slipping day by day. Mr. Singh tells about young lovers Siddharth and Anjali, played by Aseem Ali Khan and Priyanka Mehta, respectively. Anjali is a rich girl, but Siddharth is a poor man's son. Anjali's father (Dalip Tahil) disapproves this affair and takes the daughter away. Dejected Siddharth starts writing letters to her. He writes 365 letters in that entire year, but never hears from Anjali. She believes that he has forgotten her. Years pass and Anjali could not find Siddharth, so she eventually plans to settle down with another man. But destiny had other ideas and the two lovers meet again. As the flashback ends, the film goes back to the elder couple. The old woman realizes that Mr. Singh was telling the story about their own love story, and her memories of the past come rushing back. Mr. Singh is briefly happy, but his wife's memory leaves again.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"3/16/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F2D7C6EC1A38D613176B7BCC650FCF71.jpg"},{"Id":"9d6985ee","ImdbId":"tt1956433","OriginalTitle":"Ata Pata Lapatta","Title":"Ata Pata Lapatta","Description":"Manav Chaturvedi (Rajpal Yadav) files a police complaint of robbery where the entire house has gone missing. Chaturvedi is suspected of abolishing his own house in order to claim the insurance money. The case comes to the media's attention and soon becomes a topic of everyone's interests. Due to media pressure, authorities are forced to acknowledge the robbery. The film focuses on the loopholes of governance, bureaucracy and the attitude of people in power.","TrailerLink":"https://www.youtube.com/watch?v=0KqqfIVqatc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/0KqqfIVqatc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.6,"CensorRating":"U/A","ReleaseDate":"11/2/2012","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0850FC9AD03C4D0A098F1A35816752E3.jpg"},{"Id":"a628035e","ImdbId":"tt2342061","OriginalTitle":"Devudu Chesina Manushulu","Title":"Devudu Chesina Manushulu","Description":"The movie opens with Lord Vishnu (Bramhanandam) trying to pacify Lakshmi Devi (Kovai Sarala), who is quite disappointed after listening to words of Narada that Lord Vishnu didn't gave any present to Lakshmi Devi on the eve of her Birthday (Akshaya Tritiya). Lord Vishnu shows a love story between 2 orphans Ravi Teja (Ravi Teja), a settlement broker in Hyderabad and Ileana (Ileana D'Cruz), a taxi driver living in Bangkok.\r\n\r\nPanileni Papayya (M. S. Narayana) sits at a shop, eats a banana & throws the peel on the road. Using the peel, Lakshmi Devi creates a small problem which leads C.I. Subbaraju (Subbaraju) killing Sandy, a trusted goon of the absent-minded Don Prakash Raj (Prakash Raj) of Bangkok. Thus to settle the problem between the two, Ravi Teja goes to Bangkok. At the airport, a taxi driver Goli (Ali) steals the bag of Ravi Teja which has his belongings including passport. He chases him in Ileana's cab but his efforts are in vain. Feeling bad upon learning he is an orphan like her, Ileana invites Ravi Teja to her home. Next day he finds Goli, who is a die-hard devotee of Lakshmi Devi and meets Prakash Raj through him and settles the problem. Prakash Raj, who lusts after Ileana, asdks Ravi Teja to send Ileana for a night. He bashes his entire team and runs to Ileana who is already in love with him. Both quarrel and get separated. Unhappy with the turn of events, Lakshmi Devi goes into the past and makes Papayya throw the Banana peel into a dust bin instead on the road.\r\n\r\nDue to this the story turns like this: Sandy is caught red-handed by Subbaraju and Sandy is sent to jail. As Sandy is a trusted goon and has all the information regarding his activities, Prakash Raj is furious and wants Sandy released. Ravi Teja is appointed by Prakash Raj's henchmen to strike a deal between Subbaraju and Prakash Raj. Both Ravi Teja and Subbaraju go to Bangkok.\r\n\r\nAt the airport he sees Ileana for the first time and falls in love with her, due to which he refuses to sit in the taxi of Goli and sits in her taxi. Meanwhile, Prakash Raj's men chase them in Goli's Taxi. During the chase, Subbaraju, Ravi Teja and Ileana are safe but their taxi is destroyed. After a long argument, Ravi Teja promises to buy a taxi when the deal is over and stay at Ileana's house as Subbaraju is injured. Meanwhile, Ravi Teja flirts with Ileana which infuriates her. Both go to Prakash Raj and settle the problem for ₹2 crore. Prakash Raj sees his sister in Ileana and is ready to do anything for her. Ileana accepts him as her brother. Meanwhile, Ravi Teja proposes to Ileana to which she accepts happily.\r\n\r\nAt the time of closing of deal, Prakash Raj brings the ₹20 million but Subbaraju comes with Police. Meanwhile, Ravi Teja & Ileana quarrel but both hug each other, expressing their love. Finally after a fight sequence, Ravi Teja & Ileana are shown to live a happy life & Prakash Raj is a member of their family who would return to their home after six months of imprisonment. The whole story is seen by Lakshmi Devi and Lord Vishnu is successful in making her happy.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":1.25,"CensorRating":"U/A","ReleaseDate":"8/15/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F46CD1754E77F82B9701ACF7D98ED015.jpg"},{"Id":"a83f68bb","ImdbId":"tt1971365","OriginalTitle":"Dangerous Ishhq","Title":"Dangerous Ishhq","Description":"The story of the film spans over a period of four centuries and tells four different stories set in different time periods. Supermodel Sanjana (Karisma Kapoor) and Rohan (Rajneesh Duggal), son of one of the nation's foremost business tycoons have been one of the most popular couples in the social circuit. When Sanjana decides against flying to Paris at the last minute for a lucrative modelling assignment, she does so, not just because she cannot bear to stay away from her boyfriend Rohan, but more importantly because her instincts push her against going. But what her instincts cannot do is stop Rohan from getting kidnapped. The high profile kidnapping creates chaos in Sanjana's life. The kidnappers demand 500 million. The police however believe that even paying the ransom will not bring Rohan back. Shortly after Rohan gets kidnapped, Sanjana starts hearing strange noises. She has visions of Rohan calling her Geeta. With all this happening, Sanjana realises that she can read Urdu even though she has never learnt it. She informs her doctor friend Neetu (Divya Dutta) about it, who in turns refers her to a psychiatrist.\r\n\r\nThe latter informs Sanjana that Rohan's kidnapping is somehow linked to her past lives. Sanjana undergoes a past life regression where she sees herself as Geeta, a young Hindu girl who is in love with Iqbal (Rajneesh Duggal). Her entire family has been killed by her uncle. Iqbal suggests that the only way Geeta can escape her death is by leaving the country and settle down in India. Later, it is revealed that Iqbal's friend Aarif (Arya Babbar) is the antagonist, whose purpose is to separate the two lovers.\r\n\r\nSanjana's next life is that of a Muslim girl, Salma. Here again, she loves a young man named Ali (Rajneesh Duggal). The latter leaves for a war with his companion Rashid (Sameer Kochhar). When the war is over, everyone returns except for Ali. Rashid informs Salma that her lover has been killed. It is later revealed that Ali is alive and that it was all Rashid's plan to separate the two lovers. With this particular regression, it is also revealed that Rohan's younger brother Rahul (Ruslaan Mumtaz) has a hand behind his kidnapping.\r\n\r\nSanjana's last past life is that of a young Indian celibate named Paro. She is secretely in love with Raj Dutt (Rajneesh Duggal). The Commander-in-Chief of Rajputana, Durgam Sah (Ravi Kissen) also loves her. When she rejects his love and commits suicide, Durgam Sah takes the help of a psychic named Mantra. He asks her to give him the power to remember everything regarding his current life so that he can continue to separate the two lovers in the next lifetimes. That being said, Durgam Sah, Rashid, and Aarif all have the same soul, but different faces. Their only aim was to separate Sanjana and Rohan. Now the question remains: in which form did Durgam Sah take birth during the present life? During the climax, it is finally revealed that ACP Singh (Jimmy Shergill) is the new Durgam Sah. In a dangerous game of cat-and-mouse all is revealed and at the film's climax, Sanjana is able to recognise who ACP singh really is by a mark on his shoulder which all his previous lives have had, and then proceeds to fatally wound him. This breaks the cycle, and it is revealed that Sanjana and Rohan's souls are able to be together for ever.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/11/2012","Runtime":130,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/309F1E2D6550FC2040CB46412CEF91C6.jpg"},{"Id":"a87fca0b","ImdbId":"tt2288124","OriginalTitle":"I m 24","Title":"I m 24","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":2.5,"CensorRating":"U/A","ReleaseDate":"8/31/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6557E4332740D19544DCF7F0DFCD2EB8.jpg"},{"Id":"aab06d92","ImdbId":"tt2429086","OriginalTitle":"Hero","Title":"Hero","Description":"In this visually arresting martial arts epic set in ancient China, an unnamed fighter (Jet Li) is being honored for defeating three of the king's most dangerous enemies. When Nameless recounts his battles with the assassins -- Broken Sword (Tony Leung Chiu Wai), Flying Snow (Maggie Cheung Man-yuk) and Moon (Zhang Ziyi) -- the king begins to question some of the details. As Nameless goes on, the king challenges the tales, interjecting his own take on these perhaps suspect version of events.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/25/2012","Runtime":163,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B6246AEFD94FAFC46CB893FB829EF0A5.jpg"},{"Id":"1c6fc904","ImdbId":"tt2188749","OriginalTitle":"Gali Gali Chor Hai","Title":"Gali Gali Chor Hai","Description":"Part-time 'Hanuman' at the local 'Ramleela', but full-time cashier at the bank – that's Bharat, an 'Aam Aadmi'. He resides in the heart of Bhopal, with Nisha, a school teacher and his loving and caring, but doubting wife, who is concerned more about her husband's promotion from cashier to manager rather than his flying tricks onstage. Bharat's father, Shivnarayan, an old-timer who values freedom and hopes to see his country corruption-free someday, completes the small and happy family. However, there's also an uninvited houseguest in Bharat's household; Amita, a young, beautiful girl who works at a call center and often likes to hitch a ride with Bharat on his scooter, when he is not busy dropping his wife to her school.\r\n\r\nContrary to his wife's wishes, Bharat's sole ambition in life is to graduate from his role as 'Hanuman' to 'Lord Ram' someday. However, that puts him at loggerheads with Sattu Tripathi, younger brother to the local MLA and a bad actor playing 'Lord Ram', who is perpetually annoyed at being upstaged by 'Hanuman'. His older brother, MLA Manku also has his share of problems with Bharat, who refuses to let out an extra room to him for his re-election campaign.\r\n\r\nBharat's happy little haven is disturbed rudely one day when the local 'havaldaar' Kushwaah comes knocking at his door, claiming to have caught a thief, Chunnu Farishta, who purportedly stole a fan from his house, a theft that Bharat has no idea about, though the local 'panwala', Bachhu Gulukand is a sworn witness. Virtually ordered to come to court, Bharat finds himself suddenly dealing with made-up testimonies, lazy judges, and crooked characters of all sorts, trapped in the system that plagues the country today.\r\n\r\nOut of nowhere, Bharat finds himself stuck in a hilariously vicious circle of corruption, having to bribe his way from cops to criminals, witnesses to lawyers, and even the judge, all in an effort to get out of the rut that is the Indian system. Along the way, this cashier-cum-Hanuman also finds his ideals again, learning to stand up for the rights of the common man and give a slap to the system, and becomes the subject of national news, exposing the thieves that line every lane here...!","TrailerLink":"https://www.youtube.com/watch?v=KRqpxt3Gy_c","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/KRqpxt3Gy_c\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"2/3/2012","Runtime":0,"Budget":27000000,"Revenue":57700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/79FF5A33C1DE940F3EC475F3655DCCFF.jpg"},{"Id":"6750cbe7","ImdbId":"tt2126282","OriginalTitle":"Ekk Deewana Tha","Title":"Ekk Deewana Tha","Description":"Sachin Kulkarni (Prateik Babbar) is a student of mechanical engineering in Mumbai who aspires to become a filmmaker. His friend introduces him to cinematographer Anay (Manu Rishi). With Anay's help Sachin becomes an assistant to director Ramesh Sippy. Sachin's family, who are Marathi Brahmins, rent Jessie Thekekuttu's (Amy Jackson) house. Jessie is from a conservative Malayali Nasrani Christian family from Alappuzha, Kerala, that lives upstairs. Sachin falls in love with Jessie the moment he meets her. Sachin tries to interact with Jessie, who is afraid of speaking to men around her strict father, and ends up angering Jessie. Unable to hide his feelings for her any longer, Sachin confesses his love for her, to which she does not respond. A few days later, Sachin learns from his sister that Jessie has gone to Kerala to visit her grandmother. He, along with Anay, ends up in Kerala to look for her. After several days, he finds her, apologises and she introduces him to her family in Kerala as her \"classmate\". Jessie denies she has any feelings for him, but agrees to be his friend. On the train journey back home, however, the two get closer and share a passionate kiss. Sachin is convinced Jessie loves him; the two meet several times and Jessie begins to admit that she also likes Sachin, but wants to refrain from any problems because she knows her father wouldn't give her hand in marriage to a Hindu. Consequently, due to various misunderstandings between Jessie's brother and Sachin, her parents learn of their supposed affair. They fix a match and schedule her wedding. The day arrives and midway through the ceremony, Jessie refuses to marry the groom, displeasing everyone in her family. Sachin, who had, without anyone's knowledge, come to Kerala to witness the wedding is ecstatic and secretly visits Jessie at her home. It is then that Jessie admits she has indeed fallen in love with him. Sachin and Jessie continue to love each other without the knowledge of their parents.\r\n\r\nAt this point of time, Sachin goes to Goa on a 40-day shoot, where he gets busy. Meanwhile, the topic of Jessie's marriage comes up again at her home when the guy whom she refused to marry earlier pays them a visit. Panicking, Jessie calls Sachin and tells him that she wants to elope with him. Sachin, who he is travelling through less than ideal places, tells Jessie to stay in Mumbai for now, and that soon he would be back and they can discuss. Jessie stops taking Sachin's calls and so he goes back one night to check on Jessie. He comes to know that Jessie has decided to break up, as the relationship is not peaceful due to her parents' disapproval. She says she has agreed to get married to a boy of her parents' choice. When Sachin pleads her not to do it, she tells him that a time had come when she was willing to elope, but the moment was gone. She doesn't want Sachin to wait for her, as he has his dreams to fulfill. Sachin later comes to know that she is married and settled abroad.\r\n\r\nTwo years later, Sachin meets Samantha (Samantha Ruth Prabhu). She falls in love with him, but is rejected by Sachin who feels that he hasn't yet gotten over Jessie. He then comes up with a script for his first film, which happens to be his very own love story. He calls upon an actor (Ashwin Kakumanu) as the film's protagonist, Samantha as the female lead and Anay as the film's cinematographer, and the film is eventually titled Jessie. While shooting for the film in Taj Mahal, he sees Jessie and she comes to speak with him. She admits that she is not married and is still in love with him, and he too says she is still in his heart. Sachin proposes yet again and they get married the same day. This is actually revealed to be the end scene in Sachin's movie – which Sachin and Jessie in real life are watching together in the theatre. After the film ends, Jessie praises Sachin for his efforts and the latter agrees to drop her home, implying that they are reunited.\r\n\r\nA second ending to the film was released, which was the director's cut.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":2.5,"CensorRating":"U/A","ReleaseDate":"2/17/2012","Runtime":0,"Budget":0,"Revenue":495,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/43FD4F8EF2D0E10134CE80420FEA30BF.jpg"},{"Id":"17bfdad3","ImdbId":"tt2401225","OriginalTitle":"Uu Kodathara Ulikki Padathara","Title":"Uu Kodathara Ulikki Padathara","Description":"The story of the film revolves around a palace known as ‘Gandharva Mahal’ which belongs to Rayudu (Prabhu), the present head of a royal family that has lost its former splendor. Rayudu lives with his wife (Meena Kumari) and two daughters Visalakshi (Madhumitha) and Jagadha (Deeksha Seth) in a small house beside the Mahal. Rayudu rents out the palace to make ends meet. He is shown as a soft and generous man. Some of the tenants take this generosity for granted and harass Rayudu, without paying the rent.\r\n\r\nInto this scenario comes Manoj (Manoj Manchu), as someone seeking a place to rent. He slowly gets rid of the problematic elements in the palace and restores control to Rayudu. Manoj falls in love with Jagadha. A happy Rayudu decides to get Visalakshi married and decides to give away the Gandharva Mahal as dowry. One night, Manoj comes to Rayudu with a bloodied nose and claims that he saw a ghost which tried to kill him and warned him about selling the Mahal. Rayudu reveals that the ghost might be his dead father, Rudramaneni Narsimha Rayudu (Nandamuri Balakrishna) and explains the history of Gandharva Mahal to Manoj.\r\n\r\nGandhrva Mahal has been with the Rudramaneni family for centuries and was passed on to Narasimha Rayudu (Nandamuri Balakrishna), a Zamindar who is well respected in the village. He lives with his wife (Panchi Bora) and sister Jagadamba (Simer Motiani). He marries his sister Jagadamba to Phanindra Bhoopati (Sonu Sood). Few days after the marriage, Bhoopati insults Narsimha Rayudu and asks him to give their share in the family property. Deeply hurt by the incident, Narsimha Rayudu gives half of everything he owns including the Gandharva Mahal to his sister and walks out of the house. He also gives hundred acres of land to Seshayya (Bhanu Chander), his trusted employee and friend. It is later revealed that Bhoopati married Jagadamba only for the money and wants to marry his sweetheart Amrutha Valli (Lakshmi Manchu). Amrutha doesn't want to marry Bhoopathi since he already has a wife. Consequently, Bhoopathi kills Jagadamba and makes it look like a suicide.\r\n\r\nOn hearing the news, Narasimha Rayudu is devastated. Only a week after Jagadamba's death, Bhoopathi tries to marry Amrutha in the Gandhrva Mahal. Narasimha Rayudu, angered by Bhoopathi's actions, confronts him. Bhoopathi gets into a fight with Narasimha Rayudu and stabs him with a sword. He also reveals to Amrutha and the dying Narasimha Rayudu that he was the one who murdered Jagadamba. In anger, Narasimha Rayudu kills Bhoopathi and dies in the Mahal. Amrutha, saddened by the events, blames herself for the whole incident and eventually turns into a beggar.\r\n\r\nIn the present, Gandharva Mahal is readied for the marriage of Visalakshi. The bridegroom Rishi (Richard Rishi) and his family arrive for the wedding. It is revealed that Rishi's uncle Bujji (Sai Kumar) wants to take the palace and convert it into a hotel. Later that night, Bujji sees Narasimha Rayudu's ghost and gets scared. Bujji seeks the help of a Mantrik (Ajay) who reveals that the house is indeed haunted by the souls of Bhoopati and Narasimha Rayudu. He captures the violent soul of Bhoopathi and traps it in a bottle. It is also revealed that Manoj is Seshayya's grandson and was sent by his mother Suguna (Suhasini Maniratnam), Seshayya's daughter to help Rayudu and his family. Manoj reveals to Jagadha that he was never attacked by a ghost and tells her it was part of his plan to avoid giving the Mahal as dowry. He also reveals that it was not a ghost but him that scared Bujji. Bujji overhears the conversation and is angered. Believing that the Mantrik too was a fraud, in anger he breaks the bottle in which the Mantrik captured Bhoopati's soul. Now freed, Bhoopathi's soul enters Rishi's body and tries to kill the family. Narasimha Rayudu's soul enters Manoj's body and tries to stop Bhoopathi. Mantrik brings Amrutha Valli to stop Bhoopathi. Amrutha Valli lies to Bhoopathi that she got married and kills herself to stop him. In the end, Visalakshi marries Rishi and Manoj gets married to Jagadha. Manoj also sees the ghost of Narsimha Rayudu sitting on a chair and smoking a cigar, indicating that he would forever protect the Mahal.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"7/23/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/65D58FF854ADCF8DB9C69B7F560202AB.jpg"},{"Id":"c79d7dc9","ImdbId":"tt2186933","OriginalTitle":"Luv Shuv Tey Chicken Khurana","Title":"Luv Shuv Tey Chicken Khurana","Description":"Omi Khurana’s London dream has just ended. On the run from a dangerous UK gangster who he owes money to, Omi returns to his native village in Punjab, pretending to be a well-heeled London lawyer. Much has changed since Omi ran away from home a decade back after stealing money from his doting grandfather, Daarji. The old man has since become senile and most importantly, forgotten the secret recipe of \"Chicken Khurana\" a dish that made the Khurana dhaba (restaurant) famous across Punjab. Omi’s childhood sweetheart, Harman is soon to be married to his cousin, Jeet, though neither seems too happy about it. Adding to the quirkiness of the Khurana family is a free loader uncle, Titu, who once did a stint at a mental asylum. Omi's grandfaher has a cousin sister who ran away from home at early age and is now a saint. His grand father dies on his last visit to his restaurant. Omi tries to restore their family restaurant with the help of Harman. While working on restaurant both of them reconcile and start to have feelings for each other. Meanwhile Omi discovers the secret ingredient from his grandfathers famous chicken recipe was a narcotic herbal medicine but keeps it a secret forever. While the family comes together, Jeet surprises everybody by revealing his love for a bengali war-widow Shama and has a daughter with her. Omi and Harman's marriage is fixed. In the end the whole family seems happy and celebrating when the gangster from whom Omi is hiding comes looking for him and is revealed to be Titu's long lost friend.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":1.25,"CensorRating":"U/A","ReleaseDate":"11/2/2012","Runtime":140,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A9239A75524760A6EEA992CAE641A067.jpg"},{"Id":"e20ee389","ImdbId":"tt2191721","OriginalTitle":"Jodi Breakers","Title":"Jodi Breakers","Description":"Sid (R. Madhavan), a bachelor works as a divorce managing officer. He meets Sonali (Bipasha Basu), who joins him in his business of splitting couples and they earn well in the process. Together, they are known as the Jodi (Couple) Breakers. Sometimes, they secretly make husband and wife fight with each other, that will result in their divorce. This happens with Marc (Milind Soman) and Maggie (Dipannita Sharma). But when Marc finds out the reason that got him and Maggie divorced, hell breaks loose.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":4,"Rating":1.5,"CensorRating":"U/A","ReleaseDate":"3/2/2012","Runtime":127,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BF0DD6812C39CE83C1B2B698E4CFA9C6.jpg"},{"Id":"eb1882d8","ImdbId":"tt2224254","OriginalTitle":"3 Bachelors","Title":"3 Bachelors","Description":"Three bachelors go to great lengths to get housing that is meant for married couples.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"6/29/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3A5EAF974E92FB462EDC99C6092B6F4D.jpg"},{"Id":"636db534","ImdbId":"tt2232524","OriginalTitle":"Mere Dost Picture Abhi Baki Hai","Title":"Mere Dost Picture Abhi Baki Hai","Description":"Picture Abhi Baki Hai is the journey of Amar Joshi (Sunil Shetty) who runs a video library in banaras and aspires to be a film maker. Despite facing objection from his father Amar Joshi decides to sell his video library and joins a film Institute in London.\r\n\r\nAfter completing his course he lands in the city of dreams \"Mumbai\" to make his film. Suraj (Rajpal Yadav) is a struggling actor doing bit roles in T.V. serials, who Is Amar's only connection in Bollywood.\r\n\r\nAmar Joshi starts his struggle to make his film by meeting different type of producers who have their own take on Amar's story. After many failed attempts He finally bumps into Monty Chadda (Rakesh Bedi) a P.R. Publicity man who sees good potential in Amar and decides to produce his film.\r\n\r\nAmar & Monty take help of star secretary Guptaji (Akhil Mishra) to convince Mohini (Udita Goswami) & her starry mother Mummyji (Neena Gupta) who agrees to do the film.\r\n\r\nAmar's film starts, But is stalled all of a sudden when Monty suddenly disappears. Amar is summoned by Sudama Bhosle (Deepak Shirke) a don who was financing his film. He wants Amar to complete his film and also wants him to cast his girlfriend \"Tina\" (Mummait Khan) Amar reluctantly agrees as he has no option. But as luck would have it Sudama Bhosle is shot dead and Amar's film is stalled once again. Monty Chaddha resurfaces again and decides to make Amar's Film into a magnum opus. so a veteran silver jubilee writer Mr. Baig (Om Puri) is brought on board. Once in, Mr. Baig takes over the reins of the film from Amar and changes it into a totally different film all together.\r\n\r\nWhat follows is a chain of events which gives the audience a never seen before insight into the modus operadi of how films are generally made in Bollywood. In a nutshell, Picture Abhi Baki Hai will take you on a wild journey inside the dreamy world of Bollywood where you will see the reality of the largest film industry of the world. It won't just make you laugh; it will make you appreciate the efforts of those who try to entertain you every minute.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":1.75,"CensorRating":"U/A","ReleaseDate":"7/20/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/70254A7329814886E1CC70CC7CCA27A8.jpg"},{"Id":"fd63e9bf","ImdbId":"tt2187972","OriginalTitle":"Shirin Farhad Ki Toh Nikal Padi","Title":"Shirin Farhad Ki Toh Nikal Padi","Description":"Farhad Pastakia (Boman Irani) has a dream job as a bra-and-panty salesman. Except that he is a 45-year-old Parsi bachelor still living with his overbearing mother and grandmother. But it’s not like he’s stopped trying. Desperate to get him married, Farhad’s mother drags him to see women and even to embarrassing Parsi matrimony services.\r\n\r\nIn the midst of all the daily humdrum, Farhad meets the woman of his dreams: Shirin Fugawala (Farah Khan), who drops by his store. Shirin, who works at the Parsi Trust, hits it off with Farhad from the start. Everything seems to be perfect and Farhad gets ready to introduce Shirin to his mother. But mummy becomes the villain in their story when she discovers that Shirin is the devious Parsi Trust Secretary who got the illegal water tank in their home demolished. The water tank being the 'aakhri nishaani' of Farhad’s late father doesn’t help matters.\r\n\r\nThe ups and downs in Shirin-Farhad’s relationship and how the two try to make it work is the rest of the journey.\r\n\r\nThe proposal scene in the movie where Shrin accidentally swallows a diamond ring was plagiarized from an episode of 'Two and a Half Men' where Chelsie swallows a diamond ring that Charlie Harper had put in her champagne glass.\r\n\r\nThe plot of the movie is similar to an old Hollywood classic \" Marty's\"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"8/29/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D51AD0FE2266CA3CDD6246CA30F7AA1C.jpg"},{"Id":"f3ddc022","ImdbId":"tt2317337","OriginalTitle":"Vicky Donor","Title":"Vicky Donor","Description":"Dr. Baldev Chaddha (Annu Kapoor) is a fertility expert who runs a clinic and a sperm bank in Daryaganj, Delhi that guarantees high-quality and specialised sperm for couples. Unfortunately, he has more failed cases to his credit than successes. A healthy and high-performing donor is needed.\r\n\r\nWhile searching for his 'Indian Alexander', Chaddha bumps into Vicky Arora (Ayushmann Khurrana). Vicky is the only son of his widowed mother Dolly (Dolly Ahluwalia), who runs a small parlour from their home in Lajpat Nagar. He lives with his mother and grandmother and provides no financial support to them. Dolly is always nagging at Vicky to go and work for his uncle so he can help with the family's finances. But Vicky wants a job in a multinational company, which will provide him with a better lifestyle. Vicky's neighbor Shweta (Puja Gupta) is infatuated with him, but Vicky doesn't reciprocate which causes friction between the two.\r\n\r\nA small brawl in the colony brings Chaddha and Vicky face to face; Chaddha concludes that Vicky could be the donor he has been looking for. From here on, Chaddha's days and nights are spent convincing Vicky to become a donor; he finally gives in. Although Vicky is hesitant at first, he accepts being a sperm donor after seeing the money he could make. He starts to spend money wildly and renovates his home and his mother's beauty parlor. He fulfills all his dreams with the money he is making. At first he openly discloses he is a sperm donor to his friends but, after repeatedly disgusting them, he starts to keep it a secret.\r\n\r\nVicky falls in love with Ashima Roy (Yami Gautam), a Bengali bank employee, whom he meets when he goes to open an account. At first Ashima is repelled by Vicky and his attitude, but slowly becomes attracted to him. After dating, they admit they are in love and want to get married. Ashima also discloses that she was briefly married to a Bengali, who left her immediately after their wedding because he loved someone else. When she asks Vicky about his status, he hides the fact he is a sperm donor feeling ashamed of it. Despite initial friction between Vicky's and Ashima's families due to conflicting cultures, they convince their families and get married.\r\n\r\nAfter their wedding Vicky stops donating sperm out of faithfulness to Ashima. It is discovered that Ashima is infertile and Vicky, with a heavy heart, takes better care of her. One day while looking at the doctor's reports, Ashima cannot find Vicky's reports and asks him where they are. He admits to not having taken the fertility tests, because of his past as a sperm donor. Ashima becomes extremely upset as her husband has multiple children while she is unable to bear any herself. She is also upset that he lied to her. Ashima goes back to Kolkata to her father's home.\r\n\r\nVicky is very upset as he loves Ashima a lot and cannot live without her. One night he gets a frantic call from his mother who claims that income tax agents have raided her beauty parlor. Vicky rushes to her aid. Once there he is arrested on suspicion of handling black money. While at the police station, Vicky is bailed out by Dr. Chaddha and he clear the air with the police about Vicky's money. He explains that he is a sperm donor and the money was from the parents who used Vicky's sperm. After being released by the police, Dr. Chaddha and Vicky have a chat. Vicky explains that Ashima has left because of his work as a sperm donor and that she is infertile. Dr. Chaddha tells him that he will fix his marriage.\r\n\r\nHe asks Vicky to bring Ashima to a guest house where he will host an event. Vicky is reluctant because he is not sure if Ashima will be willing to come with him. After Vicky has a chat with Dr. Chaddha he goes to his mother home. She is very upset with him and slaps him. She is angry with him about the sperm donation. While his grandmother is also clearly upset, she points out that Vicky brought happiness and joy to those parents and that's all that matters to her. She then encourages Vicky to go to Kolkata and bring back Ashima, which he does. Vicky then goes to Ashima's father's home and tries to apologize for his deception. Although she is reluctant, Ashima's father sets her straight and tells her that Vicky is a good person, and she should not leave him because she is envious of his being able to have children.\r\n\r\nShe agrees to go with Vicky to Dr. Chaddha's event. Dr. Chaddha called all the families who received Vicky's sperm to a 25th anniversary party for his clinic. She then sees how Vicky has brought happiness into the families' lives. Dr. Chaddha then takes Vicky and Ashima to an orphanage. He explains that while tracking down two children who Vicky fathered, he came across one child he fathered who lost her parents in a car accident and had to be put in an orphanage. He says that Vicky and Ashima should adopt her. They happily agree and reconcile with each other.\r\n\r\nThe movie ends with Dr. Chaddha calling Vicky telling him that a request for his sperm has come in, asking if he will donate. With Ashima's approval he agrees.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":16,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"4/20/2012","Runtime":126,"Budget":50000000,"Revenue":645000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/38B62E5E1C463EFCAA6B7C231BE9FB17.jpg"},{"Id":"49b34a5b","ImdbId":"tt2278422","OriginalTitle":"Kamaal Dhamaal Malamaal","Title":"Kamaal Dhamaal Malamaal","Description":"This movie is the sequel of Malamaal Weekly. The insinuating cry of every man, woman and child in this village when they see Johnny Belinda (Shreyas Talpade). Afraid of everything and everyone, Johnny is one terrified soul. Born into the household of Om Puri, a local farmer and being the only son, Johnny does what he's best at to help his ailing father. Nothing, other than buying lottery tickets every week. The only thing going in his life is his love for Maria (Madhurima) the daughter of the village's biggest gunda (gangster), Paresh Rawal, and sworn enemy of Om Puri. Paresh Rawal, armed with three herculean sons, goes to all ends to make sure his daughter and Johnny never marry, until one day, hope comes in the form a silent, strong but hungry man, Nana Patekar.\r\n\r\nOne sudden day, Johnny and his family find Nana in their well. They get him out and feed dinner. Next day, Nana and Johnny go to market, where the Paresh Rawal's sons were beating Johnny. Nana saves Johnny and beats the goons in return. The friend of Johnny asks him is Nana your lost brother, Sam? With the question, Johnny gets an idea that I can pose him as my brother, include in my family and have a bodyguard for myself. Johnny convinces Nana to be his brother Sam and tells him the story of his family history. Johnny introduces Nana to his family. The family, in long wait of their lost son, accepts Nana as their lost son, Sam. Nana becomes Sam. With the help of his brother Sam, Johnny starts influencing entire village. Sam also works hard in the farm and helps family earn good livelihood. He is well accepted in the family. With the arrival of Sam, good days come to the family. One day, a person tells Johnny's friend that he has seen Nana in a Kolkatta jail, convicted of rape and murder of a woman. Johnny tries to convinces his family that Nana is not Sam but a rapist and murderer. Om Puri, father of Johnny, says Sam has told him that Sam has already told him the story of his going to jail. Johnny asks Sam to tell one thing which he has not told Sam as family history. Sam asks for a mango tree which was there. This convinces Om Puri and family that Nana is actually Sam. They in turn throw away Johnny out of home. Johnny takes a job at church and starts living as the neighbor of his father's house. He keeps looking opportunity to kill Sam, but all in vain. On the eve of Christmas, Sam sets home into fire. Everyone thinks Johnny has done the same and blame him. Johnny, disappointed with himself, writes a suicide note sitting in his hut. At that time, he sees Sam and another man enter into burnt hut. He follows them and finds that Sam and the man have dug in the home. They take out the stolen golden cross of the village church. Johnny is seen by Sam and the other man. Sam tells johnny that he had stolen it long back and hidden under the mango tree and ran away. Later in mean time, he came out of jail, the tree was cut and home was built. So to get this, he had set the home in fire. In mean, time, the other man runs away with the cross. Johnny and Sam catch him in the field. The other man confesses that he was the one who had raped and murdered the lady and told police that Sam had done it so. Sam beats the man to death. Sam injures Johnny who was trying to take the cross for church, but Sam injures him and walk with the cross. But he falls in well. Johnny, feeling grateful to Sam's earlier help, rescues him. Sam was walking with cross but johnny reminds him of the love Sam received from family. Hearing this, Sam leaves the cross there only. Johnny brings the cross to Church, but people accuse him as thief. Johnny was unable to prove his innocence. Suddenly, Sam appears and puts the dead body of the other man as thief. The village accepts this. As decided, if Johnny gets the golden cross for Church, he gets married to Maria. Johnny tells Sam that, now he is permanent member of the family.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.05,"CensorRating":"U/A","ReleaseDate":"9/28/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D18738CA2A487AD337B79FAEFC5A5B0E.jpg"},{"Id":"bfd775e6","ImdbId":"tt2245544","OriginalTitle":"Carry on Jatta","Title":"Carry on Jatta","Description":"Jass (Gippy Grewal) fall's in love with Mahie (Mahie Gill) at a friends wedding, but she only wants to marry someone who doesn't have a family and is an orphan like herself because she doesn't want to deal with the nagging and interference of in laws post marriage. So to woo her Jass pretends he's an orphan and she falls in love with him, but when she tells her brother he forces them to marry right away or else he won't agree. So Jass marries Mahie without telling his father Advocate Dhillon (Jaswinder Bhalla), brother Goldy Dhillon (Binnu Dhillon) or his wife Diljit Dhillon (Anshu Sawhney). Now after marriage Jass tells Mahie to find them a place to stay and she finds a sublease room in Jass's own home and that's where the comedy of errors begins. Jass and his best friend Honey (Gurpreet Ghuggi) cook up several plans to confuse Jass's family so Jass can live with his wife Mahie in his own home without his family ever finding out. But in between all this Honey marries his girlfriend Preet (Khushboo Grewal) in secret because his dad Inspector Sikhander Tiwana (B.N Sharma) won't agree to his marriage but Honey tricks Preet's parents into believing that she's marrying Jass without Jass even knowing it. Hence a madcap comedy of errors ensues and ultimately the outcome is a comically charged climax of marital mix ups.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":3.95,"CensorRating":"U/A","ReleaseDate":"7/27/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B8A70DAFB15B62B30DAAF6663B362F63.jpg"},{"Id":"e20864b2","ImdbId":"tt1703958","OriginalTitle":"Ek Main Aur Ekk Tu","Title":"Ek Main Aur Ekk Tu","Description":"Rahul Kapoor (Imran Khan) has always been on the road to perfection, as per the wishes of his domineering father (Boman Irani) and socialite mother (Ratna Pathak Shah). After suddenly losing his job as an architect in Vegas, he hides the truth from his parents and looks for another job. Unable to cope with unemployment, he goes to a psychologist and runs into another patient, Riana Braganza (Kareena Kapoor). A series of events lead Riana to believe that he is sent by her ex-boyfriend to stalk her, and she ends up taking his file by mistake.\r\n\r\nRiana, who later realises her mistake, calls him and apologises for her behaviour. They meet up during Christmas Eve and Riana invites Rahul to have a few drinks with her. A few drinks turn into a night of intoxicated revelry as they end up marrying each other. Horrified, they decide to get it annulled as soon as possible. Meanwhile, Riana, who is also unemployed and has not paid her rent, loses her house and an initially hesitant Rahul lets her stay with him till her problem gets resolved. During these few days, they get to know each other better. Rahul is revealed to be interested in photography while Riana recounts her ambition to be a ballet dancer, which was destroyed after she broke her ankle in childhood. Their friendship develops as Riana gives Rahul a long break he always wanted. As they grow closer, Rahul develops feelings for Riana, who fails to reciprocate them.\r\n\r\nAs New Year's Eve approaches, Riana plans to visit her family in India and asks Rahul to accompany her. He disagrees initially, as his parents live in Mumbai, but later succumbs to her argument. Upon arrival, she introduces him to her family, making his feelings towards her grow. The next day, Riana takes him to visit her school. Amidst reflecting over her past relationships, he unsuccessfully tries to kiss her. Realising that she does not feel the way he does, he angrily leaves the school, only to almost run into a car revealed to be his mother's. He lies and tells his mother that he is in India for a research trip, and that Riana is a colleague. They have lunch with Rahul's parents, where he spins a web of intricate lies to avoid telling his father the truth. He leaves Riana's house and moves in with his parents, trying to tell them the truth, but once again is overpowered by his father.\r\n\r\nTwo days later, during a family dinner, Rahul angrily divulges the complete truth to his in-denial parents and their business partners (including Mr. Bulani), after realising the meaninglessness of his pretense he indulged in all these years. As he rushes back to Riana to apologise for his behaviour, Riana apologises she never intended to lead him on. After a night of reflection and deep conversation, they decide to maintain their friendship. The film ends with them returning to Las Vegas and finalising their annulment. Rahul gets a new job, while keeping time out for photography. He remains hopeful that one day he will convince Riana to go back to that chapel with him. Both remain good friends, with an ending note from Rahul claiming that he is finally happy with his life, as the credits roll.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":10,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"2/10/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B3357E041D36674CC9786F09CCCD9961.jpg"},{"Id":"53aa3a81","ImdbId":"tt2255934","OriginalTitle":"Aiyyaa","Title":"Aiyyaa","Description":"The story is about a Marathi girl Meenakshi (Rani Mukerji) falling in love with a Tamil artist Surya (Prithviraj Sukumaran). She is a librarian at a college. She has five members in her family(including herself): A wheelchair ridden grandmother (Jyoti Subhash) who is blind and has gold teeth, her father who smokes four cigarettes together, her mother (Nirmiti Sawant) who is obsessed with marriage, and her brother Nana (Amey Wagh) whose only love in life is dogs. To add to her miseries the government garbage bin is placed right in front of her home. To escape the craziness of her family, Meenakshi lives her life in dreams, and in her dreams the only thing she's doing is dancing and enacting her favourite actresses: Madhuri, Sridevi, Juhi etc. Then there is Maina or \"Gaga Bai\"(Anita Date), her colleague, an eccentric woman who dresses up in weird ensembles inspired by pop star Lady Gaga. Meenakshi's family is looking for a suitable groom but Meenakshi, who doesn't believe in arranged marriages, is waiting for her prince and wants her dream wedding. That's when Surya (Prithviraj) enters. Surya is an art student, and the moment Meenakshi looks at him she falls in love with his tanned skin and a mysterious fragrance emanating from him. By this time her family has found the 'right guy' Maadhav (Subodh Bhave) for her, and are rushing with her wedding. The rest of the film involves Madhav running around after Meenakshi, and Meenakshi following Surya.Nana gets engaged to Maina under bizarre circumstances when Meenakshi goes missing on her engagement date when she actually was following Surya and ends up in his incense sticks factory. Meenakshi learns that Surya's fragrance, that she got enthralled to, was actually because of his involvement in the factory. In the end, Meenakshi eventually succeeds in winning over Surya's heart and they get engaged in a traditional Maharashtrian ceremony.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"10/12/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2DED9AA7769C3E3A67D749B071FCE30A.jpg"},{"Id":"6be7abb4","ImdbId":"tt1949548","OriginalTitle":"Heroine","Title":"Heroine","Description":"The movie begins with Mahi Arora (Kareena Kapoor), a renowned heroine, being thrown out of a car at night. She hails a taxi to a police station with the intention of lodging a complaint. Before she can do so, her secretary Rashid Bhai (Govind Namdeo) takes her from the station. The movie then goes to flashback for a while, showing the circumstances and her relationship with a well-known actor Aryan (Arjun Rampal). Aryan is in the divorce proceedings with his wife, and dating Mahi. Mahi is completely in love with Aryan, and during one of their intimate moments, takes a video of them just for fun. Aryan is split between his current wife and son, his career, and over-jealous Mahi. When Mahi comes to know about an intimate scene Aryan is shooting for a movie, she barges on to the set and creates a ruckus, which upsets Aryan. Later Mahi is teased by Aryan's current wife in a party, and she insults her back. While driven back from the party with Aryan, Mahi raises the topic, which results in her being thrown out of the car. Mahi then goes into depression, putting her career in jeopardy. One of her friends suggests Mahi to stop playing the victim and to get back again with a bang. Heeding her advice, Mahi decides to rejuvenate her career. She employs a PRO, Pallavi (Divya Dutta) who reinvents Mahi's image and puts her back on the front page of every newspapers and magazines. She starts relationship with an upcoming cricketer, Angad Paul (Randeep Hooda). Their love affair begins to blossom and puts her back into the spotlight. Mahi uses Angad to get role in a big budget film. However, lead hero manipulates so that all the spotlight in the film goes to him and an item girl. Mahi is dissatisfied despite the film being a success, and in a desperate attempt to prove her acting skills she works in an art film for next nine months. In between Angad proposes to Mahi, but she feels that presently they should concentrate on their respective careers. This causes Mahi and Angad's relationship to end. Also the art film never completes, again Mahi goes into depression accompanied by heavy drinking and smoking. As no big film coming her way, she decides to work on a low budget film with newcomers. Also she agrees to make an appearance in the marriage of an industrialist daughter. As fate would have it, Mahi meets Aryan at the wedding. Aryan seems to be apologetic to Mahi for what he had done to her. They decide to rekindle their affair. Mahi is happy that Aryan is back in her life. Also, he wants her to do a big budget film with him. However, the director of the film is reluctant to cast Mahi in the role of the lead heroine as she has lost her appeal. Mahi becomes insane about losing the role to another heroine. She asks Pallavi to leak the sex tape of her and Aryan on the news so that she would get back on the spotlight for the release of her low budget film. As a result of this controversy, the film becomes an instant hit. However, when Rashid Bhai quits his job and a veteran actress in the industry, Shagufta Reza (Helen) whom Mahi admires dearly, dies, Mahi decides to quit acting as well. In the concluding scenes, Mahi is shown walking alone in a foreign country and on being asked if she is Mahi Arora, she replies \"no\". It is implied that Mahi moved on with her life.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"9/21/2012","Runtime":149,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/860647C33D83F5408B0F248A8E135A7C.jpg"},{"Id":"a23c4183","ImdbId":"tt2226666","OriginalTitle":"Jism 2","Title":"Jism 2","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"8/3/2012","Runtime":130,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2F4AE53B87F0D8BA23823513E53C525D.jpeg"},{"Id":"ba33e155","ImdbId":"tt2190196","OriginalTitle":"Celluloid Man","Title":"Celluloid Man","Description":"Celluloid Man is a 2012 documentary film directed by Shivendra Singh Dungarpur that explores the life and work of legendary Indian archivist P. K. Nair, founder of the National Film Archive of India and guardian of Indian cinema.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":3.85,"CensorRating":"U/A","ReleaseDate":"9/1/2012","Runtime":164,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/662F9B6C09E6134A1B89273487A0EE70.jpeg"},{"Id":"fe0912f7","ImdbId":"tt2184125","OriginalTitle":"Chaalis Chauraasi","Title":"Chaalis Chauraasi","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"1/13/2012","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F595BF5598B7B97528870247AF06191A.jpg"},{"Id":"d788db80","ImdbId":"tt2222550","OriginalTitle":"1920: Evil Returns","Title":"1920 Evil Returns","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"11/2/2012","Runtime":124,"Budget":0,"Revenue":3,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/03CD6F49D08D8953D1DDEECCBA975546.png"},{"Id":"4acea0ff","ImdbId":"tt2402131","OriginalTitle":"Kismet Love Paisa Dilli","Title":"Kismet Love Paisa Dilli","Description":"Kismet Love Paisa Dilli is a 2012 Bollywood comedy thriller film directed by Sanjay Khanduri. The film features Vivek Oberoi opposite Malika Sherawat in lead roles. It released on 5 October 2012, and received mixed response, with average box office collections.\r\n\r\nFilm is set in one winter night in Delhi where a middle class, Delhi university guy falls in love with a girl anchoring a fashion show. In process of wooing her someone plants a sting operation tape in his pocket. This sting operation has a minister talking of buying and selling MLAs and media heads from his Swiss bank accounts. Unknown to this he is chased by corrupt cops and good guys to get that tape back. Soon he gets to know of tape with him and its high relevance. How this university student who always talked against corruption like any layman, now gets bribed himself by the big offer thrown by Minster's man constitutes the edge of the seat climax of story.","TrailerLink":"https://www.youtube.com/watch?v=Q1n2QoAyJDM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Q1n2QoAyJDM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"10/5/2012","Runtime":129,"Budget":100000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/35D37594FCF2A04D4687042AB0F37838.jpg"},{"Id":"b0962029","ImdbId":"tt2130242","OriginalTitle":"Tere Naal Love Ho Gaya","Title":"Tere Naal Love Ho Gaya","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"2/24/2012","Runtime":130,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BD4057F52377B2D50A2F2256DB710C97.jpg"},{"Id":"32971b9f","ImdbId":"tt2283748","OriginalTitle":"OMG: Oh My God!","Title":"OMG Oh My God!","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":3,"Rating":2.83333,"CensorRating":"","ReleaseDate":"9/28/2012","Runtime":125,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4DCC8D4E473C35AF6FA7524D8A89FC5B.jpg"},{"Id":"a9341a17","ImdbId":"tt2166214","OriginalTitle":"Khiladi 786","Title":"Khiladi 786","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.25,"CensorRating":"","ReleaseDate":"12/7/2012","Runtime":141,"Budget":0,"Revenue":126,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1C2F328FEBFCD6CAC425E7F79179D102.jpg"},{"Id":"1ee98667","ImdbId":"tt1918886","OriginalTitle":"Joker","Title":"Joker","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"8/31/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/549A50DC8EBAF205B75EDF16C6749ACB.jpg"},{"Id":"55b1c4d2","ImdbId":"tt2077833","OriginalTitle":"Rowdy Rathore","Title":"Rowdy Rathore","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"6/1/2012","Runtime":143,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7858E66C1EACC7ED9A33E373FC2F5545.jpg"},{"Id":"7e308efb","ImdbId":"tt1980986","OriginalTitle":"Housefull 2","Title":"Housefull 2","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.25,"CensorRating":"","ReleaseDate":"4/5/2012","Runtime":145,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/CFF6121F750385604B40FFF3EB5D44BA.jpg"},{"Id":"a56c716b","ImdbId":"tt1172587","OriginalTitle":"Delhi Safari","Title":"Delhi Safari","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"12/7/2012","Runtime":96,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0B65EA4FF1E9EB3BCF459CE2306C82B7.jpg"},{"Id":"3c02abf4","ImdbId":"tt2190256","OriginalTitle":"Daal Mein kuch kaala hai","Title":"Daal Mein kuch kaala hai","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"6/28/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F131102B16CD1350B75D9574469089C2.jpg"},{"Id":"77aaa56d","ImdbId":"tt2321492","OriginalTitle":"Krishna Aur Kans","Title":"Krishna Aur Kans","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"8/3/2012","Runtime":117,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/020AA5625338BEC4A12368647F7E84EC.jpg"},{"Id":"38e39daf","ImdbId":"tt1127220","OriginalTitle":"Mr Bhatti on Chutti","Title":"Mr Bhatti on Chutti","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"5/18/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6A7FB2101C341165B98B1F80C4DF544F.jpg"},{"Id":"a5ff267c","ImdbId":"tt2191641","OriginalTitle":"Char Din Ki Chandni","Title":"Char Din Ki Chandni","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"3/9/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F31A3C5F5A9B013D8DE8EE3DDEF285A8.jpg"},{"Id":"fcfde28e","ImdbId":"tt2027138","OriginalTitle":"Kyaa Super Kool Hain Hum","Title":"Kyaa Super Kool Hain Hum","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.25,"CensorRating":"","ReleaseDate":"6/5/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A2AE2926387D9627D609BD296CB85E43.jpg"},{"Id":"4f3807e9","ImdbId":"tt2354407","OriginalTitle":"Teri Meri Kahaani","Title":"Teri Meri Kahaani","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"6/21/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/980321DD33C1FFB2338B1DD4C7DA9E79.jpg"},{"Id":"e4e4c151","ImdbId":"tt2292625","OriginalTitle":"Chakravyuh","Title":"Chakravyuh","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/24/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/56B9C0755985E5E70E78EE0D04900717.jpg"},{"Id":"531c1565","ImdbId":"tt2256514","OriginalTitle":"Rush","Title":"Rush","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/26/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/EA207CC6C35A8B7D969B4A92DBD627BD.jpg"},{"Id":"b6301c56","ImdbId":"tt2140315","OriginalTitle":"Raaz 3","Title":"Raaz 3","Description":"The story revolves around Shanaya (Bipasha Basu), an actress at the height of her success. She gets offered the best roles and wins all the awards she is nominated for. In addition, she also has a passionate affair with a handsome director named Aditya (Emraan Hashmi). This all ends when a younger actress, Sanjana (Esha Gupta) makes her film debut. In place of Shanaya, Sanjana comes into spotlight and begins to snatch away her awards. Suddenly, Shanaya seems forgotten and everybody only wants to work with Sanjana. Soon enough, Shanaya sees her career fading away and her envy slowly becomes craziness. She begins to turn to black magic and makes it her goal in life to destroy Sanjana's career and make her the pain of loss.\r\n\r\nShe seeks help of her uncle sonu (Sunil Dhariwal), a tantrik who helps her to practice black magic and calls upon an evil entity, Tara Dutt (Manish Chowdhary). She asks him to make Sanjana's life a living hell. Tara agrees to help haunt and torture Sanjana until she becomes suicidal. He asks Shanaya to give her a black poison through a person she trusts. Shanaya seduces Aditya to do it for her and whenever he feels guilty, she makes him accept again. Aditya, whose sympathy for Sanjana has turned into love, leaves Shanaya and refuses to listen her any more. Now Shanaya must work on her own to defeat the power of love.\r\n\r\nSomehow, to try to end Aditya and Sanjana's love triangle, Shanaya hatches a plan by befriending Sanjana in order to poison her which Aditya gets suspicious about. At a movie premiere, Shanaya reveals that she actually hid the poison in the chocolate basket she gave to Sanjana earlier. In the bathroom, Sanjana is attacked by a swarm of moths which she takes of her dress and run nude in public, Aditya takes her to the Hospital and finds out that Shanaya was behind this. Shanaya takes control of other mens bodies but they get brutally beaten up by Aditya. Aditya protects Sanjana from the defeated Shanaya who vows that she will remain a star and commits suicide by pouring acid on her head causing her skin to melt to death.","TrailerLink":"https://www.youtube.com/watch?v=f4L4iF6nuXE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/f4L4iF6nuXE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":8,"Rating":1.95,"CensorRating":"U/A","ReleaseDate":"9/7/2012","Runtime":139,"Budget":25000000,"Revenue":97000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/26A47653742EC90413AEB92CF46A19A0.jpg"},{"Id":"9cb67e83","ImdbId":"tt2072227","OriginalTitle":"Shanghai","Title":"Shanghai","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":3,"Rating":2.5,"CensorRating":"","ReleaseDate":"6/8/2012","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F2749F7DBF7B91E3E8EBB096094369EB.jpg"},{"Id":"f7a78916","ImdbId":"tt2319889","OriginalTitle":"Jannat 2","Title":"Jannat 2","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.5,"CensorRating":"","ReleaseDate":"5/4/2012","Runtime":150,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6501A305166A6506704EFE2D075BF97A.jpg"},{"Id":"4618600e","ImdbId":"tt1784589","OriginalTitle":"Players","Title":"Players","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"1/6/2012","Runtime":163,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C719244E56E0E8B352542EADB447C83F.jpg"},{"Id":"50c68515","ImdbId":"tt1849718","OriginalTitle":"Agneepath","Title":"Agneepath","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.25,"CensorRating":"","ReleaseDate":"1/24/2012","Runtime":174,"Budget":11097000,"Revenue":49028000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E0954C318B772C9732F4D4141EA7C69C.png"},{"Id":"14d22356","ImdbId":"tt1954470","OriginalTitle":"Gangs of Wasseypur","Title":"Gangs Of Wasseypur","Description":"A clash between Sultan (a Qureishi dacoit chief) and Shahid Khan (a Pathan who impersonates him) leads to the expulsion of Khan from Wasseypur, and ignites a deadly blood feud spanning three generations.","TrailerLink":"https://www.youtube.com/watch?v=j-AkWDkXcMY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/j-AkWDkXcMY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":17,"Rating":4.15,"CensorRating":"U/A","ReleaseDate":"6/22/2012","Runtime":320,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4E3684A820B7496360C8EEE167FD9D1F.jpg"},{"Id":"485d817f","ImdbId":"","OriginalTitle":"Gangs of Wasseypur II","Title":"Gangs Of Wasseypur II","Description":"Danish, Sardar Khan's older son, vows to avenge his father's murder, but Sultan kills him. Faizal, the good-for-nothing younger son, takes the charge of the family and exacts the revenge.","TrailerLink":"https://www.youtube.com/watch?v=S3PZbL8JGYQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/S3PZbL8JGYQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":17,"Rating":4.15,"CensorRating":"U/A","ReleaseDate":"8/8/2012","Runtime":159,"Budget":92000000,"Revenue":239600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AB312050CC89097FEFD90EB144B6C503.jpg"},{"Id":"dfcd4fa5","ImdbId":"tt1785333","OriginalTitle":"Chittagong","Title":"Chittagong","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/11/2012","Runtime":105,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A304EC1BB465B052B25D6F0A491021D4.jpg"},{"Id":"d65aa66d","ImdbId":"tt2308773","OriginalTitle":"Ishaqzaade","Title":"Ishaqzaade","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"5/11/2012","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/27BAF68F9452A8D96922CCEF7EF38212.jpg"},{"Id":"a24b1e53","ImdbId":"tt2168910","OriginalTitle":"Cocktail","Title":"Cocktail","Description":"Meera (Diana Penty) is a shy and simple traditional girl who leaves her family in India to live in London with her new husband Kunal (Randeep Hooda). While at the London airport, she meets the shameless flirt Gautam \"gutlu\" (Saif Ali Khan), who hits on her and asks her out. Meera politely tells him that she is married and then leaves. Meera searches for her husband and finally finds him, but he is angry to see her and explains that he only married Meera for her money, telling her to stay away from him. This leaves Meera heartbroken and stranded in London with no place to stay.\r\n\r\nWhile in the bathroom at a department store, Meera meets party girl Veronica (Deepika Padukone) who sees Meera weeping and decides to help her. Veronica takes Meera to her apartment and explains that her estranged father sends her a large amount through cheque every month, which helps Veronica enjoy the life of a rich socialite. One night, Veronica takes Meera to a nightclub, where they run into Gautam. At the club, Gautam and Veronica dance intimately and make out. The next morning, after an interview, Meera comes home to find Gautam on the couch. She learns that Gautam and Veronica slept together the previous night.\r\n\r\nSoon, Gautam moves in with Veronica and Meera, continuing his \"no strings attached\" relationship with Veronica. Although Meera initially dislikes him, she eventually accepts him, and the three become best friends. Things get complicated when Gautam's mother (Dimple Kapadia) shows up, wanting to know if Gautam has found the girl he wants to marry. He lies to his mother and says that he is in a relationship with Meera because she is the \"ideal Indian girl\" who would meet his mother's approval. During this charade, Gautam and Meera end up falling in love. However, Meera is hesitant to admit it, because she does not want to hurt Veronica, who has fallen in love with Gautam and is trying to win the approval of his mother by becoming a proper Indian girl. Gautam sits the two girls down and explains to Veronica that even though she loves him, he is in love with Meera. Meera apologises to Veronica, but Veronica assures her that it is okay and insists that they all go to the club to celebrate.\r\n\r\nHowever, at the club, a drunken Veronica breaks down, telling Gautam that she will do whatever he wants, and she tells Meera that no one has ever used her the way Meera did. The next morning, the three part ways. One night, Veronica is injured after being hit by a car. Gautam rushes her to hospital. Meera comes there with Kunal to make it look like she has gotten over Gautam.\r\n\r\nGautam moves back in with Veronica to care for her. Veronica realises that Gautam is no longer the flirtatious, fun-loving man with whom she fell in love and that he is that man only when he is with Meera. She sacrifices her love for Gautam realising she is not perfect for him, and she helps him locate Meera. They seek out Kunal, who tells them that Meera left him because she loved Gautam too much and that she has gone back to India. Gautam and Veronica travel to Delhi. Gautam proposes to Meera, and she accepts. Veronica and Meera become best friends again.","TrailerLink":"https://www.youtube.com/watch?v=9FfBzyiU0ZU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/9FfBzyiU0ZU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"7/12/2012","Runtime":146,"Budget":350000000,"Revenue":770000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/72D92EFC736EABA5535145078EADA789.jpg"},{"Id":"acd26934","ImdbId":"tt1395025","OriginalTitle":"Agent Vinod","Title":"Agent Vinod","Description":"After his colleague is murdered, Agent Vinod (Saif Ali Khan) embarks on a globe-trotting mission to investigate a series of events that may be connected.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":10,"Rating":2.55,"CensorRating":"","ReleaseDate":"3/23/2012","Runtime":157,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2E85ED8DBF6F785D99A12D41210E614D.jpg"},{"Id":"c8c5c0b3","ImdbId":"tt1620933","OriginalTitle":"Paan Singh Tomar","Title":"Paan Singh Tomar","Description":"The story of Paan Singh Tomar, an Indian athlete and seven-time national steeplechase champion who becomes one of the most feared dacoits in Chambal Valley after his retirement.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":17,"Rating":4.15,"CensorRating":"U/A","ReleaseDate":"3/2/2012","Runtime":135,"Budget":45000000,"Revenue":384000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8E1E071D4397391B9F5BBA2AC77B3932.jpg"},{"Id":"e8efb956","ImdbId":"tt1706317","OriginalTitle":"Tezz","Title":"Tezz","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"4/26/2012","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BC6F105C8CD7AEFCD4CA342EFEA71CFB.jpg"},{"Id":"e8ea416d","ImdbId":"tt2082197","OriginalTitle":"Barfi!","Title":"Barfi!","Description":"A charming prankster's (Ranbir Kapoor) bittersweet relationship with two women (Priyanka Chopra, Ileana D'Cruz) turns his life upside-down.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":10,"Rating":4.1,"CensorRating":"","ReleaseDate":"9/14/2012","Runtime":151,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2A175864C0DAA681F7978F4A1E9C7677.jpg"},{"Id":"53487de6","ImdbId":"tt1787988","OriginalTitle":"Talaash","Title":"Talaash","Description":"Inspector Surjan Singh Shekhawat (Aamir Khan) investigates a popular film star's death. Before he can solve the complicated case, he has to face his suppressed grief and deal with Rosie -- a sex worker and murderer.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":10,"Rating":3.65,"CensorRating":"","ReleaseDate":"11/30/2012","Runtime":131,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D50C66F4103F1FAD1AB3D8C3E27BA484.jpg"},{"Id":"d6dd08a0","ImdbId":"tt2178508","OriginalTitle":"Son of Sardaar","Title":"Son Of Sardaar","Description":"The story revolves around two families, whose patriarch killed each other many years ago. Their respective sons, Jaswinder Randhawa and Balwinder Singh, are sworn enemies. Jaswinder has been in hiding in London, whereas Balwinder is waiting for his return in Punjab so he can avenge the death of his father.\r\n\r\nIn the present day, Jassi Randhawa (Ajay Devgan) is an unemployed good-for-nothing man who receives a letter from the Punjab government about buying his property in Punjab. To sell the property, Jassi leaves for Punjab. On the train, he meets and falls in love with Sukhmeet (Sonakshi Sinha). In Punjab, Jassi accidentally meets Billu (Sanjay Dutt) and, seeing he is new to the area, Billu invites Jassi to his home, where he treats Jassi like a god. There, Jassi realises that Billu is Sukhmeet's brother. Soon enough, it is revealed that Billu is Balwinder Singh and Jassi is short for Jaswinder. However, Billu's family has to follow one Punjabi rule: A guest in the house should never be harmed. Now, Billu must wait for Jassi to leave the house to kill him. Jassi learns about it and comes up with a hilarious plan to foil Billu's shenanigans.","TrailerLink":"https://www.youtube.com/watch?v=LOlcpr7qEv4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LOlcpr7qEv4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":8,"Rating":1.95,"CensorRating":"U/A","ReleaseDate":"11/13/2012","Runtime":141,"Budget":300000000,"Revenue":1500000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A379714CD28515AA4181F2DFD45836C1.png"},{"Id":"50601897","ImdbId":"tt2112131","OriginalTitle":"Dabangg 2","Title":"Dabangg 2","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.75,"CensorRating":"","ReleaseDate":"12/21/2012","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D463F21340D6A46CEB12098A50250E98.jpg"},{"Id":"0f3addf8","ImdbId":"tt2016894","OriginalTitle":"Ek Tha Tiger","Title":"Ek Tha Tiger","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"8/15/2012","Runtime":132,"Budget":12000000,"Revenue":51000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0F8B90B33668CAFB65641CF98056BD52.jpg"},{"Id":"ccd80253","ImdbId":"tt2172071","OriginalTitle":"Student of the Year","Title":"Student Of The Year","Description":"Abhi (Sidharth Malhotra) and Rohan's (Varun Dhawan) friendship is shaken when Abhi falls for their mutual friend, Shanaya (Alia Bhatt).","TrailerLink":"https://www.youtube.com/watch?v=fivOhPjX9YM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/fivOhPjX9YM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"10/19/2012","Runtime":146,"Budget":590000000,"Revenue":955600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/47706185BDD1D66E9D7CFCE6DB96F9EF.jpg"},{"Id":"b15f07fa","ImdbId":"tt2176013","OriginalTitle":"Jab Tak Hai Jaan","Title":"Jab Tak Hai Jaan","Description":"An emotionally damaged man tries to forget the past so he can find true love.","TrailerLink":"https://www.youtube.com/watch?v=v0UXgoJ9Shg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/v0UXgoJ9Shg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.45,"CensorRating":"U/A","ReleaseDate":"11/13/2012","Runtime":176,"Budget":0,"Revenue":2110000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/93E813DDA46D9112A6C896C8FAFD51D0.jpg"},{"Id":"89fec74c","ImdbId":"tt2186731","OriginalTitle":"Department","Title":"Department","Description":"A police inspector (Sanjay Dutt) recruits a suspended cop (Rana Daggubati) for a specialized task force to battle organized crime.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":1.6,"CensorRating":"U/A","ReleaseDate":"5/17/2012","Runtime":141,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/DCF585DA4B3926CF01B159043440EAE5.jpeg"},{"Id":"9b0d979f","ImdbId":"tt1728986","OriginalTitle":"Bol Bachchan","Title":"Bol Bachchan","Description":"A series of cover-ups and comic situations occur when a man (Abhishek Bachchan) lies about his true identity and must act as two separate people.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"7/6/2012","Runtime":155,"Budget":12,"Revenue":17,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/25088602959378B211234384554F1DB6.jpeg"}]