[{"Id":"8c2f2c70","ImdbId":"tt3681414","OriginalTitle":"Purani Jeans","Title":"Purani Jeans","Description":"This film starts by Sid (as an adult) losing his mother. He then collects his lost bag at a airport where a girl from a publication house tells him that she read his diary and he is quite a writer which revives some old memories for him. He then goes to INDIA to sell his mother's cottage in Kasauli. Sid finds himself looking back at a past that haunted him for years.\r\n\r\nThen the story flashbacks and begins as all the 4 cowboys (self proclaimed) execute the plans to welcome their hero Sam (Aditya Seal). They then go to the station to welcome him, where Sid (Tanuj Virwani) run into Nayantara (Izabelle Leite). Then feelng sorry for themselves they begin to make their way home when the are struck by a black car. After chasing the car it is revealed that it is Sam. He apologises to Zizo and promises to fix his father's car.\r\n\r\nAfter that they begin their fun by partying, throwing eggs at everyone's house. It is also shown that Sam's relationship with Sid's mom is very strong. Sam's father left when he was six and in shock of it, his mother became an alcoholic and remarried.\r\n\r\nAfter a few days Sid runs into Nayantara in a music store, he begins to fall for her. Sam also meets Nayantara at a club with her sister and has also fallen for her. Also bobby is shown dancing with her sister.\r\n\r\nThe flashbacks eventually lead to revealing that Sam committed suicide for which Sid thinks of himself as the reason. As the story unfolds, it is shown that Sam's death was due to his troubled past and his relationship with his mother, not because of his best friend Sid. Upon finding this out, Sid and Nayantara reunite.\r\n\r\nThe story ends with a reunion between the remaining cowboys as they remember the past and the cherished moments they spent with each other and with their friend Sam, because if Sam were alive, that is exactly what he would've done... some friendships live on to last forever.","TrailerLink":"https://www.youtube.com/watch?v=Ht0Nj0oxsFo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Ht0Nj0oxsFo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"5/2/2014","Runtime":156,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/52415468F7C266DB88ECF9EEB903813B.jpg"},{"Id":"ff5e807c","ImdbId":"tt0243356","OriginalTitle":"Kaun Kitne Paani Mein","Title":"Kaun Kitne Paani Mein","Description":"Kaun Kitne Paani Mein is a story about two villages, Upri and Bairi. Upri is a village nestled in the hills and Bairi is at the base of the Hill Range although close to each other in proximity, are poles apart in every other measure as of water access and economic development. Upri is a village which had great economic and social status in the past and Bairi was then economically weaker. Upri was economically and class wise powerful in the past due to the land they had and the water fall from the hills as well as the large lake that was naturally created at the edge of Upri. The people of Upri were like royalty and they had used the people of Bairi as their employees. This had made the people of Bairi skilled in their work and also become good farmers. The people of Upri who assumed these good times would remain never planned for a rainy day and lived a rich life splurging on all the resources. But in 1992, as a result of a love quarrel between a young girl from Upri and a young man from Bairi, the villagers of Upri excommunicated the inhabitants of Bairi. The people of Bairi were devastated since they got employment, food and money from working in Upri. But the village survived. The thing that made them survive was the real knowledge they had in terms of farming, harvesting and building wells while they were working for the rich people from Upri. Few years later an immense drought hit the area where Upri and Bairi are located. Then the equation of power between the two villages completely changed because of WATER. Upri, in its heyday, had never truly worried about water as they had ample workforce from Bairi to get water from far. They had splurged the water they had and also eroded the water table by digging a lot of wells. Bairi, on the other hand, had lived frugally and used water sparingly having realized that it was a critical resource. They had hence planned for water storage, rain harvesting and water table replenishment. After the drought, Bairi had the ability to stock enough water for its needs and Upri, on the other hand, was completely dependent on the Government for Water. This shortage of water had affected Upri in all aspects from agriculture to living. Upri had no toilets and the lands were all barren. Bairi, on the other hand, had access to safe water, good farming capabilities, and also had toilets in each home. The head of the Upri village had a son Rajesh (Raj) Singh in his mid-20's who was coming back to the village after his higher education in the nearby city. The people of Upri had pinned all their hopes on Raj and wanted him to sort out the mess of water for them. The head of the Bairi village has one daughter, Paro.","TrailerLink":"https://www.youtube.com/watch?v=MR6_F6BsQwc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/MR6_F6BsQwc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.25,"CensorRating":"U/A","ReleaseDate":"8/28/2014","Runtime":0,"Budget":260000000,"Revenue":320000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4BA430C7A87C9E86EC14ED16E1D5904C.jpg"},{"Id":"2272d8a9","ImdbId":"tt3469244","OriginalTitle":"Phantom","Title":"Phantom","Description":"Phantom, an action thriller film begins with a car chase in Chicago, which ends with a man plunging into the icy waters of a river. Daniyal Khan (Saif Ali Khan) is convicted for murder and jailed. A flashback of 6 months ago takes us to the office of the Indian R.A.W. chief Roy (Sabyasachi Chakrabarty), where he and his trusted men (Rajesh Tailang, Mohammed Zeeshan Ayyub) plan a daring covert operation. Daniyal, now a dead-end ex-soldier with a completely deadened sense of life and death is pulled out of oblivion and pressed into service by the spy agency to wreak vengeance on the men who planned the 26/11 Mumbai terror attacks. \r\n\r\nComing back to the present, upon Daaniyal's arrest, he lands in the same jail as David Headley (J.Brandon Hill). Here he contacts Nawaz, in order to acquire 100 dollars so he can buy batteries, which hold a certain poison that kills you almost immediately upon hitting the tongue, which is also an undetectable form of murder, which will come out as a heart attack. After killing David Headley, the man who supposedly died upon falling in the icy river is found alive and Daniyal, who is using the alias of Jude Rosario in jail, is given bail and the police find it slightly suspicious, as if he entered jail with the intention of killing David and coming out. \r\n\r\nThen, he and Nawaz make a plan of going to Pakistan, where they take down the last 2 perpetrators, Sahabuddin Umvi and Haaris Saeed (Shahnawaaz Pradhan). In Pakistan, they make plans of killing Haaris Saeed with the help of local restaurant owner Khalid (Midat Sahab) by an explosive planted in the mic during his speech. Its here the famous number Afghan Jalebi is shot. Though, when this plan fails, Daniyal pursues him in the car and shoots him in the head, causing an explosion. Now, with the Pakistani army and I.S.I pursuing them, they try and escape. Yet, there accomplices get shot. \r\n\r\nThey both hide in the water but the Pakistani Military suspect that they are hiding in the water and shoot at it. Daniyal gets shot while shielding Nawaz from their bullets and eventually succumbs to his injuries in Pakistani waters, leaving a heartbroken Nawaz to be rescued by the Indian Navy. She is dropped by the Indian Navy to the Taj and she has 2 cups of tea, one for herself and one for Daniyal, fulfilling a promise made to him.","TrailerLink":"https://www.youtube.com/watch?v=Su0gJWOd00M","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Su0gJWOd00M\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"8/28/2014","Runtime":135,"Budget":500000000,"Revenue":632400000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2C803C118BE04DE03AF9C3C4D2D67754.jpg"},{"Id":"0958706d","ImdbId":"tt2216852","OriginalTitle":"Main Aur Mr. Riight","Title":"Main Aur Mr Riight","Description":"A light hearted take on love, relationships and singlehood.","TrailerLink":"https://www.youtube.com/watch?v=eIIer6weC3s","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/eIIer6weC3s\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":13,"Rating":3.1,"CensorRating":"U/A","ReleaseDate":"12/12/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/01AD706B0A54694E1F5FAB5D521F10F0.jpg"},{"Id":"98c7d9e2","ImdbId":"0","OriginalTitle":"Life Mein Twist Hai","Title":"Life Mein Twist Hai","Description":"Life Mein Twist Hai is 2014 Hindi language Indian directed by Dinesh Soni. The film stars Sahil Akhtar, Michelle Shah and Arshi Suryavanshi and released on 12 December 2014.","TrailerLink":"https://www.youtube.com/watch?v=rvzLFCnLrng","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rvzLFCnLrng\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"12/12/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3CAB55CB3FCCC5EBD1EF45CA1A19D6E6.jpg"},{"Id":"51b5ca20","ImdbId":"tt2767712","OriginalTitle":"Badlapur Boys","Title":"Badlapur Boys","Description":"Badlapur Boys is a drama film directed by Shailesh Verma and produced by A. Muthu and Salim Tanwar.The film is about a team of Kabaddi players in a family romantic drama with sports as a backdrop. It is a remake of the Tamil hit film Vennila Kabadi Kuzhu.\r\n\r\nThe story centres on Vijay, a child whose village has been long deprived of water for irrigation. Vijay's father threatens the bureaucracy with self-immolation if the village's basic need for water is not fulfilled. To set an example, the father sets himself ablaze before the villagers and the media. As fate would have it, his sacrifice is forgotten and instead his family is affected. Vijay grows up with the dream that one day, he will come face to face with the bureaucracy with a simple request; that his village 'Badlapur' receives government's attention to solve their water crisis.","TrailerLink":"https://www.youtube.com/watch?v=n-jXkwMCD3M","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/n-jXkwMCD3M\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"12/12/2014","Runtime":123,"Budget":260000000,"Revenue":500400000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/829BF7715493CB16E1B9F8042C3DA70C.jpg"},{"Id":"9436932d","ImdbId":"tt2679480","OriginalTitle":"Sulemani Keeda","Title":"Sulemani Keeda","Description":"This is a Bromantic Comedy about two struggling writers who peddle their mediocre screenplay, \"Sulemani Keeda\" in Bollywood. Perenially hungry and horny, they lie, drink, hit on unsuspecting girls in bookshops and attend poetry readings where they read their vulgar verses. Things look bright when they meet a wannabe auteur, Gonzo Kapoor who wants to make a film inspired by Tarkovski. Gonzo gives them three days to come up with a great idea. When one of them falls in love with a bohemian photographer who is leaving India in three days, he is faced with a choice- whether to co-write a film he doesn't believe in or woo the girl he has fallen in love with.","TrailerLink":"https://www.youtube.com/watch?v=s-qfjTQb1Hk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/s-qfjTQb1Hk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":15,"Rating":3.6,"CensorRating":"U/A","ReleaseDate":"12/5/2014","Runtime":89,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/861F58B2257DE528FEA48AD546C65B67.jpg"},{"Id":"5d4e27f7","ImdbId":"tt4045666","OriginalTitle":"Mumbai Delhi Mumbai","Title":"Mumbai Delhi Mumbai","Description":"Mumbai Delhi Mumbai is a romance-comedy written and directed by Satish Rajwade for Viacom 18 Motion Pictures. The film, adapted from Rajwade's 2011 Mumbai-Pune-Mumbai, stars Shiv Pandit and Pia Bajpai. The story synopsis is as follows...\r\n\r\nPia (Pia Bajpai), a typical \"Mumbai\" girl, makes her first ever day trip to Delhi and agrees to meet a possible match for marriage on her mother’s insistence. She lands in Delhi determined to reject the guy after meeting him because after all he’s from \"Delhi\". However, as it turns out she loses her phone while fighting with an auto driver and meets Goli Kohli (Shiv Pandit), a witty \"Delhi\" boy who grudgingly agrees to help her. One thing leads to another and they end up spending the entire day together. They fight, they argue, they laugh and share a lifetime of emotions in one day. When they meet in the morning they are strangers with strong biases about Mumbai & Delhi, when they part in the evening, the biases have turned into affection for each other’s quirks and finally, love.","TrailerLink":"https://www.youtube.com/watch?v=rjEPjJuHlL8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rjEPjJuHlL8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":12,"Rating":3.0,"CensorRating":"U/A","ReleaseDate":"12/5/2014","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F33F050B8C0D36ADF634F487BB440AC5.jpg"},{"Id":"cb7c45fc","ImdbId":"tt0839742","OriginalTitle":"Bhopal: A Prayer for Rain","Title":"Bhopal A Prayer For Rain","Description":"In 1984, a few months before the disaster, Dilip (Rajpal Yadav), a rickshaw driver, loses his pay source as his rickshaw breaks down while transporting an employee to the Union Carbide pesticide plant in Bhopal. Dilip lives in the slums around the plant with his wife, a son and his sister. He gets a job in the plant as a labourer, and is happy since his daily wage is restored.\r\n\r\nThe plant witnesses a drop in its revenue due to lower sales of pesticides, and in order to reduce the loss the officials neglect safety and maintenance. Questioning the chemicals used in the plant, Motwani (Kal Penn), a tabloid reporter publishes reports in his makeshift printing press which are disregarded by most of the officials and workers. Roy (Joy Sengupta), the in-charge for the safety of the plant expresses his concerns. The officials however ignore his warnings, and a worker is killed when methyl isocyanate leaking from a pipeline drips off on his hand. The officials deem the worker's irresponsibility as the cause of the accident and the plant continues to function. Dilip is given a better-paying vacant job in the plant despite lacking the skill to operate machinery. A gas leak is prevented by Roy when water is mixed with methyl isocyanate, and in an attempt to stop people from panicking, the official in the plant sabotages the warning siren.\r\n\r\nWarren Anderson (Martin Sheen), the CEO of Union Carbide, visits the plant to inspect its functionality, where he is briefed about a plan to connect two additional tanks for storage of methyl isocyanate to increase the output of the plant, ignoring the deteriorated condition of the tanks. Motwani meanwhile meets Eva Gascon (Mischa Barton), a reporter in the Paris Match, and persuades her to get an interview of Anderson. She impersonates the identity of an Associated Press reporter, but fails as her true identity is exposed in between the interview. Motwani convinces Dilip of the danger posed by the chemicals.\r\n\r\nAs the date of the disaster nears, Dilip arranges a loan for the wedding of his sister. Roy later explains how the company is ignoring safety standards, and that how a future leak might become uncontrolled as the officials had turned off safety measures to reduce the maintenance costs. Roy gives his resignation to the company and advises Dilip not to talk about the plant's safety if he wishes to retain his job. Dilip makes a phone call to Motwani describing what Roy just said, and expresses his fear about the plant's safety, saying he will return to the rickshaw-pulling business as soon as his sister is married.\r\n\r\nIn order to overcome the increasing revenue loss, the officials shut down the plant, firing most of the workers, including Dilip. The plant officials then order the usage of the remaining methyl isocyanate as soon as possible. Meanwhile Dilip is busy with the wedding of his sister, and Roy has a final look of the control room. The safety measures fail and a runaway reaction follows. The faulty tanks cause the gas to start leaking, and an attempt to contain the leak fails. The gas escapes to the surroundings and is carried east by the wind. Motwani rushes to alert the people in the vicinity of the plant to vacate and head west, since the warning sirens were previously sabotaged. He meets Dilip, who ignores the warning and asks Motwani to leave the area without causing any hindrance to the wedding. Meanwhile the guests experience irritation in the eyes and discomfort in breathing. Dilip senses the danger and visits the plant, realising that the plant had been compromised. He rushes back to his residence where he finds his family and relatives succumbing to the toxic gas. He carries away his son, paying farewell to his wife's corpse and flees the slum.\r\n\r\nAs the gas shows its effects, a nearby hospital is filled with hundreds of patients reporting cyanide poisoning, and the lack of antidote results in most of the patients' death. Dilip, in the last of his energy, throws away his Union Carbide identity badge, rests his son on the ground and succumbs to the toxic gas. The story jumps to the present day, where a blind boy is holding Dilip's identity badge, and the film ends with Motwani narrating the words \"Whatever may be the cause of the disaster, Carbide never left Bhopal\".","TrailerLink":"https://www.youtube.com/watch?v=rO6xCAsv4s4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rO6xCAsv4s4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.7,"CensorRating":"U/A","ReleaseDate":"12/5/2014","Runtime":96,"Budget":40000000,"Revenue":400000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7AA416EA6C8F38811AAE1ECA300BB37A.jpg"},{"Id":"c35e276e","ImdbId":"tt4228746","OriginalTitle":"Zid","Title":"Zid","Description":"Benaras Mediaworks' Zid is an adaptation of the German film The Good Neighbour that tells the thrilling story of Ronnie, a crime reporter who works as a writer in a local newspaper in Goa, and his young neighbor Maya who falls obsessively in love with him. Returning from their first date one stormy night, the couple meets with an accident which results in the death of a teenage girl Nancy. Complete panic follows, as Ronnie and Maya don't know what to do next. Maya convinces Ronnie that he should report the death to the police. And that night they return home turning the accident into a hit and run case.\r\n\r\nFollowing Nancy's unsolved death, her sister Priya returns back to the city to uncover the truth. Incidentally Priya is Rohan's ex-girlfriend, and owing to her proximity to him, the duo (Rohan and Maya) are roped in by the police to help solve the case. In the interim Priya's affection for Rohan is rekindled, thus making Maya insecure about her relationship.","TrailerLink":"https://www.youtube.com/watch?v=CWGY8APbQgc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/CWGY8APbQgc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":9,"Rating":2.15,"CensorRating":"A","ReleaseDate":"11/28/2014","Runtime":126,"Budget":150000000,"Revenue":140000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A801E7E4AC0EDE558608F27B57978B7D.jpg"},{"Id":"0ba7b62c","ImdbId":"tt4190220","OriginalTitle":"Zed Plus","Title":"Zed Plus","Description":"A political satire involving a small town in Rajasthan, where the local government is on the verge of collapsing due to factors such as corruption.","TrailerLink":"https://www.youtube.com/watch?v=VmlrzLaptQs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/VmlrzLaptQs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":14,"Rating":3.3,"CensorRating":"U/A","ReleaseDate":"11/28/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8121EAFE2D0214F9ED7C219F037943C0.jpg"},{"Id":"171682a7","ImdbId":"tt2392447","OriginalTitle":"Ungli","Title":"Ungli","Description":"The movie starts off with 4 friends Kalim (Angad Bedi), Gautam (Neil Bhoopalam), Maya (Kangana Ranaut) and Abhay (Randeep Hooda) starting a gang called the \"Ungli\" gang which fights against corruption. Their job is to bug corrupt people and teach them moral lessons quite unconventionally. They target a corrupt minister and become the most wanted people in Mumbai. Their case is the responsibility of ACP Ashok Kale (Sanjay Dutt), whose pal Nikhil Abhyankar (Emraan Hashmi) shortly joins the gang. But soon, after he faces trouble, Kaale is compelled to seek help from the gang when Nikhil helps him expose the gang's greatest target, B.R. Dayal (Mahesh Manjrekar) and his son Anshuman. Kaale instigates a sting operation against the Mumbai police and is successful in preventing his transfer. Kaale thanks the \"Ungli\" gang and he assures them that the city won't need an \"Ungli\" gang as long as the administrations are running properly in accordance to public demands.","TrailerLink":"https://www.youtube.com/watch?v=Nl1UPQbIQ4s","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Nl1UPQbIQ4s\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"11/28/2014","Runtime":114,"Budget":150000000,"Revenue":282000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E33C995B4299B9036ED158F956FDC579.jpeg"},{"Id":"1c96c6c9","ImdbId":"0","OriginalTitle":"Hum Hai Teen Khurafaati","Title":"Hum Hai Teen Khurafaati","Description":"Hum Hai Teen Khurafaati is a 2014 Bollywood romantic-drama film directed by Sudish sharma and produced by Jaivindra Singh Bhati under the banner of Shape Entertainment. It features Heena Panchal, Mausam Sharma, Pranshu Kaushal, Shrey Chhabra and Nikkita Butola in the lead roles. Kashi−Richard scored the music for the film.","TrailerLink":"https://www.youtube.com/watch?v=LVXsn57T0-g","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LVXsn57T0-g\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"11/28/2014","Runtime":135,"Budget":25000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/52885EE699A0A41130C74F6CD0DFDB34.jpg"},{"Id":"3da8a076","ImdbId":"0","OriginalTitle":"Wah Taj","Title":"Wah Taj","Description":"Wah Taj is a 2014 Bollywood drama film directed by Ajit Sinha and produced by Pawan Sharma and Abhinav Verma under the banners of Pun Films Pvt Ltd and Spider Wave Films. It features actors Shreyas Talpade and Manjari Phadnis in the lead roles.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"11/21/2014","Runtime":163,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6D27F2B16CC72B4A9ECBE4081DAF04E2.jpg"},{"Id":"9a550875","ImdbId":"tt3309844","OriginalTitle":"Titoo MBA","Title":"Titoo MBA","Description":"Titoo (Takhat Singh Gill) is your average Chandigarh boy with big dreams of becoming a businessman. But as usual, destiny plays spoilsport and nothing works out for Titoo. Added to that his heavy debts force him to take up a completely weird and unexpected career. In the midst of this financial mess, Titoo is married off to Gulshan Kaur Grover from Jalandhar following an elaborate arranged marriage. He leads a double life for a while and tries his best to hide his embarrassing secret from his newlywed wife. But as fate would have it, she finds out all about Titoo’s alternate career and the poor fellow’s life flips upside down once again.","TrailerLink":"https://www.youtube.com/watch?v=IFnao37vm48","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/IFnao37vm48\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.3,"CensorRating":"U/A","ReleaseDate":"11/21/2014","Runtime":107,"Budget":20000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/CEA94F7AE4F215B51A6F5D0B62DB6141.jpg"},{"Id":"0c8f0531","ImdbId":"tt5162476","OriginalTitle":"6-5=2","Title":"6-5=2","Description":"6-5=2 Hindi is the remake of a Kannada film by the same name, produced and directed by Bharat Jain. Starring Niharica Raizada, Prashantt Guptha, Ashrut Jain, Gaurav Paswalla, Gaurav Kothari and Disha Kapoor in lead roles and cinematography by Sathya Hegde who is a prominent cinematographer in Kannada film industry and has done movies like Duniya, Jackie, Myna. The film tells the story of a group of youngsters whose mountain trek goes awfully wrong. This is one of the first Hindi horror films in the found footage genre. The story summary is as follows...\r\n\r\nStarring Niharica Raizada, Prashantt Guptha, Ashrut Jain, Gaurav Paswalla, Gaurav Kothari, Disha Kapoor and Darshan M and cinematography by Sathya Hegde who is a prominent cinematographer in Kannada film industry and has done movies like Duniya, Jackie, Myna. The film tells the story of a group of youngsters whose mountain trek goes awfully wrong. This is one of the first Hindi horror films in the found footage genre","TrailerLink":"https://www.youtube.com/watch?v=3pP1ySt2dE0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/3pP1ySt2dE0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":0,"Rating":0.0,"CensorRating":"A","ReleaseDate":"11/14/2014","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/943BE25D0FC8FF5FA1F587F3B57546A5.Jpg"},{"Id":"8745136d","ImdbId":"tt1704680","OriginalTitle":"A Decent Arrangement","Title":"A Decent Arrangement","Description":"A Decent Arrangement is the story of Ashok Khosla, an Indian-American copywriter, who travels to India for an arranged marriage. After he encounters an American woman traveling through India and is set up with an Indian woman who unexpectedly captivates him, Ashok must navigate the complexity of cultural traditions and the leanings of his own heart. With subtle comedy and true-to-life drama, A Decent Arrangement shows us a side of India not commonly seen by western audiences and delivers an emotional story that resonates with those of us in search of our place in the world.","TrailerLink":"https://www.youtube.com/watch?v=imzFI1Ji_KY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/imzFI1Ji_KY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.75,"CensorRating":"U/A","ReleaseDate":"11/7/2014","Runtime":96,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/96161583B4E27D97BEC050C35B5A5FC1.jpg"},{"Id":"711c62ce","ImdbId":"tt3796006","OriginalTitle":"Roar: Tigers of the Sundarbans","Title":"Roar Tigers Of The Sundarbans","Description":"After his photojournalist brother gets killed by a white tigress in the jungles of the Sundarbans, Pandit and his team of commandos enter the prohibited core area of the forest to avenge his death.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Adventure","RatingCount":12,"Rating":2.85,"CensorRating":"U/A","ReleaseDate":"10/31/2014","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0FB07A85B973414E766C03974D98854D.jpg"},{"Id":"1fb4ae2f","ImdbId":"tt2375666","OriginalTitle":"Fireflies","Title":"Fireflies","Description":"Fireflies is a 2014 Bollywood drama film directed and produced by Sabal Singh Shekhawat. The film has an ensemble cast, which includes Rahul Khanna, Arjun Mathur, Shivani Ghai, Monica Dogra and Aadya Bedi. Rahul Khanna returns to Bollywood in Fireflies, the directorial debut venture of Sabal Singh Shekhawat. The story synopsis is as follows...\r\n\r\n \r\nThe film is a drama capturing the lives of two estranged brothers. One brother who leads a very successful life as a banker and the other who is a law school dropout and lives by the day. Fate brings them together when a tragedy that struck them 15 years ago re-manifests itself in a new avatar in their life.","TrailerLink":"https://www.youtube.com/watch?v=a-Aur6X0QJ8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/a-Aur6X0QJ8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"10/31/2014","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BE6ACD822763689E6B7540C52CBAF222.jpg"},{"Id":"b7b28422","ImdbId":"tt2691010","OriginalTitle":"Mumbai 125 KM 3D","Title":"Mumbai 125 KM 3D","Description":"On their way to a New Year's Eve party in Mumbai, a group of five friends encounter supernatural occurrences on a highway, 125 kilometres outside the city.","TrailerLink":"https://www.youtube.com/watch?v=YpRTYB1Utqs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/YpRTYB1Utqs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":7,"Rating":1.55,"CensorRating":"A","ReleaseDate":"10/17/2014","Runtime":100,"Budget":16500000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7DAA27A27A6EF877B0A710853DC049EB.jpg"},{"Id":"3e49dc9b","ImdbId":"tt4010306","OriginalTitle":"Jigariyaa","Title":"Jigariyaa","Description":"Shaamu falls in love with Raadha at first sight. As they grow close to each other, destiny takes another turn.","TrailerLink":"https://www.youtube.com/watch?v=OhO08fqA5-o","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/OhO08fqA5-o\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":14,"Rating":3.4,"CensorRating":"U/A","ReleaseDate":"10/10/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/80707EE4618FDF50DBFCE19F2176706D.jpg"},{"Id":"989012ce","ImdbId":"tt3169676","OriginalTitle":"Meinu Ek Ladki Chaahiye","Title":"Meinu Ek Ladki Chaahiye","Description":"The movie is a comical social satire portrays a 'Guru' and a 'Shishya' trying to change other's viewpoints and make them walk on the right path.","TrailerLink":"https://www.youtube.com/watch?v=LbrvFbg5UPQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LbrvFbg5UPQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":7,"Rating":1.7,"CensorRating":"U/A","ReleaseDate":"9/26/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8273314C8A3AC357EAEAB875ED2E4F20.jpg"},{"Id":"e91eb93d","ImdbId":"tt3877652","OriginalTitle":"Desi Kattey","Title":"Desi Kattey","Description":"A sharpshooting thug becomes a competitive shooter while his childhood friend remains in the life of crime.","TrailerLink":"https://www.youtube.com/watch?v=gfagRpOq7E4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/gfagRpOq7E4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.4,"CensorRating":"U/A","ReleaseDate":"9/12/2014","Runtime":137,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BAE360417056CB02B725FB0F6FFC2C48.jpg"},{"Id":"a2e735a3","ImdbId":"tt3021244","OriginalTitle":"Chaarfutiya Chhokare","Title":"Chaarfutiya Chhokare","Description":"Neha, comes to a small village in Bihar, India to construct a school building, for her NGO. She meets the principal to discuss the plans. While leaving from there Neha is shocked to know that the three boys who guided her to the school building are hardcore criminals and have been involved in several murders. Faces of all three in their adolescence, get etched in Neha's mind. With the news of the Rupees twenty million fund coming to the village spreads, politics of greed germinates. Paras, a contractor, lures the five school trust members and promises them to redo their houses if they help him construct the school. The trustee members agree but before they can proceed, Lakhan who has a strong foothold over the village hires the three boys to kill Paras. They kill Paras and the tender goes to Lakhan. Neha meets Janki, mother of one of the boys and is shocked to know about the circumstances that led the three boys into crimes.","TrailerLink":"https://www.youtube.com/watch?v=VU4QwHSH6lc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/VU4QwHSH6lc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"9/26/2014","Runtime":119,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7C10A746BC0BC8AE3AD197068FD1F1E6.jpg"},{"Id":"e318569f","ImdbId":"0","OriginalTitle":"3 A.M.","Title":"3 AM","Description":"The movie starts with few students visiting a Haunted place \"Rudra Mills\", where they are stopped by Sunny to go further into the premises. Sunny then narrates them his story. He tells them that his wife Sarah used to do programs on haunted places and while once she was unable to find her Bhagwad Gita, she unwillingly had to leave for her show without it. At around midnight Sunny woke up to see Sarah crying, on being asked what happened, Sarah says sorry and vanishes away. Shortly after, Sunny receives a call about the death of Sarah, who was found hanging on the walls of Rudra Mills.\r\n\r\nSome time later, Sunny proposes a show to his producer to record Paranormal activities in order to prove the existence of ghosts and spirits. The producer approves of the program while Sunny chooses Rudra Mills as the site for the first show. Raj and Cyrus accompany him. They both set cameras and find paranormal activity. At 3 a.m. Cyrus is possessed by the demonic spirit of Rudra Pratap Singh, he eventually kills Sunny and Raj. Story is conducted by Sunny telling the story to college students. Finally the fact that Sunny was also dead while fighting against the evil spirit of Rudra Pratap Singh is unveiled and his spirit was narrating the story to the students.\r\n\r\nHe eventually tells them to leave and reunites with his wife. The students are left in awe. Paranormal activities really do exist.","TrailerLink":"https://www.youtube.com/watch?v=jQjwCARLI9o","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/jQjwCARLI9o\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"9/26/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/21A435881E8D8CE686FD597785ACCADE.jpg"},{"Id":"cf1d59cf","ImdbId":"tt1826763","OriginalTitle":"Mumbhai Connection","Title":"Mumbhai Connection","Description":"Mumbhai Connection is a 2011 Hindi-language film shot entirely in Atlanta, USA. The film is set to release theatrically in August 2014 and is presented by Mowgli Productions Pvt Ltd. It is directed by Atlanta Nagendra, who also wrote the screenplay. It is produced by Abbas Moloo, Nawal Parwal, Sathya Narayanan and Rafiq Batcha. The music director is Praveen Duth Stephen. The story synopsis is as follows....\r\n\r\nAn Indian salesman, Faisal, joins an Atlanta IT company only to learn that it is run by the Mumbai mafia. Worse, he is forced to sell IT services to the Atlanta mafia. Even worse, they are not buying! Now Faisal's life is on the line and the only way he can get out alive is by going boldly where no salesman has gone before.","TrailerLink":"https://www.youtube.com/watch?v=E__fc8xl_sw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/E__fc8xl_sw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"8/22/2014","Runtime":90,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BE51C0AAA6BCF1F436E1A442B84C6145.jpg"},{"Id":"c718faf6","ImdbId":"tt3814100","OriginalTitle":"Mad About Dance","Title":"Mad About Dance","Description":"Essentially a dance film, it focuses on the youth, their dreams, anxieties, disappointments and hopes for their future. The film is based in the quaint and beautiful university town of Sheffield and brings to light the stories of Asian students who leave their home and country and go to study abroad...Their struggles, their heartbreaks, their trials and triumphs.","TrailerLink":"https://www.youtube.com/watch?v=JwpDKPg3E0E","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/JwpDKPg3E0E\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"8/22/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/71D6504AA3B56D3E64321821EAE039CF.jpg"},{"Id":"9a8f94fb","ImdbId":"tt3881136","OriginalTitle":"Life Is Beautiful","Title":"Life Is Beautiful","Description":"Raj works in Toronto and lives with his friend Prem who hates him for invading his tiny apartment. After Raj's application for Canadian residency is rejected, he plots the perfect plan to attain the Citizenship within a year, he marries a stranger, Pia. And as much as she hates it, she is forced to move in with him, as his wife. They live together, they fight, they laugh and soon a strange connection develops between them manifesting into a newfound friendship. The plan seems to be working fine, but the real complications begin on a stormy day when destiny brings Linda in front of Raj, a woman who comes into his life and changes it forever. A story of love that redefines the rules of relationships beyond social barriers and takes these four characters on a journey filled with love, loss and lots of laughter.","TrailerLink":"https://www.youtube.com/watch?v=p_elBj0xLyk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/p_elBj0xLyk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":10,"Rating":2.45,"CensorRating":"U/A","ReleaseDate":"8/22/2014","Runtime":116,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5EF53FE2F92EDF06FB2A35676BAA6530.jpg"},{"Id":"3a983226","ImdbId":"tt3794302","OriginalTitle":"Pizza","Title":"Pizza","Description":"A Pizza delivery boy's mundane life takes a horrifying turn when he is sent to make a delivery to the home of a family who have a dark secret. Will he be able to overcome the evil that lurks in the shadows and live to tell his tale?","TrailerLink":"https://www.youtube.com/watch?v=FGYXzAHjnUo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/FGYXzAHjnUo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":13,"Rating":3.05,"CensorRating":"A","ReleaseDate":"7/18/2014","Runtime":107,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/298591BA02041EB4D9665F33D2521846.jpg"},{"Id":"c09b6e4a","ImdbId":"tt3822600","OriginalTitle":"Amit Sahni Ki List","Title":"Amit Sahni Ki List","Description":"Amit sahani is an investment banker, single and ready to mingle. Mala is a free spirit who takes life as it comes. When Amit meets Mala sparks fly even though Mala is against all odds not the 'bucket list'-wall girl of Amit...or, \"The One\". They are soon engaged. Enter the enigmatic Devika Dev. Soon after the leggie Valkyrie descends in Amit's office front and his heart, she turns Amit Sahani and his list Topsy-turvy, because she is the woman of his dreams...The One. What happens to 'The One'? Does true love have a chance here?","TrailerLink":"https://www.youtube.com/watch?v=rk284yp6iIM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rk284yp6iIM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"7/18/2014","Runtime":110,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/29E1BABD6E7A7F98C621BCCD2A04DE56.jpg"},{"Id":"51c167d4","ImdbId":"tt2283894","OriginalTitle":"Riyasat","Title":"Riyasat","Description":"Riyasat is a Bollywood movie starring Rajesh Khanna, Gauri Kulkarni, Aryan Vaid, Aryeman Ramsay and Raza Murad. It is Rajesh Khanna's last film. The story synopsis is as follows....\r\n\r\nRiyasat is a story about the much loved Sahab played by the late Rajesh Khanna. Sahab has ruled for many years and has established his kingdom. People look up to him for everything. He has truly been the Godfather for the people of city. But then, few people enter the city with malicious intent which Sahab is aware of. Obviously, Sahab protects his kingdom from evil eyes and thus starts a war which changes Saheb's life forever. Will Sahab protect his kingdom? Will Sahab win over the evils and emerge as a winner?","TrailerLink":"https://www.youtube.com/watch?v=Iwa147RIsjg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Iwa147RIsjg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"War","RatingCount":13,"Rating":3.2,"CensorRating":"U/A","ReleaseDate":"7/18/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3A1563C96F6B189232DCF439A24F5981.jpg"},{"Id":"f83fec0c","ImdbId":"tt3854246","OriginalTitle":"Bazaar E Husn","Title":"Bazaar E Husn","Description":"Bazaar-e-Husn is a film based on Munshi Premchand's novel Bazaar E Husn. The story revolves around Suman, a courtesan. Brought up by an honest Police Inspector, Suman's life goes through all kinds of turmoil. From being harassed for dowry to becoming a victim of domestic abuse, Suman suffers a lot but at the end rises like a phoenix. How did a simpleton like Suman end up as a courtesan? How does she break free from all the difficulties in her life? Bazaar-e-Husn answers all these questions and more beautifully.","TrailerLink":"https://www.youtube.com/watch?v=UciEsyA04_I","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/UciEsyA04_I\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"7/18/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/85FB5F9022E8A808B8BE8D88810E5780.jpg"},{"Id":"447ce769","ImdbId":"tt3716142","OriginalTitle":"Lekar Hum Deewana Dil","Title":"Lekar Hum Deewana Dil","Description":"Lekar Hum Deewana Dil is a drama film that stars Armaan Jain and Deeksha Seth. Jointly produced by Saif Ali Khan, Dinesh Vijan and Sunil Lulla under the banner of Eros International and Illuminati Films, it is the debut directorial venture of Arif Ali, who was the assistant writer of the film Aahista Aahista, written by his brother Imtiaz Ali.The story synopsis is as follows...\r\n\r\nSet in uber cool south mumbai - we follow the lives of - Dino and Karishma - their lifestyle and attitude- both are young and restless and want to live life on their own terms. Frocklining around the city and painting town red with friends.\r\n\r\nWhen their exciting lives gets jolted with the pressure Karishma's family is piling on to getting her hitched, she and her rebellious best friend, Dino, realize that its them who are in fact 'made for each other'. Being the rulers of their destiny, they elope to forge a lifetime of love, fun and freedom. \r\n\r\nBut they are yet to learn that life isn't that simple. And sometimes who you love the most... can become the biggest problem. \r\n\r\nLHDD follows a year in the young and passionate lives of Dino and Karishma who go through friendship, disillusionment, shame, conflict and heartbreak until they realize true love.\r\n\r\nBut they question is - will they make the same mistake..again??!","TrailerLink":"https://www.youtube.com/watch?v=ZV2knGdIJNI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ZV2knGdIJNI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.4,"CensorRating":"U/A","ReleaseDate":"7/4/2014","Runtime":140,"Budget":16000000,"Revenue":25000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/455F898F11A30B9838918F2BFF2174F6.JPG"},{"Id":"15e04f4e","ImdbId":"tt2208248","OriginalTitle":"Machhli Jal Ki Rani Hai","Title":"Machhli Jal Ki Rani Hai","Description":"It's not just a matter of one spirit, it's a matter of multiple possessions in one body.","TrailerLink":"https://www.youtube.com/watch?v=2wJqXa2aC88","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/2wJqXa2aC88\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":9,"Rating":2.2,"CensorRating":"U/A","ReleaseDate":"6/13/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C5306679E7967E35E449C84AE1807227.jpg"},{"Id":"261e6a1c","ImdbId":"tt2417560","OriginalTitle":"Filmistaan","Title":"Filmistaan","Description":"In Mumbai, affable Bollywood buff and wanna-be-actor Sunny, who works as an assistant director, fantasizes on becoming a heart-throb star. However, at every audition he is summarily thrown out. Undeterred, he goes with an American crew to remote areas in Rajasthan to work on a documentary. One day an Islamic terrorist group kidnaps him for the American crew-member. Sunny finds himself on enemy border amidst guns and pathani-clad guards, who decide to keep him hostage until they locate their original target. The house In which he is confined belongs to a Pakistani, whose trade stems from pirated Hindi films, which he brings back every time he crosses the border. Soon, the two factions realize that they share a human and cultural bond. The film shows how cinema can be the universal panacea for co-existence.","TrailerLink":"https://www.youtube.com/watch?v=p-0LWnz8Ut0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/p-0LWnz8Ut0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":15,"Rating":3.65,"CensorRating":"U","ReleaseDate":"6/6/2014","Runtime":117,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/34D82A0F45532E6AABC1E53039D3B3C9.jpg"},{"Id":"85d65d56","ImdbId":"0","OriginalTitle":"M3 - Midsummer Midnight Mumbai","Title":"M3 - Midsummer Midnight Mumbai","Description":"M3 - Midsummer Midnight Mumbai is a 2014 musical-thriller film produced by Gudnet Production. The film stars Sara Khan alongside newcomers Pooja Thakur and Paras Chhabra who appear in supporting roles Milind Gunaji, Kiran Kumar, Pramod Moutho, Mushtaq Khan and Raju Kher.","TrailerLink":"https://www.youtube.com/watch?v=pN0pL8R_QXM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/pN0pL8R_QXM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/16/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A61CC3D30776FD9F6C163D8954520659.jpg"},{"Id":"04d17dff","ImdbId":"tt3369670","OriginalTitle":"Children of War","Title":"Children Of War","Description":"Children of War is a drama film directed by Mrityunjay Devrat. The story synopsis is as follows...\r\n\r\n'The Children of War' is a gripping and compelling reconstruction of the events that took place in Bangladesh, in 1971. Not a single soul remained without the tears of sorrow in their eyes for years to come since then. If not anything, it would be only fair to bring out the reality for the world to see.\r\n\r\nIt's a film like no other, uniting the notable actors of hindi film industry delivering some power packed performances that would surely touch many hearts. We are keenly looking forward to its theatrical release. Indians should definitely watch the tale of its neighboring nation.","TrailerLink":"https://www.youtube.com/watch?v=7jVgW_hxPyk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/7jVgW_hxPyk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"War","RatingCount":14,"Rating":3.35,"CensorRating":"A","ReleaseDate":"5/16/2014","Runtime":160,"Budget":1200000,"Revenue":2200000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/006E95F64B67C61E2B77038E3400594A.jpg"},{"Id":"88139b98","ImdbId":"tt3524410","OriginalTitle":"Yeh Hai Bakrapur","Title":"Yeh Hai Bakrapur","Description":"Yeh Hai Bakrapur is a social satire set against the backdrop of rural India. A multi-layered film, it is based on the complex belief systems that prevail in Indian society and the conflicts that ensue thereon. Yeh hai Bakrapur was part of The Film Bazaar[5] in the year 2012 as work in progress and it was also premiered at the Mumbai Academy of the Moving Image, 2013 Festival.\r\n\r\nThe film's story revolves around the family of the Qureshis and their pet animal goat. Circumstances result in the goat acquiring rock star status in his village and beyond. Soon enough, people are fighting for a piece of the live goat,named shaik asif. A rollicking climax ensues that provides the perfect finale to the mayhem that preceded it.","TrailerLink":"https://www.youtube.com/watch?v=hpwpyA23bWE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/hpwpyA23bWE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":6,"Rating":1.5,"CensorRating":"U","ReleaseDate":"5/9/2014","Runtime":90,"Budget":0,"Revenue":20000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0F4C60E8641691C6E899539EE076D703.jpg"},{"Id":"0de73807","ImdbId":"tt3431714","OriginalTitle":"Mastram","Title":"Mastram","Description":"How a clerk became an erotica writer.","TrailerLink":"https://www.youtube.com/watch?v=LBBgv0N3Vck","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LBBgv0N3Vck\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.45,"CensorRating":"A","ReleaseDate":"5/9/2014","Runtime":98,"Budget":20000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8638F5B4A406A492FF953ECD2A1D51BF.jpg"},{"Id":"0065971f","ImdbId":"tt2429930","OriginalTitle":"Khwaabb","Title":"Khwaabb","Description":"Khwaab is a story about the birth of a dream, of ambition and the fierce passion to achieve that dream amidst unceasing tribulations. This intense personal journey is set in the larger, bureaucratic world of Indian sports. It illustrates why a country with a population of 1.2 billion people cannot produce medal-winning athletes. How sheer, raw talent gets wasted or destroyed by corrupt politicians and power hungry bureaucrats. Khwaab is the story of one such athlete and her struggle to succeed in the cut-throat, debauched and mired world of Indian sports.","TrailerLink":"https://www.youtube.com/watch?v=JxFP_Fp4Y3I","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/JxFP_Fp4Y3I\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"5/9/2014","Runtime":101,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0F8254AF72058FEF93CF43CC36C9DFEF.jpg"},{"Id":"8a4eb4b3","ImdbId":"tt3501994","OriginalTitle":"Hawaa Hawaai","Title":"Hawaa Hawaai","Description":"Hawaa Hawaai is a film directed by Amole Gupte. The story summary is as follows....\r\n\r\nThe story centres around Arjun Harishchand Waghmare (Partho Gupte) and his dream to skate. The film chronicles his coach Aniket Bhargava (Saqib Saleem) and Arjun's journey towards being a champion skater. After his father's death Arjun moves to Mumbai and starts to work in a tea stall. He sees some children arrive at night for Lucky (Aniket) Sir. He sees that the children are skating and gets attracted to skating. \r\n\r\nHe finds the skates too expensive so his friends make a pair of skates out of garbage and call it hawaa hawaai. Aniket gets impressed by Arjun and decides to teach him skating. Arjun comes out to be very talented and Aniket decides to send him to participate in the district level skating race. On the day of the race Arjun gets missing . Aniket finds that he is ill and immediately takes him to a hospital where he comes to know that Arjun has hepatitis. Arjun gets cured and Aniket learns about the difficulties of a poor child. \r\n\r\nHe realizes that the Arjun and his friends have a big heart and they need to be educated. He tries to help them. All his other students come to meet Arjun. Aniket decides to send Arjun to the state level skating race. Arjun remembers of his father and wins the race. The film ends showing that Arjun and his friends are admitted in a school and an article is printed in the newspaper about Arjun.","TrailerLink":"https://www.youtube.com/watch?v=L8WEqUvoJw4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/L8WEqUvoJw4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.75,"CensorRating":"U","ReleaseDate":"5/9/2014","Runtime":120,"Budget":150000000,"Revenue":110000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/45D080F2B3FAFFBB39476006A311B0EE.jpg"},{"Id":"a8956d99","ImdbId":"tt3617048","OriginalTitle":"Angry Young Man","Title":"Angry Young Man","Description":"Angry Young Man is an action romantic thriller Hindi directed by Ramesh Rout, starring Ajay Sinh Rathod and Prachi Sinha in leading roles.The story synopsis is as follows....\r\n\r\n'Angry Young Man' is a thrilling and mysterious journey of a guy who's every breath was filled with revenge. But the Love remains unknown..... the Revenge remains unknown...Enemy remains unknown. Hold your breath while the mystery unfolds itself before you.\r\n\r\nArjun, a 24 years old street-fighter has gained a reputation of being 'indestructible' in the Mumbai Crime World, is a hero in his own right, the sheer capacity of enduring intolerable pain makes him a dreaded figure. His smartness and remarkable fighting style like Rocky Balboa is a scare to his opponents and entertainment to spectators. Beaten and broken time and again he stood up each time, such is his strength and might. Try bending him on his knees and he will bend yours...such was his attitude. Becoming the unbeatable and left with no worthy opponents, he found a worthy recruiter and began working for an Underworld Gang engaged in every unlawful activity with a hope to find the Unknown Enemy in the gangways of crime.\r\n\r\nSarah, an innocent, bubbly, sweet and a chirpy girl. She is a chatterbox who loves to talk. Sarah has just moved to Mumbai and is a neighbour to Arjun. She finds Arjun amusing and gets attracted towards him. She is amazed to see the most dreaded goons of the city bow in front of him with respect. This increases her curiosity about Arjun and she becomes keen to see him fight and is intrigued. Sensing Sarah's thoughts and with the risk of losing focus in life, he maintains a distance and tries to keep away. But fate had other plans for them. His ignorance adds fuel to fire and Sarah falls in Love with him. Arjun doesn't reciprocate her feelings.\r\n\r\nArjun's past doesn't give him permission to fall in love. When Sarah comes to know about his past, she further falls in deep love with him.....","TrailerLink":"https://www.youtube.com/watch?v=0NXZFfgoyXE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/0NXZFfgoyXE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.35,"CensorRating":"U/A","ReleaseDate":"4/11/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/86D5947C654CE720C73BE6573A840E7C.jpg"},{"Id":"fbab4cf0","ImdbId":"tt2063745","OriginalTitle":"Kya Dilli Kya Lahore","Title":"Kya Dilli Kya Lahore","Description":"Kya Dilli Kya Lahore is a war drama film set in 1948, post-Independence period and deals with the subject of Indo-Pak partition. The film is produced by Karan Arora and also marks the directorial debut of actor Vijay Raaz. The first look of the movie was released at Wagah Border. The story synopsis is as follows....\r\n\r\nIn 1948, a cross-fire erupts at an isolated stretch of Indo-Pak border, leaving only two soldiers alive. One is an Indian soldier of Pakistani origin while the other happens to be a Pakistani soldier of Indian origin. An ironic story of pride and survival begins when - in an attempt to evade danger, they bump into each other. And amidst continuous exchange of bullets, altercations and murkier situations, it evolves into a journey of human connection with an unforeseeable end","TrailerLink":"https://www.youtube.com/watch?v=Oy96lq-Nhx4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Oy96lq-Nhx4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.75,"CensorRating":"U/A","ReleaseDate":"5/2/2014","Runtime":100,"Budget":55000000,"Revenue":4000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C0AE6975C3C6BE05C4F6F61950509177.jpg"},{"Id":"3b3ca07c","ImdbId":"tt2612924","OriginalTitle":"Lucky Kabootar","Title":"Lucky Kabootar","Description":"Lucky(Eijaz Khan) is a down on his luck salesman, selling tractors and he is married to Lakshmi (Kulraj Randhawa) –a woman who he makes no bones of being disgusted by. Kammo(Shradha Das), the local goon(Ravi Kissen)’s sister is the love of his life. Lucky goes to the extent of visiting a resident Baba, Sexy Das(Sanjay Mishra) who looks like a cross between Satya Sai Baba and Rajneesh , to win Kammo’s heart. Sexy Das performs obscene acts, talks in double entendre and has a complement of female disciples pandering to his every whim(sexual and otherwise). The Baba’s most favored disciples are called Hard drive and Pen drive. The intention behind that is quite obvious(hic). \r\n\r\nThanks to Sanjay Mishra’s tongue-in-cheek performance, and his attempt to lend his character perennial villain Jeevan’s style in terms of dialogue delivery, there are at least a few moments of levity. Unfortunately , the scripting lacks direction. It appears as though a certain formula was decided upon first before the plot was given any shape. So the form and content here are distinctly unsavory and lascivious.\r\n\r\nA married man’s unfulfilled desire for a woman other than his wife, is not a plot that is new to Hindi cinema so there is nothing distinctive here other than the sexual innuendos and bad sex jokes that litter the dialogues and make them sound tasteless and crass.\r\n\r\nThe turn of events that allows for Lucky to lose his wife, win a windfall and also get Kammo in the bargain, is orchestrated so amateurishly that it looks and sounds absolutely weird. To top it there are sequences of ‘shradh/ death rites’ being conducted to keep up appearances, while the object of the ‘shradh’ is alive and watching the proceedings.\r\n\r\nObviously, the title refers to Lucky’s sudden wealth and the fact that before the windfall , he was a diffident and foolish young man who had no value for the wealth ( his wife, aptly named Lakshmi)he already possessed. Kulraj Randhawa appears to have lost the plot after a successful debut with ‘Yamla Pagla Deewana.’ Despite her pleasant , though unaffecting performance, she is unlikely to win any fans with this severely deluded outing.\r\nCrude sequences masquerading as semi-eroticism make the goings-on quite cringe inducing. There’s also a botched-up attempt to portray a gay Punjabi as hirsute and effeminate- the contrast looking absolutely outlandish and quite simply , unlikely. To top it, he is called Pussy. Then there is this lady politician who doesn’t think twice before mispronouncing standard hindi words and making them sound like deliberate sexual innuendos. There’s also this woman who is so wildly in love with the goon that she drenches herself in milk at every opportunity while the camera goes slow-mo on her obvious assets, just so that she can draw his attention to her. Such obscene references are definitely disrespectful to the character types and make the entire wildly careering narration look totally outlandish. Don’t risk your peace of mind on this one!","TrailerLink":"https://www.youtube.com/watch?v=wFNtduIT3vQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wFNtduIT3vQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":12,"Rating":2.8,"CensorRating":"U/A","ReleaseDate":"4/18/2014","Runtime":117,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B74F051AF9425A7BCACFBE5126923E4A.Jpg"},{"Id":"7bb250ee","ImdbId":"0","OriginalTitle":"Samrat & Co.","Title":"Samrat And Co","Description":"Dimpy Singh (Madalsa Sharma), approaches Samrat Tilakdhari (Rajeev Khandelwal), a private investigator, with a strange case. Their garden got ruined for reasons that appear natural but are not known; leading horticulturists have examined the fading plants but they have not been able to identify the probable reason. Further, her father's favorite horse died; once again the reason for the pre-mature death remains a mystery. That's not the end; Dimpy’s father Mahendra Pratap Singh (Girish Karnad), otherwise a very strong and balanced man, has been experiencing deteriorating health. All these aspects when combined makes the case sound weird and that grabs the attention of Samrat.\r\n\r\nSamrat along with his assistant friend, Chakradhar Pandey (Gopal Datt), visits the huge estate of Mahendra Pratap Singh. As he starts investigating, he discovers lots of mysterious facts. The story progresses when a murder takes place in the house, which leads to a series of events, complicating things for Samrat. Every character around seems to be hiding something","TrailerLink":"https://www.youtube.com/watch?v=oW6ojSD3dBE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/oW6ojSD3dBE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"4/25/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2580F1E708562EA1C41E7BF35CE9BF7B.jpg"},{"Id":"46f43317","ImdbId":"0","OriginalTitle":"Jal","Title":"Jal","Description":"Jal is a film which is set in the Rann of Kutch, India about an overconfident water diviner named Bakka, who tries to solve the drought problems in his village, but faces unforeseen circumstances when he tries to help a female bird watcher save flamingos. The story summary is as follows....\r\n\r\nJal revolves around a young man named Bakka (Purab Kohli), who is gifted with a special ability to find water in the desert. With the backdrop of water scarcity, the film tells a complex and intriguing story of love, relationships, enmity, deceit and circumstances that bring about the dark side of human character. Jal is a high-octane, action-drama with a shocking climax. Shot on an epic scale, the film is a visual treat and has managed to capture Rann of Kutch like never before.","TrailerLink":"https://www.youtube.com/watch?v=pNNEXQ-YcV8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/pNNEXQ-YcV8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":14,"Rating":3.3,"CensorRating":"U/A","ReleaseDate":"4/4/2014","Runtime":126,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D47216FC38B612F91471727DD22AB95F.jpg"},{"Id":"86cfd240","ImdbId":"tt4335698","OriginalTitle":"Honour Killing","Title":"Honour Killing","Description":"Honour Killing is a 2014 Bollywood multilingual social drama film written and directed by Avtar Bhogal and produced by Manmohan Singh under the banners of ABC Films International and Ek Onkar Films. The story synopsis is as follows...\r\n\r\nThere are three friends, a Sardar, Pathan and English Man (born and brought up in India). They are thick friends with staunch beliefs of their own, but being secular and living in the UK, they celebrate each others festivals. They are friends in need and friends indeed. However during minor altercations between the Pathan and the Sardar, it's the Englishman who soothes the ruffled feathers and mockingly chides them with a threat of deportation. They share a strong friendship with their families.\r\n\r\nThe Englishman has a daughter. The Pathan has two daughters. The Sardar has a son.\r\n\r\nSunny who is the Sardar's son comes to the UK for further studies. The parents have little time for their children as they are busy with their own lives. However they do indulge their children and try to fulfill their demands. The Englishman's daughter is about to get married in a Church. His Asian friends get together to do the Asian functions of Gidda, Bidai etc. Sunny and Sameera, the Pathan's daughter, meet for the first time and cupid strikes. They meet in college and their attraction for each other increases. They are young, in love and enjoy living. They go to clubs, pubs and restaurants and go for picnics. The Pathan and the respective families are not happy about the growing friendship between Sunny and Sameera.\r\n\r\nThe friendship develops into a full blown love-affair and both can't live without each other. The parents strongly oppose the relationship. Love has its own reasons and the couples believe and are confident that their parents will be liberal and will not object to their marriage but destiny has something else in store for them. The parents take a firm stand and their love is doomed. They can't marry, because they are from different communities.\r\n\r\nThe friendship between the parents of the couple turns into bitter enmity. They don't listen to their English friend's advice who ultimately advises the lovers to elope and get married...","TrailerLink":"https://www.youtube.com/watch?v=DY9IM-XXuMQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/DY9IM-XXuMQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":6,"Rating":1.5,"CensorRating":"U/A","ReleaseDate":"4/4/2014","Runtime":104,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3A933D63D17E69BA7AF43030ADAFAAA6.jpg"},{"Id":"5d1e40ba","ImdbId":"tt3514330","OriginalTitle":"Youngistaan","Title":"Youngistaan","Description":"Abhimanyu Kaul - a young, independent, Games Developer, living in Japan and the love of his life, Anwita Chauhan - a bubbly, passionate and full of life, summer intern. Their happy and content life faces the test of time, when blood ties and the pressure of being born into the first family of India tears a young Abhimanyu between his love for Anwita and a promise made to his dying father, the Prime Minister of India. Being a public figure, by reluctantly accepting to represent the governing party, much against his own wishes and at the cost of his private life, is a double-edged sword that Abhimanyu must walk on.","TrailerLink":"https://www.youtube.com/watch?v=rnHpKyN2IcY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rnHpKyN2IcY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.6,"CensorRating":"U/A","ReleaseDate":"3/28/2014","Runtime":133,"Budget":691000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/91C8F2A53A11AC1A76806F6C9F8817D6.jpg"},{"Id":"24bd39ae","ImdbId":"tt2191164","OriginalTitle":"Station","Title":"Station","Description":"Station is a 2014 Hindi thriller film written and directed by Saad Khan and was produced by Sumit Ghosh Media, an independent company that promote talents from Bangalore. Sameer Kevin Roy, Vibhinta Verma, and Siddhanth Sundar star as the main protagonists of the film. Production began in November 2011, and was wrapped up in July 2012. The film went to post-production in March 2013, and was released on 28 March 2014 via PVR Cinemas and its arm PVR DIRECTOR'S RARE which works as a springboard to support the theatrical release of the critically acclaimed cinema and niche content from across the world. The film follows three psychotic assassins as they wait to finish a job at a waiting room on a deserted railway station. The story synopsis is as follows....\r\n\r\nThree psychotic assassins take up a job at a waiting room of a deserted railway Station. Will they finish the job or anything that can go wrong will go wrong?","TrailerLink":"https://www.youtube.com/watch?v=0bP_rvHTKjc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/0bP_rvHTKjc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":16,"Rating":3.8,"CensorRating":"U/A","ReleaseDate":"3/28/2014","Runtime":120,"Budget":10000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/ED15958BE5EF7976A61C31FE467A4BB6.jpg"},{"Id":"2eed2c0e","ImdbId":"tt2976176","OriginalTitle":"Lakshmi","Title":"Lakshmi","Description":"Based on true events, Lakshmi is a story of heroism and untold courage. Lakshmi, a 13 year old girl is kidnapped and sold into prostitution. Thrown into this horrific, inhuman world where she is raped and brutally beaten she barely survives with the help of the other girls and her own will to never give in. Finally she is rescued in a police raid. Against all odds, Lakshmi shows courage where everybody else fails. Resisting all pressure - violent threats, coercion and bribes, she stands up in court and in a landmark case in India, succeeds in putting the traffickers behind bars.","TrailerLink":"https://www.youtube.com/watch?v=Wf4hOMpKlEI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Wf4hOMpKlEI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.95,"CensorRating":"A","ReleaseDate":"3/21/2014","Runtime":115,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9E7B3CB27EE41EBFD5955A4CE6A0AFCC.jpg"},{"Id":"23845f6d","ImdbId":"tt3303416","OriginalTitle":"Ya Rab","Title":"Ya Rab","Description":"Ya Rab is a 2014 Bollywood movie directed by Hasnain Hyderabadwala starring Ajaz Khan, Arjumman Mughal, Raju Kher, Vikram Singh (actor), Imran Hasnee. The film shows the battle between two ideologies. One group represents the Islamic principles of compassion and respect for human life, while the other incites youth to avenge alleged atrocities on Muslims. The story synopsis is as follows...\r\n\r\nThe basic idea behind Ya Rab is to show how Islam has been used as a tool to propagate terrorism. The Quran does not approve of terrorism in any way, not a single verse in the Holy Quran supports terrorism. Many people mention verses from the Holy Book and present it as evidence of Islam being a terror breeding religion for their political and monetary gain. \r\n\r\nYa Rab focuses on such issues where we deal with so called self proclaimed Maulanas (Islamic Preachers) who misinterpret The Quran and its real meaning to breed terrorists and terrorist activity. It also shows how such people manipulate the young and vulnerable youth in the name of Islam and Jihad to run their terror shops. \r\n\r\nYa Rab is a genuine effort to show the right face of Islam and to guide the misguided on the right path.","TrailerLink":"https://www.youtube.com/watch?v=mG8EX4tei78","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/mG8EX4tei78\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.1,"CensorRating":"U/A","ReleaseDate":"2/7/2014","Runtime":120,"Budget":250000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/877B3AD2B0F44B8A8545DA60EEAEF48F.jpg"},{"Id":"9430bd4e","ImdbId":"tt3334348","OriginalTitle":"Heartless","Title":"Heartless","Description":"A young man, Aditya Singh (Adhyayan), who fell deeply in love with a beautiful girl (Ariana). Soon he had a severe heart-attack, and when consulted with his doctor-friend (Shekhar Suman), he then suggested him to do a heart-transplant. As Aditya lands in the operation theatre, some bizarre thing happens in his life, and lots of unsaid and controversial betrayed story unfolds.","TrailerLink":"https://www.youtube.com/watch?v=AFBcJgsVak4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AFBcJgsVak4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":12,"Rating":2.64167,"CensorRating":"U/A","ReleaseDate":"2/7/2014","Runtime":131,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/397F9BEA79D6B06F92E8819C20BB37F1.jpg"},{"Id":"6ef3f2e0","ImdbId":"tt3426144","OriginalTitle":"Babloo Happy Hai","Title":"Babloo Happy Hai","Description":"","TrailerLink":"https://www.youtube.com/watch?v=3_k_BQCZOPU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/3_k_BQCZOPU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.3,"CensorRating":"U/A","ReleaseDate":"2/7/2014","Runtime":113,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C5374D96F4D3FEB50B81C2BF672D479F.jpg"},{"Id":"ea19793d","ImdbId":"tt1867064","OriginalTitle":"Strings of Passion","Title":"Strings Of Passion","Description":"A drama of love, deception and humanity, Strings of Passion is an urban commercial flick set in the City of Joy which tells the story of 3 guys who has one thing in common - their love for music and life. \r\n\r\nNeel, Aman and Amit are young and dynamic guys who run the band \"Strings of Passion\" but are shadowed by the influences of drugs, broken love and bad parenting. Apparently instigated by college blues, they run a ruthless period of drugs, depression & desolation until the women in their lives create magic and rejuvenate them to sensible human beings. \r\n\r\nNeel, Aman and Amit are young and dynamic guys who run the band \"Strings of Passion\" but are shadowed by the influences of drugs, broken love and bad parenting. Apparently instigated by college blues, they run a ruthless period of drugs, depression & desolation until 3 women in their lives create magic and rejuvenate them to sensible human beings.","TrailerLink":"https://www.youtube.com/watch?v=T9c7sFpGubI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/T9c7sFpGubI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.55,"CensorRating":"A","ReleaseDate":"1/17/2014","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E7E2AF40110A9CEF9F0A67464BC0B5C6.jpg"},{"Id":"52c34a32","ImdbId":"tt2907156","OriginalTitle":"Paranthe Wali Gali","Title":"Paranthe Wali Gali","Description":"A romance between a Sikh girl Naina Kaur and a Rajasthan boy Maulik.","TrailerLink":"https://www.youtube.com/watch?v=A3kpIWS3Jfg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/A3kpIWS3Jfg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":10,"Rating":2.4,"CensorRating":"U","ReleaseDate":"1/17/2014","Runtime":105,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6356A3E59D20EDE58BCC8E46A2054C98.jpg"},{"Id":"8e2974aa","ImdbId":"0","OriginalTitle":"Om Dar-B-Dar","Title":"Om Dar-B-Dar","Description":"Om Dar-B-Dar is a portrait of life in Ajmer town, Rajasthan. The film tells the story of a young boy named Om in the period of his carefree adolescence and its harsh disillusions. The story starts as a comedy and ends as a thriller. Om has a rather strange family. His father, Babuji, a government employee, leaves his job so that he can dedicate himself to astrology; Om's older sister, Gayatri, is dating a good-for-nothing fellow. Om is involved in science, but is also attracted to magic and religion. In all it seems that his really outstanding skill is his ability to hold his breath for a long time.","TrailerLink":"https://www.youtube.com/watch?v=PeXdRn-CLj0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/PeXdRn-CLj0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"1/17/2014","Runtime":101,"Budget":1000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/76934B36404C2D2265A9E696F10D1769.jpg"},{"Id":"4f5f1f94","ImdbId":"tt3465488","OriginalTitle":"Karle Pyaar Karle","Title":"Karle Pyaar Karle","Description":"Karle Pyaar Karle is an adrenaline gushing, action packed, edgy love story of two rebels, Kabir & Preet, playing the game of life.","TrailerLink":"https://www.youtube.com/watch?v=3CqQTqmcxqE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/3CqQTqmcxqE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":7,"Rating":1.75,"CensorRating":"U/A","ReleaseDate":"1/17/2014","Runtime":110,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5B3C7E10E1AE2E26A87913A12551241B.jpg"},{"Id":"41e41e15","ImdbId":"tt2876408","OriginalTitle":"Mr Joe B. Carvalho","Title":"Mr Joe B Carvalho","Description":"A small time detective is hired to bring back the daughter of a businessman who has run away from home with the house chef.","TrailerLink":"https://www.youtube.com/watch?v=lNewB37kohM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/lNewB37kohM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"1/3/2014","Runtime":130,"Budget":15000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E05D7971F443CBE6E3D9D62A6252B367.jpg"},{"Id":"44bf526d","ImdbId":"tt3001638","OriginalTitle":"Mary Kom","Title":"Mary Kom","Description":"The movie opens with a pregnant Mary Kom (Priyanka Chopra), heading towards the hospital with her husband Onler Kom (Darshan Kumaar). Onler is mistaken for an insurgent and beaten when he tries to find a vehicle despite a curfew. The film then shifts to a flashback with Mangte Chungeijang Kom, finding boxing gloves in the remains of an air crash in 1991, which prompted her interest in boxing despite her father's disapproval. During an early fight, she chases a boy and ends up in a boxing gym. The coach of the gym, Narjit Singh (Sunil Thapa) is the coach of the Asian Champion Dingko Singh, and Kom tells him about her boxing aspirations. He asks her to visit the gym for next thirty days and says that he will only teach her if she is deserving enough. She starts visiting the gym, telling her mother but not her father. Days pass but her father does not enquire about her. Due to Kom's dedication and stubbornness, Coach Singh starts training her, suggesting she change her name to Mary Kom.\r\n\r\nAfter winning the state level Championship, her father confronts her for hiding about the sport from him. Her father asks her to choose between him and boxing: she chooses the sport. Kom has to fight a wrestler to arrange money to get her household cow back, which is where she meets the footballer Onler Kom. After watching the 2002 Women's World Amateur Boxing Championships on television, Kom reconciles with her father, who apologises to her for not understanding her passion for the sport. Meanwhile, Onler proposes to her and agrees never to ask her to leave boxing. After she wins the 2006 Women's World Amateur Boxing Championships, Kom agrees to marry him; however, her Coach shows his unhappiness towards Kom's marriage decision. After her marriage, Kom becomes pregnant. She does not participate and gives up her career to look after her family.\r\n\r\nKom's gives birth to twins and applies for a government job. However, when offered the position of a constable she refuses, feeling that as a world-champion boxer, she is above that position. It devastates her to learn that people no longer recognise her. Onler encourages her to revive her boxing training. She joins the gym again, leaving her husband to look after the children at home. Her coach is still upset about her decision to marry, but Kom makes a comeback in the National Boxing Championship. Despite performing better than her opponent, she loses the match due to the apparent partiality of the judges. Kom throws a chair in anger towards them, resulting in a ban. She later makes a written apology, and the official accepts it, not without insulting her.\r\n\r\nKom then asks Coach Singh to train her, as she thinks that he is the one who can get the best out of her. He starts training her with gruelling activities and she reaches the finals of the 2008 AIBA Women's World Boxing Championships. Meanwhile, Onler Kom informs her about one of her children having a hole in their heart. In the subsequent fight, Kom fails to defend herself. After a knockout punch from her opponent, Kom hallucinates about her husband and children in the audience. She regains her strength and fights back, winning the 2008 Women's World Amateur Boxing Championships. On the podium while accepting the medal, she learns that her son's surgery was successful and she is given the nickname \"Magnificent Mary\". The film ends with the Indian flag waving and the national anthem.","TrailerLink":"https://www.youtube.com/watch?v=FCcDPY_tX6M","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/FCcDPY_tX6M\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Sport","RatingCount":14,"Rating":3.4,"CensorRating":"U","ReleaseDate":"9/5/2014","Runtime":122,"Budget":150000000,"Revenue":1040000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/16B9DE72A3F95215B86AC8C3383D8433.jpg"},{"Id":"72164f7f","ImdbId":"","OriginalTitle":"Dekh Tamasha Dekh","Title":"Dekh Tamasha Dekh","Description":"nspired by a true incident, the film starts off when an underprivileged man gets crushed under the weight of a politician's (Satish Kaushik). The film gets into the mood immediately after the death of this man. Be it the judge trying to get into the details of the man's death, be it the lawyers of the parties arguing the case, be it the sparking off of the communal riots. Since the deceased, who was a Hindu by birth, but had got converted to Islam, his death gives rise to a religious spark between two religious factions \"the Hindus and Muslims\" who want his body to be burnt and buried, respectively","TrailerLink":"https://www.youtube.com/watch?v=MPlgyRzE3Ug","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/MPlgyRzE3Ug\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"4/18/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3FD39C566ADA5579F2A4DBA23346F51C.jpg"},{"Id":"f11cbdf8","ImdbId":"tt4047132","OriginalTitle":"Oru Oorla Rendu Raja","Title":"Oru Oorla Rendu Raja","Description":"Azhagu and Mike are thick friends and go lucky,jobless youths who just roam around doing nothing.They meet Priya in a train while trying to escape from a few goons who were chasing them for a reason. Initially they take Priya for a prostitute but later understand that she is actually a doctor. Azhagu falls for her immediately and decides that he should become an Engineer, so that he can marry Priya the Doctor. Priya is saved by Azhagu from a man who tries to kill her. Azhagu then listens to her story. Priya had a friend Kalpana,who was from a village where Priya went for a medical camp.There she learns that the people of that village are affected by potential cancer and other effects due to the Steel factory owned by Selva Vinayagam. Priya enters the company with the help of kalpana,who works there. Priya gathers proofs and talks with Selva to provide Safety equipments to the workers so that no one gets affected further. But selva denies and insults Priya, who leaves the place. Back in the factory, Kalpana operates a costly machine and unfortunately gets her hand stuck in it, resulting in huge blood loss. Priya begs the owners to dismantle the machine, so that kalpana can be saved, but the owners are reluctant and Kalpana dies as a result. Hence Priya decides to sue the company and files a case against them. The case is being heard the next day and if Priya makes it to the Court, the company will lose the case. So she is being targeted by Selva's men . How Azhagu and Mike help Priya escape the goons and Whether they help her to win the case forms the rest of the story.\r\n\r\nThe Story is centered on a factory in Kayalpattinam (Thoothukudi) which explores the safety of labourers in factories being at jeopardy. It was a noble effort by Kannan to have raised an awareness and caution to incorporate safety standards inorder to avoid any untoward incident that may harm the labourers' lives and lifestyle through this film. After the film's release, one of the most fatal incidents due to oversight in the Industrial safety measures happened at Ranipet Sipcot industrial estate in Vellore district when a tank of an effluent treatment plant collapsed on the compound wall of an adjacent factory where the employees were present. Ten workers died as a result of this nasty incident.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":1.25,"CensorRating":"U/A","ReleaseDate":"11/7/2014","Runtime":132,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AA2B0632FD3907781081E51116A7DB3E.jpg"},{"Id":"ee64c7a8","ImdbId":"tt2317135","OriginalTitle":"Tamanchey","Title":"Tamanchey","Description":"Tamanchey romantic crime comedy film directed by Navneet Behal and stars Nikhil Dwivedi and Richa Chadda in leads.The summary is as follows....\r\n\r\nTamanchey fires off when boy, Munna, a rustic kidnapper from Uttar Pradesh meets girl, Babu, a street smart drug peddler from Delhi. As criminals go, they meet in police custody while being escorted to jail.\r\n\r\nTheir romantic saga ensues when they get a dramatic chance to escape. During this escapade they are forced to stay together for a short period. By the time they've reached the end of their journey and potential freedom, Babu chooses to walk away, without warning. In her moment of doubt she chooses her familiar world of crime and ambition over her emotions for Munna. \r\n\r\nThe dejected lover, Munna, follows her to Delhi only to find that she's the mistress and right-hand of an uncouth, merciless and possessive gang leader, Rana. \r\n\r\nThe determined Munna steels himself and joins Rana's gang with the intention of eloping with Babu. This time Babu caves in to her feelings and thus begins their clandestine love affair right under the nose of the dangerous gang leader in the underbelly of Delhi's crime world. \r\n\r\nIn this dangerous world, they can only be together and evade Rana's scrutiny as long as they continue doing what is expected of them as criminals. They have to peddle drugs and engage in robberies. These acts of crime are their romantic dates, their treasured moments of being together. Rana is oblivious to their romance, happy counting his growing wealth from Munna-Babu's criminal adventures. \r\n\r\nTheir robbing sprees cause havoc in the city and the law is after them with a vengeance. Matters reach a point of no return when a robbery goes wrong and they end up killing a cop. They now have to retreat to a hide-out along with the gang lord Rana. \r\n\r\nThis brings an abrupt end to their romantic tryst. To make matters worse, Rana takes the decision to leave the country along with Babu. It is time for Munna - Babu to face their fears and confront Rana. Knowing Rana, this can only mean one thing - kill Rana. \r\n\r\nHowever, not only does their plan to kill Rana fail, their secret affair gets exposed. They are now on the run not only from the law but also from Rana. \r\n\r\nWith the world of law and the world of crime after them, they know they have to make some hard choices. Their dreaded fears come true when they are cornered by Rana. However, yet again, they get a narrow chance to escape when a shoot-out happens between Rana's gang, the police and Munna - Babu. \r\n\r\nThis time they manage to at least get even with Rana. They kill him and are able to give a chase to the police. However the law is still after them and they both know that this cat-and-mouse chase with the law is unsustainable. It is not the life they want anymore. They would rather live as free, fearless lovers even if it meant serving time and waiting it out to be together.","TrailerLink":"https://www.youtube.com/watch?v=wB0DRV46Jz4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wB0DRV46Jz4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":10,"Rating":2.35,"CensorRating":"U/A","ReleaseDate":"10/10/2014","Runtime":113,"Budget":0,"Revenue":15000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0339DC2C884208049CE4931D33455496.jpg"},{"Id":"ef587818","ImdbId":"tt3722742","OriginalTitle":"Yaaran Da Katchup","Title":"Yaaran Da Katchup","Description":"Yaaran Da Katchup is a 2014 Punjabi action comedy film, directed by Abhay Baiju Chabbra starring Jaswinder Bhalla debutant Punjabi singer Hardy Sandhu Yuvika Chaudhary Anita Hassanandani Varun Sharma and Rana Ranbir","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"7/18/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/DA9CEC2585C9EABC2C3B6064B2565EF2.jpg"},{"Id":"19c6f3c8","ImdbId":"tt3709344","OriginalTitle":"City Lights","Title":"City Lights","Description":"An ex-Army driver who owns a garment store, Deepak Singh's life is tangled in the midst of poverty, hope and despair. Deepak's family consists of his ever-supporting wife and his little daughter. They tag along his journey to Mumbai as he is unable to repay money he owes on his store. With no contacts and addresses, except that of his friend, Omkar, Deepak takes extreme measures when stepping to Mumbai while searching for him.\r\n\r\nHe is easily tricked by two con-men who sold him a Flat for 10,000 RS, only to find out while searching them for the documents. With no details on them, the Mumbai police refuse to file an F.I.R. His wife meets an escort working at a night bar who provides them an unconstructed flat for time being and convinces her to be a bar dancer till Deepak becomes stable.\r\n\r\nDeepak gets hired as driver for a security bureau with a monthly pay of 15,000 Rs. Deepak's senior realizes that he is far too innocent and does various favours for him in order to gain his trust to loot the security agency. Deepak is extremely against the theft when the senior first mentions it. Then the senior blackmails him saying that a previously stolen box is currently kept in Deepak's house. Feeling cornered , Deepak agrees to the risky plan of stealing the keys for this box when suddenly they are both robbed again and the senior is killed. Meanwhile Rakhi loses her job tragically. Deepak finds the box stolen by his senior in his house and comes up with a plan to ensure Rakhi and Mahi's safe return to their village.\r\n\r\nThe movie ends when his attempt to steal the keys from the agency cost him his life but through a shrewd tactic he is able to pass on Rakhi the key for the stolen box. Rakhi and Mahi return to the village with Rakhi lost in memory of Deepak and their happy past.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":15,"Rating":3.6,"CensorRating":"U/A","ReleaseDate":"5/30/2014","Runtime":126,"Budget":70000000,"Revenue":350000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/EA2B973D1CCEB9177AAE5CE29D70460D.jpg"},{"Id":"4cddd0cc","ImdbId":"tt3359290","OriginalTitle":"Bobby Jasoos","Title":"Bobby Jasoos","Description":"Living in a middle class orthodox family of Old Hyderabad, Bilqis Ahmed aka Bobby (Vidya Balan) is a wannabe private detective. To pursue her passion of spying, Bobby solves petty neighbourhood cases. Such as helping Tasawur (Ali Fazal) a TV show host, to get rid of marriage proposals brought home by his parents. Bobby finally gets her big break when a rich NRI Anees Khan (Kiran Kumar) hands her a case of finding two missing girls named 'Nilofer' and 'Amna' with a birth mark on their hand and shoulder, respectively. To solve the case, Bobby takes up many get-ups such as 'beggar', 'peon', 'hawker', 'nerd student', 'astrologer' and even a fake ' TV producer'. After locating the targets, Khan pays her a tremendous fee and also offers huge amount of money to both girl's fathers for reasons unknown to Bobby. Khan also hands over his 3rd and final case of finding a boy with a missing toe named 'Ali'.\r\n\r\nMeanwhile Bobby and Tasawur's family fix their marriage leaving both into the dilemma of how to get rid of this situation. A local goon Lala (Arjan Bajwa) also offers a case to Bobby to break Lala's girlfriend's marriage, which is forcefully fixed by her mother. On Bobby's denial, Lala makes her realize that she has been helping the NRI for a wrong cause. Doubting on that Bobby tries to know the whereabouts of the two girls, but gets to know that both girls are missing. Scared and shocked Bobby takes help from Tasawur and sneaks into Khan's hotel room to check his background only to be caught and thrown out. But Bobby manages to get a hold of Khan's diary and his old photograph, which later gets in the hands of Lala who since then starts following Bobby.\r\n\r\nKhan now suddenly goes into hiding and Bobby starts searching for him with the belief that Khan will not leave the town without his third target Ali. With the help of clues in Khan's diary such as a London based library's stamp and a Biryani order from a local restaurant. Bobby gets to know about Khan's background and later Khan is shown following Ali. It turns out to be a trap to capture Khan. With the twist in the climax, it is revealed that the three people Khan was looking for were his long lost children during communal riots. Khan has offered money to both girl's foster parents for helping them and sent the girls to London to pursue a higher education. Tasawur also enters the scene along with Lala who is Khan's long lost son 'Ali'. Film ends with Bobby becoming a famous detective, while she and Tasawur now in love with each other but are still confused about their marriage","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"7/4/2014","Runtime":121,"Budget":180000000,"Revenue":108500000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E38C68E3B03E91260D31F1F3C8EC2F6D.jpg"},{"Id":"bf3dad2f","ImdbId":"","OriginalTitle":"Kaash Tum Hote","Title":"Kaash Tum Hote","Description":"Set amidst the love story, Kaash Tum Hote is a horror drama of unrequited love filled with deceit, murder and crime.","TrailerLink":"https://www.youtube.com/watch?v=Qbj51yjITHI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Qbj51yjITHI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.2,"CensorRating":"U/A","ReleaseDate":"12/12/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/00F1BE557252532CCB16BBFF90DEC645.jpg"},{"Id":"79a48bf5","ImdbId":"tt3801252","OriginalTitle":"Na Maloom Afraad","Title":"Na Maloom Afraad","Description":"Farhan (Fahad Mustafa), is a sales representative at IFU life insurance company in Karachi and is fired after he fails to materialize any deal in a year. Moon (Mohsin Abbas Haider), who hails from Punjab (Faisalabad), has a dream of going to Dubai, but ends up coming to Karachi while his family continues to believe he is living in Dubai and Shakeel bhai (Javed Shaikh), an honest man who works as a government servant and owner of homemade pickle business 'Shama Achar' is under pressure to get his younger sister Naina (Urwa Hocane) married, but can't manage to do so due to financial constraints. Farhan is a paying-guest of Shakeel and is in love with his sister.\r\n\r\nMoon becomes the new tenant of Shakeel, after gets kicked out by his landlady (Shehnaz Pervaiz) for not paying rent on time. Jobless Farhaan and Moon come up with a plan to take a life insurance to open an account in a bank and then burn it in Karachi strike, posing as 'Na Maloom Afraad', so that they claim desired amount of money in the claim from insurance company. Meanwhile, a proposal came for Naina and they ask for a car as dowry; devastated with his situation Shakeel went to break his fixed deposit, but he realized that he had already withdrawn it in 1998 for his mother's (Zaheen Tara) operation. Thinking of mortgaging his home, Shakeel is revealed that the government has given them a one-month notice for leaving their houses due to bridge construction over the area. With all these difficulties, Shakeel tries to commit suicide but is saved by the police. Both Moon and Farhan revealed their plan to Shakeel, of which first he refused to part of it, but due to his problems he reluctantly agrees. Farhan went to Gogi (Salman Shahid) a local mobster, to lend money for their plan. Gogi gives him three lacks, which Farhaan agrees to return with interest of six lacks. Shakeel and Farhan posing as husband wife opens an account but the bank and they gets robbed. Moon falls in love with the bank worker Hina (Kubra Khan).\r\n\r\nAll fake themselves as a rich individuals and then get an insurance policy to own a fake claim. Moon who has also lent money from Gogi earlier for going Dubai, is running from him due to the drugs he saw in a doll which he gave him to transfer to another mobster in Dubai. After Jumma prayer all three get jammed in a strike and try to burn the bank but are caught on camera and merely escape from police. Looking at every plan going wrong, Shakeel borrows money from Gogi by giving his house on mortgage. Gogi reaches them and asks Moon for the drugs, unable to get them he gives them one week to give him a crore. All blamed each other for their situation. Shakeel gets unconscious and on the way to the hospital they get stuck in the strike, however later it is revealed that it was a part of plan so they get escape from strikers. They provoke strikers to burn the bank but only then they get to know that bank is empty. Later an IFU insurance inspector Samuel (Nayyar Ejaz) came to gave them claim of thirty lacks, and warns them that he knows about what they did.\r\n\r\nThey went to Gogi to offer him thirty-lack and ask him for a time, but is then gets into a fight with Dubai mobster and Gogi, both gets killed and All of three came home shocked. They find a phone ringing in a suitcase containing money and jewelry. It is then revealed that Hina robbed the bank before the strike for them. With the money all gets settled, Shakeel buy a new home and standardize his pickle business, Farhan happily marries to Naina and Moon fulfill his dream of going to Dubai.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":18,"Rating":3.975,"CensorRating":"U/A","ReleaseDate":"10/6/2014","Runtime":137,"Budget":90000000,"Revenue":300900000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9E855E737779DF82F1F33AE23096E836.jpg"},{"Id":"4d8ab7d1","ImdbId":"tt2998196","OriginalTitle":"Kuku Mathur Ki Jhand Ho Gayi","Title":"Kuku Mathur Ki Jhand Ho Gayi","Description":"Kuku Mathur Ki Jhand Ho Gayi is a 2014 Hindi comedy, romance, drama film directed by Aman Sachdeva and produced by Ekta Kapoor & Bejoy Nambiar. The story synopsis is as follows... \r\n\r\nKuku, a motherless boy tries to find his happiness with his childhood friend Ronnie Gulati. Living with his father and younger sister, Kuku possess an inborn talent for cooking but his not so well off family proves as a hinderance to his dreams. \r\n\r\nHowever, Ronnie, born in a joint family has a wealthy father to support and he soon becomes engrossed in his business, a start up given by his father. Unable to dedicate time to his buddy Kuku, the two have a rift. But not ending at that, an enraged Kuku plots to avenge his friend by burning his godown and using the goods there to fulfill his dreams of being a cook.","TrailerLink":"https://www.youtube.com/watch?v=dtWt8r1iCQk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/dtWt8r1iCQk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.65,"CensorRating":"U","ReleaseDate":"5/30/2014","Runtime":109,"Budget":25000000,"Revenue":34500000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A6BE8C4DD1800748485CCE6A2B8DDB8D.jpg"},{"Id":"29e45c40","ImdbId":"tt4187650","OriginalTitle":"Trip to Bhangarh","Title":"Trip To Bhangarh","Description":"If we look back a few years, at the history of Indian cinema, it is evident that the movies that have done well at the box office are either based on real life issues, are youth-centric, or have ultra impressive music. Box office collections are also proof that such movies perform well with the masses. For example – Dirty Picture, Paan Singh Tomar, Gangs of Wasseypur, and the recent Bhaag Milkha Bhaag were all based on or closely related to real people or events, a few hit youth-based movies are Pyaar ka Punchnama, Kai po che, 3 Idiots, Shaitaan, Nautanki Saala, Chashme Baddoor, fukrey and the latest, yaariyan ( with new faces ) and if we look at musical films, movies like ashiqui 2 and the recent Yaariyan have been blockbusters.\r\n\r\nOur movie, Trip to Bhangarh is based on a real haunted place – “Bhangarh” with an interesting history, which is sure to spark the interest of the audience. It is youth-based and the soundtracks of the movie, sung by renowned singers like Mohit Chauhan, Tochi Raina, Palak Muchchal and Sri Ram Iyyer .\r\n\r\nStoryline: The movie begins with a college reunion party, where 6 friends meet each other after two long years. Jai – a journalist, was a music freak in his college days, his music impressed one and all; fun-loving and adventurous, a true college heart-throb. Jadoo – a photographer and a certified flirt, who misses no chance to fool pretty young girls with false dreams of stardom, a facebook addict – he has to update everything as his facebook status. Aashu – a sales executive, has a way with words like no one else, even his seniors were no match for his wit. Golu – a couch potato in the true sense, who loves to eat; does absolutely nothing except an occasional visit to his father’s company, has a wicked sense of humour and famous throughout college for his double-meaning jokes. The female member of the group – Kavya- is a complete tomboy at heart; out-going and confident, she is a no-nonsense girl who can beat the guys at their own games. And Prachi – a typical girl friend of jai, is a girl who wants, Jai to be with her always. She always fight with him if he an follow his instructions.\r\n\r\nIn the Reunion party from one of their friend they came to know about the place called Bhangarh. BHangarh is asia’s most haunted place , and it is believed that if any body stay their in night, will not survive afterwords. ( and such real incidents are available on google, that if any body stay their in night, next morning they found dead ) so these people plan a Trip to this place for the fun. During this trip they discover history and unique things about this fort. And this made their life hell. This film goes to breath taking climax.\r\n\r\nUSP: The movie is entirely youth-centric. Its dialogues are well-written and catchy enough to attract the audience instantly. The soundtrack is a complete package – ranging from party songs to romantic, travel songs, a sad song and a fresh peppy promotional title track. The movie is jam-packed with twists and turns to keep the audience on the edge, yet they are logical and make the climax of the movie even more breathtaking for the audience. Asia’s most haunted place Bhangarh, served with the spice of suspense, comedy, thrill and romance, this movie is a complete family package.\r\n\r\nThis is the first film in India shot on a real haunted place ‘Bhangarh","TrailerLink":"https://www.youtube.com/watch?v=HquoG9-2dio","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/HquoG9-2dio\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":8,"Rating":1.50625,"CensorRating":"U/A","ReleaseDate":"4/22/2014","Runtime":113,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A115CA1AFC3E9DA940BC45BC1F284418.jpg"},{"Id":"6b68af32","ImdbId":"tt2112337","OriginalTitle":"Words with Gods","Title":"Words with Gods","Description":"Words with Gods is one part of a 2014 Mexican-American anthology film called Heartbeat of the World. It was directed by nine directors, and was screened out of competition at the 71st Venice International Film Festival. Comprising several short films, Words with Gods follows the theme of religion, specifically as it relates to an individual's relationship with his/her god or gods. The order for the film was done by the Nobel Prize winner[1][2] Mario Vargas Llosa","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"8/30/2014","Runtime":133,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8F55FB1F5873F7C546958E15FEE5F9DE.jpg"},{"Id":"e4e92d23","ImdbId":"","OriginalTitle":"18.11 (A code of Secrecy...!)","Title":"1811 (A Code Of Secrecy!)","Description":"18.11 A Code Of Secrecy is an Indian Hindi film directed by Md. Mohibul Haque casting Rehal Khan as lead role. The story synopsis is as follows....\r\n\r\nThe Film 18.11 a code of Secrecy..!! is based on Science & Technology and Packed with Romance, Comedy, Action. Thrill and Specially the Suspense lies in the name title - 18.11... which is revealed at the end. Rehal khan, the Hero of the Film is a Software Engineer in America,During his Course he made a software which generates an alarm and sends a danger signal about Bomb /Explosive plan in every mobile phone within the radius area of 1k.m.He did not experiment the same in America. The Union Home Minister-Mr. Digambaram sponsors his Bomb/Explosive Detect Project and ask him for Experiment and Accordingly Rehal Khan begins Experiment by a Mission Named\" MISSION 3 E\" .Rehal Khan operates this mission from a secret laboratory in deep forest.Rehal Khan maintain secrecy and keep Distance from his Family Members including his Girlfriend. His Experiment becomes Successful. He detected many bomb plan made by Captain Rack (Gulshan Grover),Chairman,World Super Power Organization i.c International Don .Captian Rack Tries to purchase rehal Khan and his Project but Failed .Trapped Rehal Khan into Terrorist Activity and send him to jail with the help of the Corrupt Police officer-Kuldeep Sharma (Mukesh Tiwari) and Habilder-Paholwan (Asrani). Rehal Khan kills kuldeep Sharma and other Militants & Criminal and Arrested Captain Rack in Sri Lanka.The State Home Minister-Mr.Gogoi (Prem Chopera) moves the High Court and Release Rehal Khan from the jail and Freed him from all false, Bogus Cases as per advise of Union Home Minister who also Presented.\" Bharat Gaurav Award\" to Rehal Khan for Bomb Detection and life Saving Software for Patriotic Manner in a Glorious Function.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":4,"Rating":0.6875,"CensorRating":"U/A","ReleaseDate":"6/13/2014","Runtime":126,"Budget":17500000,"Revenue":125000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/349879EF051976DF5C9698D7642F396A.jpg"},{"Id":"621876db","ImdbId":"tt3382148","OriginalTitle":"Yaariyan","Title":"Yaariyan","Description":"Living in a university campus set in Sikkim, Lakshya (Himansh Kohli) is the son of a martyred army officer but does not appreciate his father's sacrifice for the nation. Lakshya, Jiya (Nicole Faria) - a college bombshell, Saloni (Rakul Preet Singh) - a geek, Pardy - a drummer, and Neil - a biker, are five close friends who are exploring the best moments of their lives in college, experiencing different relationships yet living an aimless life. They come across a challenge when their college land has been bought by an Australian businessman who plans to build a casino instead but is ready to lease out the land to the college for 100 years only if they're able to defeat a team of Australian students in a five-round competition.\r\n\r\nFor the first three rounds they are sent to Australia where Lakshya meets his best friend and cousin Debu. During the first round of rock concert, the Australian band steals Lakshya and his band's song, and on protest they brutally beat Debu. While Debu is rushed to hospital, Lakshya and the band perform a Hindi song, eventually losing the first round. Saloni then wins the second round which is a chess competition. Unable to recover from his injuries, Debu succumbs to death in the hospital. Disturbed by his death, Saloni and Neil lose the third round of bike race, giving Australia a 2-1 lead.\r\n\r\nThe competition is then shifted to India with two more rounds to go. Lakshya discovers that Neil was the traitor who gave their song to the Australian band and intentionally lost the bike race motivated by a greed of getting an Australian emigration as promised by an Australian team member. Neil is now planning to lose the cycle race as well, but in order to fail his plan, Lakshya befriends Jannet (Evelyn Sharma) and makes Neil believe that the Australians are double crossing him. Neil realizes his fault and decides to win the race, but fatefully falls from stairs breaking his leg. Lakshya takes his place and beats Australia in round four leading to a tie between both teams. In the final round of rock climbing, a team member of both teams has to collect his respective country's flag from the hill top and race back to college in order to win the competition. After crossing all the hurdles, Lakshya manages to win the race and the college celebrates their victory. The story ends with Lakshya and Saloni, Jiya and Pardy getting together while Neil repents his deeds.","TrailerLink":"https://www.youtube.com/watch?v=w3yJS4MB85Q","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/w3yJS4MB85Q\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":6,"Rating":1.35,"CensorRating":"U/A","ReleaseDate":"1/10/2014","Runtime":145,"Budget":110000000,"Revenue":400000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/FE55FA605123B253E3561150CEB021C0.jpg"},{"Id":"7ecc8685","ImdbId":"tt3142232","OriginalTitle":"Heropanti","Title":"Heropanti","Description":"Chowdary (Prakash Raj) is a very well known and respected man in his village. He is a very strict patriarch of the Jat family consisting of four brothers – Chowdary himself, Bhuppi (Samar Jai Singh), Pappi (K. C. Shankar) and Sukhi (Prashant Singh). On the night of her marriage, Renu (Sandeepa Dhar), the elder daughter of Chowdary, elopes with her boyfriend, Rakesh. Chowdary decides to find them at any cost.\r\n\r\nChowdary and his men manage to locate two of Rakesh's friends from different places and beat them up. Chowdary and his men bring them over to his place and one of them reveals Bablu's (Tiger Shroff) name and that he might have an idea where Renu and Rakesh are. At first when Bhuppi, Pappi, Sukhi & the gang confront Bablu and attack him to find Rakesh, Bablu single-handedly beats up all of them but is hit in the head and loses consciousness.\r\n\r\nChowdhary holds Bablu and the other two friends captive till they tell of the couple's whereabouts. They tell him that they don't know anything, but no one believes them. Meanwhile, Bablu tells his friends that he is in love with a girl he doesn't know and he only has her earring which she dropped. The friends decide to flee one day, but Bablu gets a glimpse of the girl and stops in his tracks to look at her and the boys are caught because of him.\r\n\r\nBack at Chowdary's household where the friends are held captive, Chowdary's younger daughter and Renu's sister, Dimpy (Kriti Sanon) tries to ask them where her sister is, but they won't tell her. Dimpy finds Renu's love letters in her room one of which reaches her uncle. Dimpy manages to clean up everything before her uncle reaches her room. When Shalu is about to burn those letters, Dimpy's uncle asks one of his men to check it. Without thinking much she drops those letters where these boys are held captive. With the help of these letters Bablu and his friends blackmail her. However, Bablu makes a deal with her that in exchange for her sister's whereabouts, Dimpy find the girl he fell in love with. Dimpy does not agree, but later when circumstances force her, she agrees. That night, Bablu escapes and enters the house after the light fuse burns out. He drinks from the glass of Rajjo (who later turns out to be the suitor of Dimpy) and becomes drunk. Dimpy finds Bablu and he gives her the earring he found that belongs to the girl he fell in love with. To Dimpy's shock, it turns out that it was none other than Dimpy that Bablu saw that day. But Dimpy stays silent.\r\n\r\nBablu and his friends go with Chowdhary's men to town one day to search for Renu and Rakesh, where Bablu helps them to board a bus to Shimla. Dimpy's uncle, Pappi, comes to know that Bablu had helped them to flee when he accidentally overhears Dimpy. The entire group is beaten badly. When they threaten to kill one of his friends, Bablu tells them that Renu and Rakesh are in Delhi.\r\n\r\nBablu and his friends as well as Dimpy accompany her father to Delhi to find the couple. At this juncture, Dimpy is kidnapped by some local goons, who attempt to molest her. Bablu manages to locate her in time and beats up the goons, winning the trust of Dimpy's father.\r\n\r\nThat night Dimpy and Bablu go to a night club. In the morning, while Dimpy is confessing her love to Bablu, Chowdary spots Renu and Rakesh on a bus and chases after them with Bablu and Chowdary's men following close behind. They manage to stop the bus but when Renu talks back to her father, Chowdary is heartbroken. When Renu and Rakesh are about to be killed as punishment, Renu confesses that she is pregnant. Chowdary decides to spare their lives, saying to Renu, \"You are now dead to me.\"\r\n\r\nThe group returns home and Chowdary arranges Dimpy's marriage with Rajjo. He plans on conducting the marriage with pomp. Bablu realises that he misses Dimpy too much. He and his friends come back with the intention to get Dimpy to elope with Bablu. Chowdary, however, is frightened when Bablu returns, fearing that he will elope with Dimpy. He keeps a close eye on Bablu and Dimpy. When Chowdary takes Bablu outside, Bablu tells him that he understands how Chowdary felt when Renu ran way from home and promises him that he will not elope with Dimpy.\r\n\r\nWhen Bablu and his friends are about to leave, Rajjo beats up Bablu with the intention of injuring him, however Bablu fights back and defeats Rajjo in a hand-to-hand combat when Rajjo insults him and Dimpy. They are however stopped at the last moment by Chowdhary. He realises that Dimpy will only be happy if she is with Bablu, tells Bablu to take her away. Bablu and Dimpy unite with a hug.","TrailerLink":"https://www.youtube.com/watch?v=6DSQ7xQzvhU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/6DSQ7xQzvhU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"5/23/2014","Runtime":146,"Budget":210000000,"Revenue":650000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C23AB742300DA4F75833626257890256.jpg"},{"Id":"196cfbcc","ImdbId":"tt3365690","OriginalTitle":"Jaatishwar","Title":"Jaatishwar","Description":"In the present timeline, Rohit Mehta (Jisshu Sengupta), a Gujarati born and brought up in Calcutta, falls in love with Mahamaya (Swastika Mukherjee) and tries to woo her. Since he can just barely utter a few Bengali words (and that too in the wrong places), Mahamaya throws him a hurdle to cross - if he can write a song with correct Bengali lyrics and sing it without any accent or mistake, she would think of a possible relationship. Rohit accepts the challenge and goes to Portugal to study colonial history.\r\n\r\nTwo years pass. Mahamaya is now a radio jockey at a popular radio station. Rohit is in Portugal but still very much in love with her. His Bengali is being refined by his friend and classmate Bodhi (Abir Chatterjee). Rohit chooses the music course and decides to do a dissertation on the 19th Century folk poet Hensman Anthony. He goes to Calcutta and then to Farashdanga, Chandannagar, where Anthony lived and composed his songs. He goes to the local library to get some books where he meets the assistant librarian, a mysterious man named Kushal Hajra (Prosenjit Chatterjee), who claims to be the re-incarnation of Anthony himself. Kushal laments that the visions of his previous life is haunting him every day, and slowly taking over the memory of his present life. Rohit promises to take him to Calcutta for treatment, in return he demands the life history of Anthony.\r\n\r\nThe story then goes back to the 15th Century, where Anthony impresses the villagers with his musical talent. He saves a young Bengali widow, Soudamini, from performing sati and later marries her. But he yearns to learn the Bengali language and compose songs in that language. He learns it, reading Hindu scriptures and understanding the meaning of the folk compositions. In those days, kavigaans were very popular in Calcutta, where two kaviyaals or folk poets would face each other with their respective groups and compete with each other through songs and poems. Anthony was impressed by the kavigaans and decided to form a group on his own. He used to compose the songs himself, and on the first occasion met the woman kaviyaal, Joggeshwari (Ananya Chatterjee), whom he defeats. Slowly, as he began to progress in his career as a kaviyaal, he competed with noted kaviyaals of the time like Ram Basu (Sujan Mukherjee) and Thakur Singha (Biswajit Chakraborty).\r\n\r\nSimultaneously, in the present timeline, Kushal is taken to a psychiatrist, where he is informed that to stop the visions, he must complete a work which he could not possibly do as Anthony. Kushal's visions get stronger and stronger. Rohit meanwhile has found a way to sing his latest Bengali composition in front of Mahamaya, whose radio company has decided to organize a competition among bands hailing both from West Bengal and Bangladesh, \"Bandemonium\". Bodhi, who meanwhile had come to Calcutta to meet Rohit, takes him to Sidhu (playing himself) to arrange musicians for Rohit's performance. Meanwhile, Mahamaya had also started developing feelings for Rohit.\r\n\r\nKushal reveals to Rohit the story of Anthony's last kavigaan. Anthony had been planning to do a Durga-puja all by himself. But the villagers were against this, as, to them, Anthony is a firingee (foreigner) who had no right to perform a Hindu puja. He tells Soudamini that he is going to Calcutta for another kavigaan, and so won't be staying during the days of the puja. As planned, he leaves for Calcutta on the day of the puja. This time, his competition is with the best kaviyaal, Bhola Moira (Kharaj Mukherjee). The competition heightens and Anthony wins after a tough fight.\r\n\r\nIn the present timeline, the day of \"Bandemonium\" has arrived. Rohit goes on stage and performs his Bengali song E Tumi Kemon Tumi as Mahamaya looks on, tears in her eyes. Within the song, the film goes back to the 19th Century. After Anthony returned from Calcutta, victorious against Bhola Moira, he finds his house and his durga idol set on fire by the villagers. He finds Soudamini dead and nobody around. With his love killed and his faith shattered, he digs a grave for her, and then for himself (as he had once promised jokingly to his wife).\r\n\r\nDuring the show, Bodhi brings Kushal to the auditorium to see the performance of Rohit. Kushal meets Mahamaya, and then leaves abruptly. After the performance, Rohit and Mahamaya profess their love for each other backstage. Rohit suddenly is informed that Kushal is missing. He, along with Mahamaya, goes to Kushal's house in Chandannagar, where they find him completely insane and lost in his visions. He attacks Rohit and then blabbers rubbish. Rohit, heartbroken, leaves with Mahamaya, realising that Kushal is beyond cure now. The film then ends with a master twist, revealing Mahamaya as the reincarnation of Soudamini, though she remembers nothing of her previous birth. Anthony had wanted to apologize to his wife for leaving her alone to get killed by the neighbours, which Kushal does after Mahamaya leaves with Rohit. The visions will not haunt him anymore. The film ends as Kabir Suman's song \"Jaatishwar\" plays in the background","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"2/28/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E330F02608BD5D6499A50ACBA260AE84.jpg"},{"Id":"4a0dce87","ImdbId":"","OriginalTitle":"Control Bhaji Control","Title":"Control Bhaji Control","Description":"Control Bhaji Control is an upcoming Punjabi comedy film written & directed by Gaurav Singh, Produced by Real World Entertainment. The Film Stars Karan Kundra, Sangram Singh, Nachattar Gill, B.N Sharma, Upasna Singh, Simran, Sandeep, Harpal Singh, Savita Bhatti, Chandan Prabhakar, Rana Jungbahadur n others. Control Bhaji Control is expected to release[1] on 22 August 2014.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"8/22/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/75F1E9A5AE9F2FBE81E4CD5F02DD44BE.jpg"},{"Id":"9b17f682","ImdbId":"tt3684370","OriginalTitle":"Disco Singh","Title":"Disco Singh","Description":"The story follows a singer named Lattu (Diljit Dosanjh) who is in love with Sweety(Surveen Chawla), a model. When don Bhupinder Singh(Manoj Pahwa) hires Lattu to perform at a wedding which Sweety also attends, a picture of the trio is captured by a spy who was hired by Bhupinder's wife Pammi(Upasna Singh) who suspects he is having an affair. When the news of Bhupinder cheating on his wife with Sweety is published in the newspaper, Bhupinder tells Pammi that in fact Sweety is Lattu's girlfriend as he was also captured in the photo. Bhupinder's henchmen kidnap Lattu and Bhupinder tells him to pretend to be Sweety's boyfriend for the time being, in order to make his wife's suspicion go away. Whilst pretending, Sweety and Lattu enter a real relationship which soon enrages Bhupinder who decides to take matters into his own hands, leading to a hilarious climax! The Plot is somewhat inspired from the 2009 Govinda Starrer Hindi Comedy Do Knot Disturb","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"4/11/2014","Runtime":141,"Budget":60000000,"Revenue":197300000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2DC6C68C1E3C711171F632152AF792BD.jpg"},{"Id":"13ff3ef5","ImdbId":"tt4168188","OriginalTitle":"Chaar Sahibzaade","Title":"Chaar Sahibzaade","Description":"he film starts with invasions of India by Mughal and Turkish kings. Guru Tegh Bahadur (9th Guru of Sikhs) sacrificed his life for the human rights and freedom of religion of Kashmiri pandits. Then, Guru Gobind Singh founded the Khalsa to counter the invading forces with martyrdom as the fundamental principle.The film depicts the First Battle of Anandpur in which Mughal General Painde khan was killed by Guru Gobind Singh. The film also depicts the Battle of Chamkaur which took place in December, 1704 CE in which 42 Sikhs (under Guru Gobind singh) fought bravely against 10 lakh mughal forces (under wazir Khan). In the battle of chamkaur,both the elder sons of Guru Gobind Singh Sahibzada Ajit Singh 18 years old and Sahibzada Jujhar Singh 14 years old were martyred.The mughals were in large number but still they failed to capture Guru Gobind Singh and hence Sikhs defeated Mughals. The Younger sons of Guru Gobind Singh Sahibzada Zorawar Singh who was 9 years old and Sahibzada Fateh Singh who was 7 years old were taken to Wazir Khan's place and were bricked up alive.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Animation","RatingCount":21,"Rating":4.15714,"CensorRating":"U","ReleaseDate":"11/6/2014","Runtime":128,"Budget":200000000,"Revenue":700000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F2964C422C4DBDABDB2D5F7F299B5894.jpg"},{"Id":"ca068ad3","ImdbId":"tt3619772","OriginalTitle":"Hate Story 2","Title":"Hate Story 2","Description":"The film begins with an aged man entering a graveyard to lay flowers on someone's grave. He hears the noise of someone struggling in a coffin nearby. He digs into that place and opens the coffin. To his utmost surprise, he discovers a girl buried alive in the coffin. He takes the girl and admits her to the hospital. Inspector Anton Veldez (Siddharth Kher),the officer-in-charge of the case, tells the doctor to let him know as soon as she regains consciousness and asks one of his officers to stay alert in case the girl is attacked again. Interestingly, that very officer turns out to be a dishonest one and calls an anonymous person informing him of the girl being alive. He, then, secretly enters her cabin for a second attempt to kill her and this time too, by suffocation. He presses a pillow on her face and she manages to press the alarm button. This causes the nurse to rush to her cabin. The officer goes out of the cabin pretending to be unaware of the attack. Now, that the girl has become conscious, the doctor calls Inspector Anton. When Anton, along with the doctor, goes into her cabin, they find her missing. Anton, frustrated, sends his officers to look for her and himself goes to the ground floor to meet the dean. While he is waiting for the lift, he remembers the monitor in her cabin still working meaning that the girl was right there when they entered. He goes back to the cabin but the girl had already escaped. She crawls her way to the store room. The girl is revealed to be Sonika (Surveen Chawla) and is a mistress of a powerful and influential political leader Mandar Mhatre (Sushant Singh). Sonika is a photography student. Sonika is kept isolated and tortured by Mandar. She reluctantly finds comfort in her college friend Akshay Bedi (Jay Bhanushali) who secretly loves her. They both fall in love but Sonika is helpless since she can't tell Akshay about her being the mistress of Mandar. Akshay gets to know the truth and comforts her. They both move to a different home and decide to spend their lives together. They declare their love and have sex. Sonika is happy and finds some hope that she will be free from the torture that she had to tolerate. Mandar tries to find Sonika but she is no where to be found in her house. Later on he gets to know that she has eloped with her lover. Mandar and his men reach Akshay's house and attack him. Sonika cries and pleades Mandar to leave Akshay but he refuses to. Mandar's men kill Akshay by tying him to a rope and throwing him in a lake in a car. Mandar also buries Sonika alive in a coffin. After she is rescued she vows to extract vengeance upon Mandar for murdering Akshay and for herself.She at first kills the police officer who tried to kill her.Then she writes a diary describing her torture. She dives inside the same lake and puts it in the car. She then kills one of the three men who were involved along with Mandar in killing Akshay. After that, she informs Anton about Akshay's dead body. However even though Anton gets hold of Akshay and the diary Mandar makes it look that Sonika killed Akshay. Sonika then again manages to put everything in right order and kills the another man of Mandar involved with Mandar in killing Akshay. Then Sonika teams up with Mandar's arch rival and get hold of the third man of Mandar involved in killing Akshay. However all of a sudden Mandar himself kills that person. It is revealed that the archrival had becomes partner after Mandar offered to share his seats with him in election. Mandar makes it look that Sonika did it and thus police officer catch her. However she manages to escape with Anton's help. Then Sonika kills Mandar with Mandar's wife's help (who came to know about Mandar's wrongdoing accidentally).","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":9,"Rating":2.1,"CensorRating":"A","ReleaseDate":"7/18/2014","Runtime":130,"Budget":118000000,"Revenue":256000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8610E7D9749BB7999D9435FA62F0EB24.jpg"},{"Id":"609e546e","ImdbId":"tt3539966","OriginalTitle":"Dishkiyaoon","Title":"Dishkiyaoon","Description":"Viki (Harman Baweja), a gangster, narrates the story of his life to Lakwa (Sunny Deol), a criminal, whilst being locked up somewhere. Born in the upper middle class society, Viki had no mother and his father had no time for him. The cold loneliness of Viki’s world left him weak and tainted from within. Absence of love and care pushed Viki to find acceptance in other places. One such place was just a road away from his plush apartment - THE GANGSTER‐LAND.\r\n\r\nViki finds love and acceptance where bullets don't warn before firing. Interpersonal relationships are complex, situations are twisted. Ambitions break free, as Viki sets his eyes on the top spot in THE GANGSTER-LAND. He backs himself to de‐throne the existing king. Where people use might, Viki uses his mind. A game of dice begins. Each throw unfolds deception, double‐cross, uncertainty, mystery and shock. It all comes down to one final throw of dice and Viki must roll a six to win.\r\n\r\nGiven a choice between ambition and revenge, only a deadly mind would pick both. Viki picks both. Big dreams, big cost. Actions have consequences. A gunshot doesn’t discriminate, it makes the same sound for every ear - DISHKIYAOON.","TrailerLink":"https://www.youtube.com/watch?v=I1fhdUuoBAI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/I1fhdUuoBAI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"3/28/2014","Runtime":119,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E88F12F7F7BC8E8D8087B7465F8F414E.jpg"},{"Id":"41080df4","ImdbId":"tt3542028","OriginalTitle":"Chal Bhaag","Title":"Chal Bhaag","Description":"Chal Bhaag is a comedy plus action Bollywood movie directed by Prakash Saini and presented under the banner of Alimoh Films. It was produced by Mohammad Zaheer Mehdi, Fatima Zaheer Mehdi, Ali Mehdi and Tamkanat Ali Mehdi. The story synopsis is as follows...\r\n\r\nChal Bhaag revolves around three men, Munna, a self proclaimed goon, Bunty, a small time thief and Daler, an outcast. The film kick starts with an MLA being murdered by three shooters, putting the police force under pressure. The incident coincides with the arresting of Munna Bunty and Daler for their small time crimes. The shooters belong to a dangerous don who has the police inspector under his thumb. He threatens the police inspector to let go off his men. The inspector, under the don's pressure, frees his men and replaces them with Munna, Bunty and Daler. The story takes a sharp turn and turns into a fake encounter plot. How Munna Bunty and Daler get themselves out of this situation is to watch.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"6/13/2014","Runtime":111,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D032E4798D61A9F54F489E843523EB14.jpg"},{"Id":"61c98be5","ImdbId":"tt3683702","OriginalTitle":"Fugly","Title":"Fugly","Description":"Dev, Devi, Gaurav and Aditya are close friends. Gaurav is the son of CM of Haryana, while the rest of his friends are commoners. Gaurav is isolated from the politics his family is into and is the only educated person in his family. Gaurav is nice hearted, but always high on adrenaline because of his influential father. He has a knack of getting into trouble with police because of this attitude, but the police always ignore his pranks. A local grocer or Nunu has an evil eye on Devi and one fine day gropes her in his shop. The four of them decide to teach him a lesson. At night they break into his shop and trash him warning him not to see her again. Although outnumbered and in bad state Nunu challenges them to leave Devi behind for him. Dev is very angry and decides to teach him a lesson. They put him in their car's trunk and drive him to an isolated location. They are intercepted by Inspector R.S. Chautala who is patrolling the highway. Gaurav as usual tries to act smart and gets involved in a scuffle with Chautala. This enrages him and he suspects foul play. When he checks the car he discovers Nunu inside the trunk. Chautala kills Nunu in order to frame them in his murder case. In the morning after severe threat he puts up a demand of Rs. 61 lakhs of ransom money, which they have to arrange in 24 hours. Gaurav is afraid to tell his father about the incident because he was actually involved in kidnapping of Nunu, since this would cost his father his CM chair. Somehow everyone is able to arrange 24 lakhs.\r\n\r\nChautala further blackmails them by recording them handing over the money to him, as an evidence of attempting to bribe a policeman. He gives them 3 more days to arrange for the money with additional Rs. 10 lakhs as penalty. The four of them are further forced to arrange a rave party with a drug dealer, which is again raided by Chautala. He forces them into drug dealing as well to extract more juice out of them. The four of them decide that they had enough and want to expose him in a sting operation. They almost succeed in extracting confession out of him on camera, but are busted and Chautala also kidnaps Devi. Chautala outsmarts them on every step and four of slip deep into trouble with every step they try. Finally the are arrested on false charges and meanwhile out on bail.\r\n\r\nDev in the end decides that he has to sacrifice his life to expose truth. The next scene we see Dev in hospital and his narration is interrupted by Chautala once again. He clears up the ICU room of everyone to have a private moment with Dev. Dev tricks him by cutting off his own life support and getting into a scuffle with Chautala. As the medics and reporters rush into the room, they find Dev dead and it appears as if Chautala has killed him. This is telecast live on the news. Next we see Chautala meets Gaurav's father in an isolated region. Chautala true to his colour again attempting to blackmail the CM and he shot dead by his colleague.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"6/13/2014","Runtime":134,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AA23118F359FCE8ED04064C64FF2C408.jpg"},{"Id":"bba28f3a","ImdbId":"tt3449320","OriginalTitle":"Darr @ the Mall","Title":"Darr @ the Mall","Description":"Asia's largest mall is ready for inauguration, although there is controversy surrounding the recent deaths of construction workers and mall staff, leading the media to label the mall as haunted. Vishnu (Jimmy Shergill) is mysteriously recommended for the job of chief security officer on the eve of the inaugural party.\r\n\r\nOn the night of the party, the owner of the mall Mr. Manchanda (Arif Zakaria) and his associate, Mr. Khan's children, Ahana and Naveed along with their friends are also at the party. One by one, a ghostly apparition targets the teenagers and mall investors, meanwhile Vishnu slowly uncovers clues about the identity of the ghost.\r\n\r\nAs the party ends, Mr. Manchanda, Mr. Khan, their children and Vishnu along with the mall's event manager find themselves locked inside after all the guests have gone home. The six of them struggle to stay alive as the ghost continues its killing spree.\r\n\r\nThrough a flashback the ghost of a child reveals to Vishnu, that the mall was built over what used to be an orphanage, that burned to the ground two decades ago. Vishnu’s connection to the killings is that he was one of the orphans living with the nun and other children at the orphanage.\r\n\r\nMr. Manchanda and Mr. Khan tried to get the nun to sell the orphanage, but when she refused, they had the orphanage burnt down. Vishnu (known as Arjun as a child), managed to escape but due to an injury he lost his memory of what transpired.\r\n\r\nThe horrific smokey apparition is the ghost of the nun who kills all those involved in the crime. The ghosts of the dead children play their part in the killings as they simultaneously warn, befuddle and scare the people within the mall killing not only those involved but guiltless people as well.\r\n\r\nAfter the nun kills Mr. Manchanda, she also attempts to kill Ahana, till Vishnu begs the nun to stop as she has already killed the men responsible. The movie ends with the nun sparing Ahana, and she and Vishnu are shown walking out of the mall.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"2/21/2014","Runtime":124,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A6F4E7272D078838815079FB8B9F9EC2.jpg"},{"Id":"956c72f4","ImdbId":"tt3322420","OriginalTitle":"Queen","Title":"Queen","Description":"Rani Mehra (Kangana Ranaut) is an under-confident young Punjabi woman from Delhi.[12] One day prior to her wedding, her fiancé Vijay (Rajkummar Rao) tells her that he no longer wishes to marry her. He explains that his lifestyle has changed after living abroad, and her conservative habits would be a wrong match for him. Stunned at the development, Rani shuts herself in her room for a day. Wanting to take control of the situation, she asks her parents permission to go alone on her pre-booked honeymoon to Paris and Amsterdam. After initially hesitating, her parents agree, thinking that a vacation might cheer her up.\r\n\r\nIn Paris, Rani meets Vijayalakshmi, who also calls herself Vijay (Lisa Haydon), a free-spirited woman of French-Spanish-Indian descent, who works at the hotel in which Rani stays. Overwhelmed by the new city and having gotten into trouble twice - once with the local police and once with a robber - Rani intends to return to India. However, Vijayalakshmi helps her out and gives her a tour around the city. The two have a series of adventures, during which Rani relives the memories of Vijay patronising her and forbidding her from dancing and drinking - which she's free to do in Paris. During one particular incident, Rani tries on what she considers to be a revealing outfit and accidentally sends a selfie of her wearing the outfit to Vijay instead of Vijayalakshmi. She quickly realises her mistake, but unbeknownst to her, the selfie prompts Vijay to begin searching for her.\r\n\r\nEventually, the time comes for her to bid an emotional farewell to Vijayalakshmi and board the train for Amsterdam. However, when she arrives in Amsterdam, she finds to her horror that her hostel room is being shared with three guys: Taka from Japan, Tim from France and Oleksander from Russia. Despite being skeptical of the boys, she soon becomes good friends with them, and spends time shopping, sight seeing, visiting a sex shop, and meeting pole dancers in a club. At the club, Rani befriends a pole dancer, Roxette/Rukhsar, who is also a friend of Vijaylakshmi.\r\n\r\nRani slowly begins to gain confidence by taking control of her decisions. She also realises her cooking potential by winning a cook-off by selling gol gappas (an Indian street snack). She learns more about her friends' backgrounds and begins to understand how different life can be for people in other parts of the world. One day, the four find Vijay waiting for Rani in front of the hostel. Vijay apologizes to Rani and asks her to reconsider the relationship. Their conversation escalates as he tries to grab hold of Rani, but her friends retaliate, and she asks him to leave. The two meet up the next day to discuss the future, but Rani leaves abruptly, saying that she would rather speak to him after she returns to Delhi. She then meets up with her friends one last time at a rock concert she had previously chosen not to attend. After bidding an emotional farewell to them, Rani returns to India.\r\n\r\nBack in Delhi, Rani visits Vijay at his home. Vijay thinks that she has decided to forgive him. Instead, Rani hands him her engagement ring and after saying \"thank you\", she walks away with a smile on her face.","TrailerLink":"https://www.youtube.com/watch?v=KGC6vl3lzf0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/KGC6vl3lzf0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":18,"Rating":4.23611,"CensorRating":"U/A","ReleaseDate":"2/27/2014","Runtime":146,"Budget":125000000,"Revenue":780000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/780D99C09D47D72577D475DFB5F7F6D2.jpg"},{"Id":"7f0fcce3","ImdbId":"tt3173910","OriginalTitle":"Hasee Toh Phasee","Title":"Hasee Toh Phasee","Description":"Nikhil (Sidharth Malhotra) is a struggling businessman whose girlfriend Karishma (Adah Sharma) is an actress. Nikhil is a guy who believes that once you are committed to a girl, there should be no straying. Karishma asks Nikhil to arrange ₹50 million (US$750,000) before marriage, which is 7 days later, to earn a contract.\r\n\r\nIn the mean time, Nikhil meets Meeta (Parineeti Chopra), Karishma's younger sister, with whom he had a brief encounter 7 years ago. Meeta, who is an IITian in Chemical Engineering and PhD., is a super intelligent geek with unusual behaviour and habits, who ran away 7 years ago to China after stealing money from her own father, leading to his heart attack. Now, just a week before Nikhil and Karishma's wedding, Meeta turned up to meet her father, but Karishma was scared that her sister's sudden appearance might ruin their wedding. Hence, Karishma assigns Nikhil to keep Meeta away from her father (Manoj Joshi).\r\n\r\nMeeta has returned with an intention to steal again but her involvement with Nikhil during the next 7 days diverted her attention. During these 7 days, with many personal and social activities, both Nikhil and Meeta generate feelings for each other, but Nikhil backs off as he doesn't want to betray Karishma. Meanwhile, Nikhil comes to know that for her research Meeta has taken a heavy loan of ₹100 million (US$1.5 million) from a Chinese investor by forging her father's signature. The deadline for payback was over and an extension of three days was given during which she has to steal money from her father's account to save him from the investor's goons. Nikhil helps Meeta to hack her father's account but advises her to apologize to her family. Meeta reunites with her family and later Nikhil understood that he is marrying the wrong girl.\r\n\r\nMeeta couldn't gather the courage to steal her father's money and tells her father everything about her research and the loan amount along with her real intention to return which was to steal money. Her father forgives her and provides her the money. On the other hand, Nikhil recalls the time he spent with Meeta and tries to meet her. Meeta who had already moved to her father's house could not be contacted as her family members, who were under the impression that Nikhil wanted to meet Karishma, stopped him as he seemed clingy. Later, Nikhil talked with Meeta on the phone during which he conveys that he should have gone with her to Goa, when she asked him to come with her during her stealing stint 7 years ago. Meeta tells him that it is not too late for them to run away to Goa.\r\n\r\nIn the night, when Nikhil comes to Meeta's house with a motive to run away with her, he sees the happy faces of Karishma with her family from a distance and realizing the complications, returned to his home. Meeta calls Nikhil to her house late night and Nikhil meets her on the terrace of her house. Nikhil scolds Meeta when she offered to run away with him. Nikhil says that he is an emotional fool and cannot torture Karishma even though Karishma had emotionally tortured him throughout his life. Nikhil leaves her and later repented for his actions.\r\n\r\nOn the wedding day, Meeta leaves her house after silently returning the mobile phone inside Karishma's room and did not contact anyone as she does not want to be stopped. Nikhil tries to contact her but her phone was inside Karishma's room in vibrate mode. He also sent many messages all of which went unnoticed. He gets ready for the wedding although he is not very enthusiastic about it.\r\n\r\nWhen Nikhil reached Meeta's house for his wedding with Karishma, Meeta's father informs Nikhil that Meeta has left silently, knowing fully well that Meeta left because Nikhil was marrying someone else. Nikhil tries to contact her again but is unknown to the fact that Meeta has returned the phone that Karishma had given to her. Karishma notices the phone, reads the messages and realizes that she had lost Nikhil. She asks Nikhil to run away from the wedding which he obliged with her father fully supporting her decision. Meanwhile, Meeta could not gather the courage to leave Nikhil and returned to the wedding for a last effort to win him back. When Nikhil was running away from the wedding ceremony he finds Meeta standing outside. Finally, both express their love towards each other.\r\n\r\nThe movie ends with Nikhil and Meeta at an airport, scheduled to travel to Germany, where Meeta tells him that there is another problem waiting for them there.\r\n\r\nCast[edit]","TrailerLink":"https://www.youtube.com/watch?v=Xv5MG0LhaP4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Xv5MG0LhaP4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.45,"CensorRating":"U/A","ReleaseDate":"2/7/2014","Runtime":141,"Budget":250000000,"Revenue":620000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3034385AF613C195220161185D7E913C.jpg"},{"Id":"9739e659","ImdbId":"tt3056632","OriginalTitle":"Manjunath","Title":"Manjunath","Description":"Today’s hinterland of Uttar Pradesh and state-of-the-art campus of the Indian Institute of Management Lucknow (IIM-L), India, 'Manjunath' is the story of a 27-year-old man, Manjunath Shanmugam. After passing out from the IIM, Manjunath joins a petroleum company as a sales officer. He is posted in Lakhimpur Kheri, a remote district in rural Uttar Pradesh. One day Manjunath goes missing. His friends, who know and work with him, panic, because they know that off late he had been very disturbed and was behaving very strangely. He had become very serious and scared. And this was very different from the Manjunath they knew in college, who was always jovial, fun-loving, very friendly and a great entertainer.\r\n\r\nOne of his friends finds him, but Manjunath appears very frantic. They send him back to his hometown. Manjunath's parents try to convince him to leave his job at Bharat Oil that seems to be causing him stress. Initially he seems willing but slowly he realises that he doesn't want to be quitter. Manjunath believes that, being from a top institute in the country, he is one of the cream 5% who has been given the opportunity. Being the eldest son of a mineworker, he has had a humble upbringing. He realises that the kerosene being mixed with diesel, is coming from ration shops – 'it's the poor people's kerosene'. In addition, he also becomes conscious of the extent of pollution caused by burning adulterated fuel. He finds strength and comes back to fight, against his parents wishes.\r\n\r\nNow we realise why he was under so much stress. There is a clear threat to his life, because he insists on doing his duty to stop petrol adulteration. But this time, Manjunath is not deterred. He continues doing what he considers right, without worrying about the consequences. As a result of this, one night he gets brutally killed by the people who are getting harmed by his doing his duty. His family and friends suffer, cry at his death. Why? They wonder… Why he put himself in so much danger… The question still remains. Is he a failure or a success?\r\n\r\nSlowly, the worst fears start coming true. Beyond the initial grief, no one wants to come forward to carry on the fight.\r\n\r\nIn the film, Manjunath is shown watching what happens after he dies. We see him starting to feel that it is all pointless. And he cannot watch his parents' tears any more… after all, what was their fault? Maybe he should have compromised. But how can people not see what he has? That what he fought was something very big and very important.\r\n\r\nSuddenly, like a bolt from the blue, people unrelated to him, who have no connection to him, start to realise the importance of what Manjunath did, and start trying to do something. Like novices, they search their way around, but their will is strong. They start getting help again from unexpected quarters. It is nerve-wracking, with dangers for everyone who is helping them. But suddenly, instead of one or two, there are a lot people helping them. Manjunath, who has lost hope, realises that it's not all going waste.\r\n\r\nHe hopes and prays that they succeed.","TrailerLink":"https://www.youtube.com/watch?v=7nPY6O8XDv8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/7nPY6O8XDv8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":15,"Rating":3.6,"CensorRating":"U/A","ReleaseDate":"5/9/2014","Runtime":130,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/042AF9B9F4B2FCDA9BDE5FFA6DAF78BF.jpg"},{"Id":"f0c6c51a","ImdbId":"tt3554418","OriginalTitle":"Khoobsurat","Title":"Khoobsurat","Description":"A hopelessly romantic physiotherapist (Sonam Kapoor) falls in love with a Rajput prince (Fawad Khan) who is not only her complete opposite but also is engaged to someone else.","TrailerLink":"https://www.youtube.com/watch?v=1em8DBrqCck","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/1em8DBrqCck\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.25,"CensorRating":"U/A","ReleaseDate":"9/19/2014","Runtime":130,"Budget":247500000,"Revenue":394700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9B0962707B21DB66368C26EEEFA4FC76.jpg"},{"Id":"ce7ab6b6","ImdbId":"tt3619854","OriginalTitle":"Creature","Title":"Creature","Description":"Ahana (Bipasha Basu) opens a hotel in Glendale, Himachal Pradesh. During the day of the opening party, she meets Kunal Anand (Imran Abbas), a novelist, and they become attracted to each other. When a couple and the hotel cook are killed by an unknown creature, Kunal decides to help Ahana. Romance culminates between Ahana and Kunal and they consummate their relationship. After a few peaceful days, the creature strikes again and wreaks havoc in the hotel; Ahana finds herself facing off against a ten-feet long creature with the legs and tail of a dinosaur, and the body and head of a human. Professor Sadanand (Mukul Dev) scares off the creature with a burning log.\r\n\r\nThe next morning, the injured guests and hotel staff get evicted by police. The professor explains that the creature is a Brahmarakshas, a man-eating mutant which is the result of Lord Brahma, the Hindu god of creation, cursing demons to become such creatures with no salvation, eternally condemned to roam on earth and suffer. Brahmarakshasas still lurk in dense forests of India, but their sightings are as relevant as sightings of UFOs. He suggests Ahana and Kunal to leave if they wish to stay alive. Ahana refuses to leave the hotel, determined to fight back.\r\n\r\nAhana, Kunal and the professor are joined in the fight by two cops, Inspector Rana (Deepraj Rana) and Inspector Chaubey (Bikramjeet Kanwarpal), but the Brahmarakshasa kills Chaubey. They learn that a Sarpanch filed a report of a Brahmarakshasa sighting a few years back and go to meet him. He tells them that decades ago, a hunter killed a Brahmarakshasa, and the only person who can help them now is Dr. Moga, the son of the late hunter. Kunal and Ahana set for Shimla to meet the doctor. On the way, Kunal reveals his true identity as Karan Malhotra, the chairman of the builder group that compelled Ahana's father to commit suicide. He tells her that he felt guilty and wanted to apologize. Heartbroken, Ahana breaks up with Karan.\r\n\r\nDr. Moga explains that Brahmarakshasa can be killed by a weapon dipped in the temple pond of the Brahma Temple in Pushkar but is effective only if dipped into the pond on a special night. Since time is short, Dr. Moga gives Ahana an old rifle with which his father had killed a Brahmarakshasa. Ahana, the professor, and Rana enter the den of the Brahmarakshasa; Rana and the professor are killed by the beast, and when it tries to attack Ahana, Karan saves her. With Karan's help, Ahana manages to kill the creature with the last bullet in the rifle.","TrailerLink":"https://www.youtube.com/watch?v=kqER_Qt2_2g","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/kqER_Qt2_2g\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":7,"Rating":1.6,"CensorRating":"U/A","ReleaseDate":"9/12/2014","Runtime":134,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6CC29EF493B3A63CCB547B43017D975D.jpg"},{"Id":"f16bf3c1","ImdbId":"tt4020624","OriginalTitle":"Lingaa","Title":"Lingaa","Description":"The story starts up with a flash back where in Raja Lingeshwaran(Rajinikanth) is a rightful heir to a famous dynasty that once ruled most parts of Southern India. Natives of that village follow whatever Raja Lingeshwaram says. Because of his urge to help the poor, his nobility makes him gain that priceless love of those villagers.\r\nRaja Lingeshwaran takes up the initiative and requests the Britishers to build a much needed dam that would serve well for the people. But his idea is opposed citing a political reason and hence he leads from the front and inspires each and every villager to take up the responsibility to build a dam for themselves without seeking help from the foreigners.\r\nAnd then movie comes to present, son of Raja Lingeshwaram, Lingaa goes back to the same village to avenge and fight for the villagers’ right who are still being treated like animals. How he completes his task at hand with the help of his friends forms the remaining story to be watched in big screen.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":2,"Rating":1.25,"CensorRating":"U/A","ReleaseDate":"12/12/2014","Runtime":174,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/77611B2FF3B983F287BBB7203C6FA4B8.jpg"},{"Id":"f584fb26","ImdbId":"tt2954770","OriginalTitle":"Ajoba","Title":"Ajoba","Description":"Big Cat’s, Big Adventure. Malshej to Mumbai in 29 days: Ajoba the leopard’s ambitious trek. Ajoba was rescued from a well and a tracking device was fixed on his neck, before being released back into the wild. He turned out to be one adventurous cat, as he made his way to Mumbai over the Sahyadris, i.e. A cool 120 km.\r\n\r\nAjoba trailer goes viral on the internet on 1 June 2013","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/9/2014","Runtime":115,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B96C78A5DCDE395EEF01551B15BD41AE.jpg"},{"Id":"440700a4","ImdbId":"tt3841400","OriginalTitle":"Burma","Title":"Burma","Description":"Burma is a 2014 Tamil crime thriller directed by DDharani Dharan and produced by Sudharshan Vembutty under the banner Square Stone Films.[1] It features Michael Thangadurai and Reshmi Menon in the lead roles, while Sampath Raj, Atul Kulkarni, Karthik Sabesh and Madhu Raghuram play supporting roles.[2] The music was scored by Sudharshan M Kumar, while cinematography and editing were handled by Yuva and Vivek Harshan.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"9/12/2014","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/05077215738DE6D552949890173D05F5.jpg"},{"Id":"9c9a54e0","ImdbId":"tt3640942","OriginalTitle":"Koyelaanchal","Title":"Koyelaanchal","Description":"Koyelaanchal unveils itself through Saryu Bhan Singh (Vinod Khanna), an ex-owner turned Mafioso of the region, who through his sheer brutality & blatant defiance of law of the land, forces the people & the authorities to acknowledge him as their ‘maalik’. Any protest, any voice of dissent against him is dealt with spine chilling violence of epic proportions.\r\n\r\nThings get a bit difficult to handle for Saryu Bhan Singh when an upright District Collector Nisheeth Kumar (Sunil Shetty) takes charge of the region and starts asking him questions that no one dared ask him before. Caught amidst labor revolts & naxal uprisings, the last thing Saryu Bhan Singh wanted was to make enemies with the top government officer of his region. He sends his most lethal human weapon, Karua (Vipinno) to scare Nisheeth Kumar off to silence.\r\n\r\nBut the mission don’t-kill-just-scare-him goes horribly wrong when Karua ends up fatally injuring Nisheeth’s wife and in the process of escape, ends up carrying Nisheeth's infant also, thus abducting the child. What happens hereafter tells a thrilling & heart-rending story of how the real power doesn’t always flow through the barrels of guns but through the tender touches of a child, love of a mother & heartfelt prayers of the hapless millions.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":10,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"5/9/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/888622EF047BC9766B6AE182D069104F.jpg"},{"Id":"b95b229a","ImdbId":"tt4219300","OriginalTitle":"Gollu Aur Pappu","Title":"Gollu Aur Pappu","Description":"Gollu Aur Pappu is a 2014 Indian film directed by Kabir Sadanand and featuring Vir Das, Sandeepa Dhar, Dimple Kapadia, Kunaal Roy Kapur and Deepak Tijori in pivotal roles.\r\nTwo innocent brothers are assigned a mission by a terrorist to detonate a bomb.","TrailerLink":"https://www.youtube.com/watch?v=sDN_-TmJPPc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/sDN_-TmJPPc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":9,"Rating":2.1,"CensorRating":"U/A","ReleaseDate":"11/21/2014","Runtime":112,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BB14DBED1113D4BD0355A54C776515F2.jpg"},{"Id":"b79923c5","ImdbId":"tt3290688","OriginalTitle":"Revolver Rani","Title":"Revolver Rani","Description":"In the hostile territory of Chambal, the land of rebels, politicians, bullets and blood, you either live by the gun or die by the gun. Revolver Rani is set in this hostile world where there are no friends; only fragile alliances and deadly enemies that aim straight for the head. But sometimes you do not need to take lives to finish your enemies. Sometimes you just need to go for their heart. Revolver Rani is a satirical and unusual love story set against the backdrop of politics. It's about Alka Singh (Kangana Ranaut), the leader of a political party and her obsessive love for Rohan Mehra (Vir Das), a rising star of Bollywood.\r\n\r\nThe elections in Gwalior have just finished and Alka's reign has come to an end. Her opposition, the Tomar party, have come into power and want to use their new position to take out Alka, but first, they want to hurt her. The Tomars abduct Rohan from Mumbai and take him back to Gwalior with the aim to kill him. They are about to pull the trigger when Revolver Rani turns up, all guns blazing and saves his life.\r\n\r\nThis film attempts to show viewers what would happen if a political giant fell in love with a Bollywood star and then had to protect him from her enemies.","TrailerLink":"https://www.youtube.com/watch?v=tMlQpGNZz1E","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/tMlQpGNZz1E\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.45,"CensorRating":"U/A","ReleaseDate":"4/25/2014","Runtime":132,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/40B81D5E59B0D1DEE592A02C7CF91FF8.jpg"},{"Id":"24beecf6","ImdbId":"tt3038772","OriginalTitle":"Kaanchi: The Unbreakable","Title":"Kaanchi The Unbreakable","Description":"Kaanchi: The Unbreakable is a romantic 2014 Hindi-language Indian feature film produced and directed by Subhash Ghai, starring newcomer actress Mishti and Kartik Tiwari in lead roles supported by veteran actors Rishi Kapoor and Mithun Chakraborty.\r\n\r\nKaanchi is a story of the inner power of a woman who represents over one million suppressed youth against injustice in the country.[8] It is also the story of an innocent rural beauty and her fight against power.[9] The film was released on 25 April 2014","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"4/25/2014","Runtime":151,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A4D46491D7AB19D8034D520E54CC4A75.jpeg"},{"Id":"35f87e91","ImdbId":"tt3483646","OriginalTitle":"Bewakoofiyaan","Title":"Bewakoofiyaan","Description":"Mohit Chadha (Ayushmann Khurrana) learns how to drive a car on the morning of his promotion from Junior Executive in Marketing to Senior Executive. He goes for lunch with Mayera (Sonam Kapoor) after the promotion, where he proposes to her. Meanwhile, Mayera's father, V.K. Sehgal (Rishi Kapoor), is transferred to Animal Husbandry. V.K. Sehgal does not approve of their wedding, as he thinks Mohit would not be able to provide for her and give her happiness. V.K. goes to Mohit's office and challenges him: if he passes a test, then he can marry Mayera. He calls Mohit to the club everyday to play squash. V.K. gets a retirement gift from all his staff.\r\n\r\nWhen V.K. sees on the news that Mohit has lost his job, he visits Mayera's office to see if it is true. Mayera calls Mohit, and, not being there, Imi picks up his phone and talks to her. Mayera fakes talking to Mohit in front of her dad and acts like his job is safe. Mayera goes to his office, where she sees him give a interview and pulls him away. V.K. inquires about Mohit from the police about criminal cases. Mayera emails Mohit a list of vacant jobs. He gives interviews at different places but is rejected everywhere. When he is at an interview, Mayera's father calls and says he is coming to Mohit's office. When Imi distracts him, Mohit quickly goes the other way, reaches another cubicle, and leaves to have lunch with V.K., where V.K. shows him his criminal case list. Mohit does not have money to pay for lunch, and V.K. pays, but because his card is not working, he is unable to return money. Mohit receives calls from everywhere to return money; he calls Mayera and she gives him ₹50,000.\r\n\r\nThe next night at Mayera's birthday, Mohit greets her with a kiss. Next day, when Mohit asks Mayera for money for his apartment. She does not have it, and they have a fight. Mohit sells his car, gives Mayera her money back, and they break-up. The same day, V.K. calls Mohit and Mayera, as he got a interview call and engagement rings; V.K. learns that he is jobless. Mohits leaves his apartment, rents a smaller place, and joins a cafe. Meanwhile, Mayera accepts a Dubai transfer and goes there for a week. When she returns, she shows her dad their new apartment and takes out their passports. He goes to Mohit's old office and asks Imi where he is. Imi takes him to the car garage manager, who takes them to the cafe. V.K. visits the cafe and orders food cheaply. V.K. tells Mohit that Mayera is going to Dubai. Back at home, their maid, Radha starts crying. Mohit goes to their house and screams out for Mayera; V.K. lectures him, and Mohit tells V.K. that he is being uncool. Mayera tells her dad that it is enough, and Mohit is a National Level under 16 silver medalist in squash but still kept losing to V.K. She tells him that she does not have fun shopping without him because there is nobody to say, \"Very Hot, Khaa Jau Tere Ko\". V.K. prepares for the interview in a suit with four pockets, then changes clothes, and goes to Mohit's apartment to get a tie. The couple go to the coffee shop, where V.K. comes back as the CEO of the company.","TrailerLink":"https://www.youtube.com/watch?v=w5CB2uYyhIU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/w5CB2uYyhIU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.7,"CensorRating":"U/A","ReleaseDate":"3/14/2014","Runtime":119,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/CB5F325EF75420AB8E030D912E6CD366.jpg"},{"Id":"9041ac59","ImdbId":"tt3302962","OriginalTitle":"Shaadi Ke Side Effects","Title":"Shaadi Ke Side Effects","Description":"Siddharth (Farhan Akhtar) and Trisha (Vidya Balan) are a happily married couple until Trisha gets pregnant and things start getting complicated. Sid is not ready for a baby as he is just a struggling music composer, yet lies to Trisha. On his friends' advice, Sid starts reading pregnancy books and following Trisha's daily routine by putting a balloon in his shirt. Finally, Trisha gives birth to a baby girl and starts devoting all her time to the baby. Trisha's mother (Rati Agnihotri) feels that Sid is a careless person and can not take this responsibility, at which Sid makes a desperate attempt to behave like a family man but fails, as on one occasion he takes his baby for a walk but forgets her in the market. Frustrated, Sid ask for help from Trisha's brother-in-law Ranveer (Ram Kapoor), who is a typical family man. Ranveer reveals to him that when he gets frustrated, he makes a business trip excuse and stays in a hotel room to enjoy his life as a bachelor. Sid takes on his idea and starts staying in a hotel, with the excuse of working overnight in studio. But soon he has to cut down his idea, due to an added expense at home as Trisha decides to hire an expensive governess (Ila Arun). Sid, then, without telling Trisha, goes for a cheaper solution by shifting to a shared PG along with Manav (Vir Das), a dope-head bachelor. Sid takes Manav's advice and starts living a carefree life.\r\n\r\nThen enters Shekhar (Purab Kohli), a young neighbour, who saves the baby when she gets locked in and thus frequently comes to meet Trisha, which makes Sid jealous. Sid realises the value of his family when Manav is hospitalised and none of his family or friends are around to take care of him. Filled with guilt, Sid confesses the PG secret to Trisha, who in anger throws him out. Sid seeks Ranveer for advice, only to discover that Ranveer is having an affair. Ranveer confronts Sid by telling him that he has also cheated Trisha by devoting time apart from his family. Sid realises his mistake & after repeated apologies by Sid, Trisha reveals that she also got involved with Shekhar and is now pregnant. Sid rushes out of the house along with the baby and later he realises that he should forgive Trisha for their child and also because all these happened because of him and thus forgives Trisha. To which Trisha surprises him by telling that she is not pregnant with Shekhar's child but with their child. Sid and Trisha reunite and start living a happy family life along with their baby.\r\n\r\nTowards the end Sid is in the park playing with their two children and giving \"Fatherhood Notes\" to other fathers in the park. He calls Trisha to give her the good news that a music company has finally asked him to compose a song for their album. Trisha is now a working woman and tells Sid that she will be late because of a deal which needs to be completed. Sid says that he is fine to look after the kids till she returns. As the camera pans out, it shows Trisha relaxing in a hotel room with a glass of wine.","TrailerLink":"https://www.youtube.com/watch?v=Iu18_rNpTA0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Iu18_rNpTA0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":12,"Rating":2.8,"CensorRating":"U/A","ReleaseDate":"2/28/2014","Runtime":145,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E1BF1C328F52341B7D177242A56C93E0.jpg"},{"Id":"d36c96ed","ImdbId":"tt3531604","OriginalTitle":"Gang Of Ghosts","Title":"Gang Of Ghosts","Description":"A story about a group of ghosts who have lost their shelter due to urbanization. The story starts with a struggling wannabe director who somehow crosses paths with a stranger. The stranger starts to narrate a story to him about a group of ghosts that stays together. The story that the stranger narrates shows the communal, social, linguistic and historical differences among the ghosts, as they belong to different eras. But very soon these ghosts face an issue protecting their haunt from the hands of demolition.","TrailerLink":"https://www.youtube.com/watch?v=GiQ-rkCPRNc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/GiQ-rkCPRNc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"3/21/2014","Runtime":128,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E23C778A04D1614DC163E01073362FD0.jpg"},{"Id":"b8dbc674","ImdbId":"tt2929690","OriginalTitle":"Margarita, with a Straw","Title":"Margarita, With A Straw","Description":"Laila (Kalki Koechelin) is a wheelchair bound teenager with cerebral palsy. She is a student at Delhi University and an aspiring writer who writes lyrics and creates electronic sounds for an indie band at the university. Laila falls for the lead singer of the college band and is heartbroken when she is rejected. But she soon overcomes this phase, when she gets a scholarship for a semester at New York University and moves there with her mother (Revathy). Living in Manhattan, she meets an attractive young man named Jared (William Moseley) in her creative writing class, who is assigned to help her in typing. She also meets the fiery young activist Khanum (Sayani Gupta), a blind girl of a Pakistani and Bangladeshi descent, whom she later falls in love with. As she embarks on a journey of sexual discovery, she figures out she is bisexual, as she still feels attracted to men like Jared in spite of being with Khanum. Laila's mother believing the two are like best friends and oblivious to the fact that Khanum is her daughter's lover, invites her to Delhi to spend the winter break with the family. It is during that time that Laila finally finds the courage to tell her mother about her sexuality and her actual relationship with Khanum, which her mother initially disapproves. After a short while Laila's mother falls sick and she learns that her mother had fourth stage colon cancer which has fallen into relapse after previous treatments. Later Laila and her mother patch up and come to terms with each other. After her mother dies Laila plays a recorded speech at her mother's funeral telling how much she loved her and how she was the only one who ever understood her. The story ends with Laila going on a date, with herself, signifying that she now has taken control of her life and doesn't need anyone else to love and care for her.[8][10]","TrailerLink":"https://www.youtube.com/watch?v=6zy3F0WVDK0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/6zy3F0WVDK0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.7,"CensorRating":"U/A","ReleaseDate":"10/4/2014","Runtime":100,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B922F207AB3368F18F0FE1D1ED749059.jpg"},{"Id":"54725235","ImdbId":"tt2882328","OriginalTitle":"Ugly","Title":"Ugly","Description":"The film opens with Shalini (Tejaswini Kolhapure) a lonely and troubled housewife addicted to alcohol, battling depression. She contemplates suicide, hoping to evoke some reaction from her stoic second husband, police chief Shoumik Bose (Ronit Roy), who behaves as if she doesn't exist. Shalini feels trapped in the marriage as Shoumik doesn't talk, taps her phone calls and treats her like a criminal. When she is about to shoot herself in the head with her husband's gun, she is interrupted by her 10-year-old daughter (from her first marriage) Kali (Anishika Shrivastava). Unaware of her mother's state of mind, Kali asks her to call her father, Shalini's estranged ex-husband, Rahul (Rahul Bhat). Rahul is a struggling actor. It is a Saturday, and Kali wishes to spend the day with her father, as decided in the custody agreement of the divorce.\r\n\r\nRahul takes Kali for a drive but is preoccupied with phone calls to further his career. He ends up taking Kali for a work assignment. This irritates her. She chooses to stay in the car while her father goes to see his agent Chaitanya (Vineet Kumar Singh) at his house. Whilst Rahul is waiting in the house for Chaitanya to arrive, a street seller tries to catch Kali's attention with children's masks. Chaitanya then arrives at the house and informs Rahul that his car door was open and Kali was not in the car. Rahul rushes down to the car and much to his horror, he sees that Kali is missing. Chaitanya and Rahul start looking for leads in the busy marketplace street where the car was parked. Chaitanya asks the mask seller about Kali and notices that he has Kali's phone. Rahul and Chaitanya try to stop the seller from running off, but he runs into the road and is hit by a car and dies on the spot.\r\n\r\nRahul and Chaitanya go to the police station to inform about what happened and that Kali is missing. The local police inspector Jadhav (Girish Kulkarni) makes jokes about the situation and does not take it seriously until he realises that Kali is the step-daughter of his police-chief Bose. Things quickly turn mean and Jadhav accuses Rahul and his friend Chaitanya of orchestrating the kidnapping as this is Bose's opinion when Jadhav informs him of the kidnap. Rahul and Bose have known each other since College, where the popular Rahul had the studious Bose beaten up when Bose had approached Shalini. Bose suspects Rahul and plays a telephone call clip back to Rahul in which he stated to his ex-wife that he will kidnap Kali if she continues stopping Kali from seeing him.\r\n\r\nChaitanya is allowed to leave the station. Chaitanya is then seen to be making a phone call to Bose in a disguised voice asking for a ransom. Rahul is released. What follows is a game of one-upmanship as Bose and Rahul search for Kali while simultaneously attempting to upstage the other. Both of them accuse each other at various times of orchestrating the kidnapping. Chaitanya is also suspected at times, but Bose cannot find any firm evidence.\r\n\r\nShalini's good-for-nothing brother Siddhant (Siddhanth Kapoor) and B-grade-actress item-girl Rakhee (Surveen Chawla) seem involved too. Siddhant makes a ransom call for 50 Lacs rupees to Shalini on her parent's home telephone, and Shalini asks her dad for 65 Lac rupees of which she delivers the 50 Laca but hides the extra 15 Lacs for herself under the care of her friend Rakhee. Rakhee moves out of her shared flat stealing this money. Siddhant is later arrested with the money whilst Shalini later implies to Bose that she had kept some of the money for herself so she can leave him. Rakhee is seen to be forwarding Chaitanya's ransom calls to Rahul. Every character seems like a culprit as they all have ulterior motives.\r\n\r\nRahul delivers the money for the ransom but the caller Chaitanya evades police interception. Rahul is seen getting into the caller's car with the bag of money. Rahul, Chaitanya and Rakhee are then seen together with the bag of money and Chaitanya jokes around with Rakhee as they wait for a ferry. Rahul telephones Bose to taunt him that he thinks he is a really big police inspector but did not find Kali. Bose replies by asking Rahul if Kali is with him and reflects that the situation has not helped anyone. Rahul is despondent as he realises that Bose does not know where Kali is either and she is still missing, Rahul flies into a rage at Chaitanya stating that Chaitanya had reassured him that Bose had taken Kali. Rahul states he has been treated as a fool by Chaitanya and kills Chaitanya in his rage whilst Rakhee quietly leaves the two of them taking the bag of money.\r\n\r\nThe Police revisit the marketplace and talk again to an Aunty of the mask seller who died. The two of them had a history of abducting children. A policewoman advises the Aunty that it would be better if she shows them where Kali is as the public will lynch her for what has happened. It has been at least six days that Kali has been missing and the cops finally discover Kali's dead body after being led to her by the Aunty. The police get to know that she was actually kidnapped by the mask seller, who hid her and then was unable to release her since he died in the chase. An image of the dead Kali is seen as the film ends.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":17,"Rating":4.1,"CensorRating":"U/A","ReleaseDate":"12/26/2014","Runtime":128,"Budget":45000000,"Revenue":138000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5940664277D09ABE8CB5B6411A46D29F.jpg"},{"Id":"79398059","ImdbId":"tt3175038","OriginalTitle":"Ek Villain","Title":"Ek Villain","Description":"Ek Villain romantic thriller directed by Mohit Suri . The story synopsis is as follows...\r\n\r\nGuru is a quiet, tough and ruthless boy, working for a politician, Prahlad. A dark past refuses to let Guru sleep at night until he meets a girl, Aisha.\r\n\r\nHe falls in love with her, his life changes and he convinces Aisha to get married to him. \r\n\r\nGuru even quits his job and moves from Goa to Mumbai to make a new beginning with Aisha. Just when things seem perfect, she falls prey to an attack. \r\n\r\nDevastated, Guru starts hunting the miscreant and is shocked to learn of his seemingly innocuous and simple identity. Something is amiss and Guru is unable to place a finger on the precise problem. \r\n\r\nWho is the real assailant and what is his motive? \r\n\r\nThe plot thickens as the astonishing mystery unveils and new realizations come to the forefront. \r\n\r\nThis visceral, hard-boiled edge-of-the-seat drama with romance and chart-busting music, comes from Mohit Suri, renowned for directing inimitable cult films, Woh Lamhe, Zeher, Awarapan, Raaz-2, and the recent Aashiqui-2. \r\n\r\nBalaji teams up with Suri on his first directorial feature outside the Mahesh Bhatt banner. It also marks the first-time pairing of Sidharth and Shraddha.","TrailerLink":"https://www.youtube.com/watch?v=ruO0VrqOkdE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ruO0VrqOkdE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.2,"CensorRating":"U/A","ReleaseDate":"6/27/2014","Runtime":129,"Budget":350000000,"Revenue":1530000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/85FAF81E2A1D66CA73BDE212C81FC524.jpg"},{"Id":"ee12ca74","ImdbId":"tt3495000","OriginalTitle":"Mardaani","Title":"Mardaani","Description":"Shivani Shivaji Roy, a dedicated and brave police officer with Mumbai Police, chases a Delhi-based kingpin, Karan Rastogi, who runs an organised crime cartel involving child trafficking and drugs. Her aim is to hunt him down and rescue a teenage girl, Pyaari. Pyaari is an orphan who is kidnapped by Karan's men. Shivani had saved Pyaari from being sold by her uncle and started taking care of her, and since then Pyaari is like a daughter to her. She takes the task more personally and goes beyond her legal rights and duties to nab Karan and save Pyaari. Karan, aware that Shivani is continually monitoring his cartel's activities, phones her, suggesting she not interrupt his business. Determined to catch him, Shivani uses intelligence inputs to track down his associate in Mumbai, who leads her to Karan's close aide, Wakeel, in Delhi. Karan, as a warning to Shivani, dismembers one of Pyaari's fingers and sends it to Shivani's house wrapped in a gift box, and gets Shivani's husband abused and thrashed.\r\n\r\nShivani travels to Delhi and sets up a trap involving decoy drug dealers from Nigeria, who pretend to offer very expensive rare South American cocaine to Karan and Wakeel. As the decoy drug dealers are negotiating the deal with Wakeel, Shivani barges in with other police officers and intercepts the area. While Karan escapes, Wakeel realises he'll get arrested, which means the police would interrogate him and eventually capture Karan. He therefore tries to erase evidence by destroying his mobile phone's SIM card, then shoots himself.\r\n\r\nShivani's continued investigation and the information from her sources leads her to Karan's house, where Karan's mother sedates her. Shivani is abducted and brought to a party organised by Karan. There, she meets Pyaari; Pyaari and the other girls are forced to work as prostitutes. Shivani singlehandedly confronts the situation, forcing Karan into a small room and rescuing and taking the girls with her. She challenges Karan to fight her when he teases her for being a woman and beats him badly. Sensing that he might escape the law, given the corruption in the police and judicial system, she hands Karan over to the girls, who beat him to death. His other gang members are arrested and prosecuted.","TrailerLink":"https://www.youtube.com/watch?v=04E-jHtWrDA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/04E-jHtWrDA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":15,"Rating":3.75,"CensorRating":"U/A","ReleaseDate":"8/22/2014","Runtime":113,"Budget":140000000,"Revenue":360000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/88C5293E823BE3A275BB840C1CD279B3.jpg"},{"Id":"22c8e010","ImdbId":"tt2573750","OriginalTitle":"Gulaab Gang","Title":"Gulaab Gang","Description":"The Gulaab Gang members are activists and vigilantes in Bundelkhand Uttar and Madhya Pradesh.,[4] They wear pink sarees and take up issues like domestic violence, the dowry system, rape, electricity matters, and education. Their fierce leader, Rajjo (Madhuri Dixit), locks horns with a conniving and shrewd politician, Sumitra Bagrecha (Juhi Chawla), who uses people.\r\n\r\nRajjo runs a Gulaab gang in the village of Madhopur, where she teaches little girls their alphabet, and grown-up girls how to wield a lathi. Her gang is made up of women who wear bright pink. Rajjo's closest friends in the gang are a tomboy (Divya Jagdale), a woman abandoned by her husband (Tannishtha Chatterjee), and a kohl-eyed woman (Priyanka Bose). These ladies go about standing up for the meek and the downtrodden, and clash against villainous husbands, cops and politicians.","TrailerLink":"https://www.youtube.com/watch?v=GKxKqcUmE_0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/GKxKqcUmE_0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.1,"CensorRating":"U/A","ReleaseDate":"3/7/2014","Runtime":139,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1EF7480DE7BB1045F693A15592187960.jpg"},{"Id":"4acf90af","ImdbId":"tt2980794","OriginalTitle":"Highway","Title":"Highway","Description":"The story begins on the eve of the wedding of Veera Tripathi (Alia Bhatt), the daughter of a rich business tycoon. She is at a Fuel Station by the highway with her fiancé when she is abducted. The gang who kidnaps her panics when they find out that her father has links in the government. However, Mahabir Bhati (Randeep Hooda), one of her abductors, is willing to do whatever it takes to see this through. They continuously move to different cities, to avoid being tracked by police. As the days go by, Veera finds peace and a new-found freedom in her bondage to the point that she confides in him of her troubled childhood. Her fear of abduction is taken over by a sense of freedom.\r\n\r\nSigma the police forcefully search the truck, but Veera, surprisingly even to herself, hides. Veera confesses to Mahabir about her home where her uncle molested her, a fact which was hushed up by her mother. She concludes that she loves the journey and doesn't want to go back to her life. Eventually, Mahabir can't help but care for Veera and his anger fades slowly, and he decides to let her go free. But, Veera refuses and insists on staying with Mahabir. Mahabir takes her back, and together, they travel; they make a home in a hilltop house. The following morning, a shootout starts as police have tracked them down. Mahabir is shot dead on the spot, while a shocked Veera is returned to her parents. With the courage and perspective she developed in her journey, Veera tells her family the truth about her abusive uncle and her desire of not living with them anymore. She leaves the house and goes to live in the mountains. She gets a job in a factory there, buys a house and lives there. The film ends by Veera looking at the mountains then looking at the sky and closes her eyes thinking about Mahabir.","TrailerLink":"https://www.youtube.com/watch?v=o66nNnGZ5Rg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/o66nNnGZ5Rg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Adventure","RatingCount":16,"Rating":3.8,"CensorRating":"U/A","ReleaseDate":"2/21/2014","Runtime":133,"Budget":300000000,"Revenue":600000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/595B9B7BE9F534D0592B90E2E90065F9.jpg"},{"Id":"5ee49d3a","ImdbId":"tt2905838","OriginalTitle":"Bang Bang","Title":"Bang Bang","Description":"The film is an official remake of the Hollywood film Knight and Day and features Hrithik Roshan and Katrina Kaif in the lead roles performed by Tom Cruise and Cameron Diaz respectively in the original.\r\n\r\nA chance encounter of the unassuming bank receptionist Harleen Sahni (Katrina Kaif) with the charming yet mysterious Rajveer Nanda (Hrithik Roshan), results in an on-rush of ditched planes, car chases, shoot-outs, bombing raids and general global mayhem. But as the transcontinental chase ensues with Rajveer convincing Harleen that he's the good guy, can she really trust him, and will trust matter when the bullets start flying? Fox Star Studios and Director Siddharth Anand promise edge of the seat excitement and adrenaline pumping action as the duo fight against all odds. Expect explosions, trigger happy assassins and pandemonium that can only aptly be termed as Bang Bang.","TrailerLink":"https://www.youtube.com/watch?v=LRARHtMzZQE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LRARHtMzZQE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"10/2/2014","Runtime":153,"Budget":140000000,"Revenue":340000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/EC1A45EA7217605C1B906C1760BDAB4F.jpeg"},{"Id":"851b63bf","ImdbId":"tt1239276","OriginalTitle":"Rang Rasiya","Title":"Rang Rasiya","Description":"Rang Rasiya (Colours of passion) is a drama film based on the life of the 19th-century Indian painter Raja Ravi Varma. The story summary is as follows...\r\n\r\nAdapted from the book 'Raja Ravi Varma' written by Ranjit Desai, Rang Rasiya traces the journey of a talented painter looking for his inspiration. \r\n\r\nRaja Ravi Varma (Randeep Hooda), an aspiring painter gets married to a princess in Kerala, only to find, that his dream of becoming a painter will remain unfulfilled out since his wife considers it demeaning. Constantly in hunt for an inspiration, he comes across the good looking Kamini, a servant in his household who inspires him to paint his masterpieces which are later, hailed by the King of Travancore. But when the death of the King leaves Ravi Varma disheartened, he decides to set out on a different journey and meets the beautiful, serene and graceful Sugandha. \r\n\r\nInspired and awed by her beauty, Ravi Varma captures the essence of Gods and Goddesses in his paintings through her. But this doesn't go down well with the Hindu fundamentalists who find it offensive. Fighting against the world for creative freedom, and aesthetic art, Rang Rasiya is the struggle of Raja Ravi Varma to re-define the beauty of paintings.","TrailerLink":"https://www.youtube.com/watch?v=_TC8o690ns0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/_TC8o690ns0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"11/7/2014","Runtime":132,"Budget":120000000,"Revenue":48000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9AD46A6DEEDED05DD21F7DC9A585AFBC.jpg"},{"Id":"ef113c34","ImdbId":"tt3678938","OriginalTitle":"Humpty Sharma Ki Dulhania","Title":"Humpty Sharma Ki Dulhania","Description":"Humpty Sharma Ki Dulhania is a romantic-comedy film directed by Shashank Khaitan and produced by Karan Johar. The story synopsis is as follows....\r\n\r\nWhen Kavya Pratap Singh, a chirpy, yet feisty girl from Ambala, decides to make a trip to Delhi for her marriage shopping, she meets a young, carefree Delhi lad, Humpty Sharma. Humpty's father is the owner of a campus bookstore, where Humpty and his two best friends, Shonty and Poplu, have grown up together. Kavya is unattainable for Humpty initially, which makes her even more endearing to him. But being a Delhi boy, he is not the one to give up so easily. With some help from his two best friends, he finds out all about her and through an interesting turn of events (including a ploy to save Kavya's friend Gurpreet's marriage), they start growing closer to each other. The more time they spend with each other, their love-hate banter grows, but their chemistry is apparent. They are both different, yet very similar as people. They are young, feisty and carefree, and it's the spurge of life which attracts them to each other. As per plan, once Kavya's trip ends, she heads back to Ambala, knowing very well that her father, the very strict, yet loving Mr. Singh, would never accept her love for Humpty. But even though they both weren't looking for love, love happened. So Humpty, accompanied by his two friends, decides to go get Kavya. That's the beginning of a journey for him that he wouldn't have imagined undertaking even in the wildest of his dreams. Humpty, against all odds, decides to convince Kavya's family to agree to his alliance with her. How he does this and if he succeeds in his mission forms the rest of the story.","TrailerLink":"https://www.youtube.com/watch?v=hWMWEhOjmFs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/hWMWEhOjmFs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":12,"Rating":3.0,"CensorRating":"U/A","ReleaseDate":"7/11/2014","Runtime":133,"Budget":200000000,"Revenue":1020000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/857571A13E0761D1D41BB115AE1589FE.jpg"},{"Id":"676ba06e","ImdbId":"tt2762334","OriginalTitle":"Main Tera Hero","Title":"Main Tera Hero","Description":"Main Tera Hero is a romantic action comedy film, directed by David Dhawan and produced by Shobha Kapoor and Ekta Kapoor for Balaji Motion Pictures.The story summary is as follows....\r\n\r\nOur Love Story begins with the Mischievous, Clever, Charming, a Daredevil and the HERO (Varun Dhawan) who falls in love with Sunaina (Ileana D'cruz). How can a Hero's love story be complete without a villain! So walks in Angad (Arunoday Singh) the corrupt cop, who wants to forcibly marry Ileana and to make things more spicy also does Ayesha (Nargis Fakhri) who is madly in love with our Hero.\r\n\r\nA massy entertaining romantic drama ensues, which takes Our Hero from the mountainous Ooty, to the fun college campus of Bangalore, and then to a beautiful mansion, in gorgeous Thailand.","TrailerLink":"https://www.youtube.com/watch?v=aOWB0yGTrNY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/aOWB0yGTrNY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":11,"Rating":2.65,"CensorRating":"U/A","ReleaseDate":"4/4/2014","Runtime":128,"Budget":425000000,"Revenue":710000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4C86070470D42EBC1DA6BA569C660909.jpg"},{"Id":"b7a5e0e1","ImdbId":"tt2978626","OriginalTitle":"Entertainment","Title":"Entertainment","Description":"The film starts with Akhil Lokande (Akshay Kumar) getting paid for doing an ad, where he gets into a spat, as he wasn't paid the full amount of money that they had talked about. This continues with a few other ads, where Akhil constantly ends the spat when he gets a phone call, and says he has to go somewhere. He then arrives on a shoot where Saakshi (Tamannaah Bhatia) is shooting for her television series. \r\n\r\nAfter her shoot lets out, they go for a walk around the park, observing other couples. At the end of their walk, Akhil proposes to Saakshi. Akhil and Saakshi go to her father's (Mithun Chakraborty) house, where they are told that until Akhil becomes rich, he can't marry Saakshi.\r\n\r\nAkhil goes to his film-obsessed friend's shop, where it is (Darshan Jariwala) who turns out to have no pains, and is dancing around with the nurse, only staying in the hospital, because it has service like a 5-Star hotel. Akhil arrives just in time to hear this, and goes to beat up his father, when he reveals that Akhil is adopted and his real father wasn't ready for a child so his mother left, but was killed in a train crash. \r\n\r\nLuckily Akhil survived, and was sent to his adoptive father. Then Akhil beats him up. He goes back to his house, and opens the chest that he never had before, which contains love letters from his real father, to his mother, and a locket with his father and mother's pictures. He discovers that his father is Pannalal Johri (Dalip Tahil) who is a billionaire in Bangkok. Right as he finds this, on the television comes news that Pannalal Johri is dead and his 30 crore's will go to anyone who can prove that they are related to Pannalal Johri.","TrailerLink":"https://www.youtube.com/watch?v=N_WD28tkyEk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/N_WD28tkyEk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.4,"CensorRating":"U/A","ReleaseDate":"8/8/2014","Runtime":140,"Budget":720000000,"Revenue":1100000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/267C4F49FCE01DDA589677F87E440A88.jpg"},{"Id":"b412b438","ImdbId":"tt2556308","OriginalTitle":"Holiday","Title":"Holiday","Description":"Captain Virat Bakshi, an army man comes back home to Mumbai for his holidays. His family takes him to see a bride, and he feels the girl is too soft and an introvert. Later in another occasion, he finds out that she is actually a boxer and is surprised by her personality. Having a police man friend, and the love he develops for this girl, the film revolves around the fun that happens among the three. Until at one point, an anti social activity in the heart of Mumbai city gets him involved into something huge.\r\n\r\nVirat Bakshibeing a patriot and a special agent in the Indian Army, is dragged into a huge network of terrorism. The rest of the story is about him fighting against the wittiest of Terror head, and how he swipes out the city of Mumbai from Sleeper cells. The film ends with a dedication to the Indian Army.","TrailerLink":"https://www.youtube.com/watch?v=wy0hM-NnQxw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wy0hM-NnQxw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":15,"Rating":3.7,"CensorRating":"U/A","ReleaseDate":"6/6/2014","Runtime":170,"Budget":500000000,"Revenue":1760000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/57DC29CB4017EFDB725AB18457589B53.jpg"},{"Id":"6c796fc9","ImdbId":"tt2339505","OriginalTitle":"Kochadaiiyaan","Title":"Kochadaiiyaan","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":3.0,"CensorRating":"","ReleaseDate":"5/23/2014","Runtime":124,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BC55E0A6B9B13B83327B30BAD3316DBE.jpg"},{"Id":"443d744d","ImdbId":"tt3741860","OriginalTitle":"Awake: The Life of Yogananda","Title":"Awake The Life of Yogananda","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/10/2014","Runtime":87,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/34CAF341AF7C7D172F6502884C14EE35.jpeg"},{"Id":"54bfe731","ImdbId":"tt2630076","OriginalTitle":"Super Nani","Title":"Super Nani","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/31/2014","Runtime":133,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2D2FB15D6D89996A5EDC6786559855E2.jpg"},{"Id":"88197bf2","ImdbId":"tt2871010","OriginalTitle":"Sonali Cable","Title":"Sonali Cable","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/17/2014","Runtime":127,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F6B21FD4361B8B04684B5600878D09A0.jpg"},{"Id":"f31f468c","ImdbId":"tt3848888","OriginalTitle":"The Shaukeens","Title":"The Shaukeens","Description":"","TrailerLink":"https://www.youtube.com/watch?v=eg4tfauEn7c","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/eg4tfauEn7c\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"11/7/2014","Runtime":124,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/ADE2FE71F2FB022AD194786A3AF7FB8D.jpg"},{"Id":"9805c7f6","ImdbId":"","OriginalTitle":"Balwinder Singh Famous Ho Gaya","Title":"Balwinder Singh Famous Ho Gaya","Description":"","TrailerLink":"https://www.youtube.com/watch?v=3uRL2O5YWNA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/3uRL2O5YWNA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"9/30/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6131AFB4289CD18F7D5A97AD8BFBCE35.jpg"},{"Id":"7995dfd7","ImdbId":"tt3398052","OriginalTitle":"Daawat-e-Ishq","Title":"Daawat-E-Ishq","Description":"Gulrez \"Gullu\" Qadir (Parineeti Chopra) who lives in a lower-middle class Hyderabadi mohalla and works at a mall as a shoe-sales girl with dreams of going to America. She lives along with her father Abdul Qadir (Anupam Kher) who is looking for a suitable match for her but can't afford to pay big dowry, which will only get her some uncouth crude fellow. \r\n\r\nIn her quest to find her Mr. Universe, she falls in love with Amjad (Karan Wahi) and they decide to get married. Things do not work out as Amjad's parents asks for 80 lakhs dowry. Enraged Gullu plans to trap a dowry-hungry groom under IPC498A (dowry act) and to recover lacs of money from him to fulfill her dream of going to America.\r\n\r\nShe and her father go to Lucknow with fake identities and comes up against \"Big Boss Haidari Kebab,\" Tariq also known as \"Taru\" Haider (Aditya Roy Kapur). During the three days before the wedding Taru and Gullu get to know each other and Gullu starts falling for Taru. To her surprise Taru gives her 40 lakhs cash from his own savings, which his father asked for dowry. \r\n\r\nGullu still sticks with her plan of drugging Taru on their wedding night and runs away with all the cash — also recovering 40 lakhs more from Taru's family via a police officer, blackmailing him to file charges under section 498A. Taru decides to take revenge as he finds out the real identity of Gullu. Meanwhile, Gullu and her father start preparing to leave for America. \r\n\r\nGullu returns all the money and confesses her love for him. They reunite and plan a real wedding without any dowry. Meanwhile, Amjad realises his mistake and confronts his parents for demanding a dowry.","TrailerLink":"https://www.youtube.com/watch?v=rtsHlYO6TUc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/rtsHlYO6TUc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"9/19/2014","Runtime":118,"Budget":200000000,"Revenue":403000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BD011670AAE9A6C41D931B3E3ECF8244.jpg"},{"Id":"7f88de6f","ImdbId":"tt2727028","OriginalTitle":"Total Siyapaa","Title":"Total Siyapaa","Description":"","TrailerLink":"https://www.youtube.com/watch?v=FXgVgSdU7ko","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/FXgVgSdU7ko\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"3/7/2014","Runtime":108,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C79AE8312EB7AC4960077CB35426954D.jpg"},{"Id":"ad9ef00d","ImdbId":"tt3483596","OriginalTitle":"O Teri","Title":"O Teri","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"3/28/2014","Runtime":107,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A5629733F01B24CF43AFE54EFCD6569C.jpg"},{"Id":"879b0ede","ImdbId":"tt3847072","OriginalTitle":"Ekkees Toppon Ki Salaami","Title":"Ekkees Toppon Ki Salaami","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"10/10/2014","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6EAC5A01E5B3989F999B74C860E717C7.jpg"},{"Id":"fe8e9537","ImdbId":"tt2951576","OriginalTitle":"One by Two","Title":"One by Two","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":2,"Rating":2.5,"CensorRating":"","ReleaseDate":"1/31/2014","Runtime":139,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D503F049D10209356A8095EFA817FE0E.jpg"},{"Id":"0f976cee","ImdbId":"tt3483712","OriginalTitle":"Raja Natwarlal","Title":"Raja Natwarlal","Description":"Raja Natwarlal is a crime drama film directed by Kunal Deshmukh and produced by Siddharth Roy Kapur under UTV Motion Pictures. The story summary is as follows...\r\n\r\nRaja (Emraan Hashmi) is a small-time conman who cons people for a living along with his partner in crime Raghav (Deepak Tijori). He is in love with a bar girl Ziya (Humaima Malick). Feeling sorry for her, Raja decides he wants to go for a big catch so that he can marry his lady love and she won't have to work in a bar any more. That's when the trouble starts. Along with Raghav, Raja makes a grand plan to swindle a huge amount of money from two baddies. The plan is successful and Raja decides to celebrate.\r\n\r\nHe seeks the help of a seasoned crook Yogi (Paresh Rawal), whom Raghav used to talk about before his murder. After a lot of persuasion, Yogi agrees to help Raja have his payback. Yogi trains him, and eventually they form a team of crooks, and set out to Cape Town to finish off Varda.","TrailerLink":"https://www.youtube.com/watch?v=sf1BsDj8Huk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/sf1BsDj8Huk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"8/29/2014","Runtime":141,"Budget":350000000,"Revenue":295000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A412C39D9C81A718D86824772BDE3FDA.jpg"},{"Id":"8d055e05","ImdbId":"tt2675978","OriginalTitle":"Dedh Ishqiya","Title":"Dedh Ishqiya","Description":"Khalujan (Naseeruddin Shah) and his nephew Babban (Arshad Warsi), a thief duo, pose as a Nawab and his attendant, and manage to run away with a prized necklace from a jewellery shop. In the police chase they get separated, while Khalujaan is hurt. Months later Babban traces Khalujan again, this time posing a nawab, at a poetry contest. It is a mushaira organised by Begum Para (Madhuri Dixit), the widowed Begum of Mahmudabad as per the wishes of her deceased husband. The winner would win the Begum as bride and in turn become the Nawab of Mahudabad. However, by the opening night, Babban traces Khalujaan. Soon Babban falls in love with Begum Para's assistant, Muniya (Huma Qureshi), while Khalujaan has his heart set on Begum herself.\r\n\r\nA local MLA-gangster Jaan Mohammed (Vijay Raaz), who is making the poet Nawab Italwi (Manoj Pahwa) write poetry for him to recite at the contest. Khalujaan tries to impress the Begum by giving her the prized necklace he stole earlier, but on the final day Begum declares Jaan Mohammed to be her husband and the new nawab of Mahmudabad.\r\n\r\nDisappointed Khalujaan approaches Begum with a gun, but just before a masked man kidnaps her at gun point. Khalujaan chases them and blocks their way only to discover that the masked man was Babban. Begum has plotted her own kidnapping to extort money from the new nawab (Jaan Mohammad) as she was left bankrupt by her late husband. Babban calls Jaan Mohammed (who now is aware of Begum's plan) to bring 100 million rupees ransom money to a railway station. All four reach the railway station to collect the money but find the bag empty and surrounded by Jaan Mohammad's goons. Much to their good fortune Nawab Italwi arrives with a police force and cross-firing starts.\r\n\r\nBegum and Muniya escape from the situation leaving behind Babban and Khalujaan to be arrested. One and half months later, both get bail and a message from Begum and Muniya, who are now settled in an unknown city by selling off the prized necklace. Movie ends with the duo once again surrounded by Mushtaq (Salman Shahid) and his gang.","TrailerLink":"https://www.youtube.com/watch?v=_J3fkfUDkx8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/_J3fkfUDkx8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":15,"Rating":3.65,"CensorRating":"U/A","ReleaseDate":"1/10/2014","Runtime":152,"Budget":150000000,"Revenue":270000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4A48BF93C9E512D9BAD974B3C5FA2879.jpg"},{"Id":"825c0f49","ImdbId":"tt3614516","OriginalTitle":"Ankhon Dekhi","Title":"Ankhon Dekhi","Description":"Ankhon Dekhi centers around Raje Bauji, played by Sanjay Mishra who, after a dramatic incident, decides that he will only believe what he sees with his eyes.","TrailerLink":"https://www.youtube.com/watch?v=H3yKUHI2mE4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/H3yKUHI2mE4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":17,"Rating":4.05,"CensorRating":"U","ReleaseDate":"3/21/2014","Runtime":107,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/DE5D72751C85C53BBEB332F08D6D45BB.jpg"},{"Id":"9a6e5878","ImdbId":"tt0403935","OriginalTitle":"Action Jackson","Title":"Action Jackson","Description":"Action Jackson features Ajay Devgn in dual roles, alongside Sonakshi Sinha, Yami Gautam and Manasvi Mamgai as the female leads. \r\n\r\nIn order to escape crime and clutches of a ruthless mafia, a Bangkok based hit man seeks the help of his lookalike, a Mumbai based goon.\r\n\r\nVishi (Ajay Devgn) is a small-time crook who would do anything for money. He falls in love with Khushi (Sonakshi Sinha), a simple HR executive, who then begins a relationship with him. One day, Vishi, who frequently gets involved in fights, publicly beats up a street gangster, who later seeks a revenge attack with his gang. The gangster and his gang brutally beat up Vishi, and easily escape the scene. It is then revealed that the person they had beaten is actually Vishi's lookalike, Jai. The goons escape when they hear the siren, and Vishi is found alive on bike, then the same goons gets beaten brutally by Vishi.\r\n\r\nJai single-handedly kills them all and is revealed to be a professional assassin and previous right-hand man of underworld criminal Xavier Fonseca (Anandaraj), nicknamed AJ. After AJ single-handedly rescued Xavier's sister Marina (Manasvi Mamgai) from a bunch of kidnappers, Marina falls for Jai but he rejects her as he is been married to Anusha (Yami Gautam).Angered, Xavier tries to kill Anusha twice to get AJ married to Marina, which leaves her brutally injured.\r\n\r\nLater it was revealed to be safe who was rescued by one of a man of Xavier. The film ends with AJ and Vishi meeting at airport and Anusha requests Vishi to marry Khushi soon. It even shows that Musa's hand is broken and they are seen together as AJ with Anusha and Vishi with Khushi and Musa. While credit rolls it shows Prabhudeva and Ajay Devgan dancing together in the theme song of AJ.","TrailerLink":"https://www.youtube.com/watch?v=YubQzbzGHps","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/YubQzbzGHps\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":7,"Rating":1.65,"CensorRating":"U/A","ReleaseDate":"12/5/2014","Runtime":144,"Budget":190000000,"Revenue":750000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/49A1A1BE96994B59524E9809352F10D5.jpg"},{"Id":"d83edd79","ImdbId":"tt2309764","OriginalTitle":"Singham Returns","Title":"Singham Returns","Description":"Bajirao Singham (Ajay Devgan) gets transferred to Mumbai and he discovers that one of his team members (Mahesh) is found dead with large bags of money. Bajirao decides to unearth the truth behind it and in this process, he collides with a powerful god-man, Satyaraj Chandar a.k.a. Babaji (Amole Gupte) who has high profile connections with politicians.\r\n\r\nDuring this period, Guruji (Anupam Kher), is killed by Babaji, even though Singham was present at the scene. He vows revenge. Because of this, he has to pretend that he has resigned in front of his family. Due to this his father asks him and his childhood friend, Avni (Kareena Kapoor Khan), to come to their home town, Shivgargh. After some comic scenes, Singham and Avni, fall in love with each other. However, it is then revealed that Singham hasn't resigned and came to Shivgargh on a mission to get some proof against Babaji.\r\n\r\nWhen they get back to Mumbai, Babaji starts threatening Singham's family. He also harms all of Guruji's candidates, including Avni, because her brother is one of the candidates. Singham manages to save everyone but before they resign, one of Babaji's henchmen Altaf (Pankaj Tripathi) wakes up from coma and testifies against him. Singham arrests Babaji and his left hand, Prakash Rao. However, some party workers execute an attack outside the court, killing the witnesses. This causes Babaji and Prakash Rao to receive bail. But after Babaji gets released, Singham goes to his house without wearing his police uniform and shoots at their buttocks to coerce them and the wounded Prakash Rao and Baba tell the truth.\r\n\r\nA few weeks later, Guruji's party wins the elections. While being transported to jail, Prakash Rao and Baba once again threaten Singham. Suddenly, the van in which Prakash Rao and Baba are being transported in suddenly stops and the driver walks away. A water tanker crashes into the van and both of them are killed. Inspector Phadnis (Vineet Sharma) tells media that there was a brake failure, and the incident is deemed an accident.","TrailerLink":"https://www.youtube.com/watch?v=3CwQjsdE-1Q","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/3CwQjsdE-1Q\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.35,"CensorRating":"U/A","ReleaseDate":"8/15/2014","Runtime":142,"Budget":1100000000,"Revenue":2155700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/064C9B6A35A8BEAFE16D619F87A94553.jpg"},{"Id":"1efe700a","ImdbId":"tt2343621","OriginalTitle":"Liar's Dice","Title":"Liar's Dice","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"1/18/2014","Runtime":104,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6E965B79545AA98BFBFA1261A360A452.jpg"},{"Id":"e3e0f472","ImdbId":"tt1629715","OriginalTitle":"Miss Lovely","Title":"Miss Lovely","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"6/20/2014","Runtime":113,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1164037A11A4238811338DD576BC28DD.jpg"},{"Id":"cf5e542e","ImdbId":"tt3380264","OriginalTitle":"Kill Dil","Title":"Kill Dil","Description":"Tutu (Ali Zafar) and Dev (Ranveer Singh) are two orphans who were raised by a local gangster Bhaiyaji (Govinda) to be assassins. Their life takes a turn when they meet Disha (Parineeti Chopra) at a club and Dev falls in love with her. Dev's indifference towards work starts irritating Bhaiyaji, but Tutu defends Dev. When Dev is unable to kill one of their targets, he decides to change his life. This enrages Bhaiyaji and he threatens to kill Dev. Tutu intervenes and suggests Dev to look out for a job but should accompany him every time Bhaiyaji calls them to give killing contracts.\r\n\r\nTutu gets Dev a fake MBA degree which helps Dev join an insurance company. Dev and Disha make plans to get married, while Disha is unaware of Dev's past. Bhaiyaji on learning the truth about Dev's job decides to play a trick to get him back. He sends one of his goons, Batuk, to kill Dev and also informs Tutu. He also calls up Disha and tells her about Dev and Tutu's real identity. Just when Batuk is about to kill Dev, Tutu shoots him down in front of Disha. Disha shocked with the reality breaks up with Dev, resulting in Dev again becoming an assassin.\r\n\r\nBhaiyaji gives them a fresh contract to kill his arch enemy Baban Pehlwan. Dev and Tutu record a video telling the tale of how they became gangsters and send it to Disha. During a shootout, Dev is again unable to fire the gun and gets shot. Tutu takes an injured Dev to an hospital where after an operation, Dev finds Disha waiting for him and they both reunite. Bhaiyaji gets killed by Baban Pehlwan. Dev and Disha get married while Tutu has a job interview in the same insurance company with a fake MBA degree.","TrailerLink":"https://www.youtube.com/watch?v=jEhnt70rCTI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/jEhnt70rCTI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":9,"Rating":2.25,"CensorRating":"U/A","ReleaseDate":"12/14/2014","Runtime":127,"Budget":350000000,"Revenue":360000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E81264B94414D829EBAE6E9D6E3DA5C1.jpg"},{"Id":"05998026","ImdbId":"tt3142688","OriginalTitle":"Finding Fanny","Title":"Finding Fanny","Description":"Finding Fanny is a comedy film directed and written by Homi Adajania and produced by Dinesh Vijan under Maddock Films and presented by Fox Star Studios. The story is as follows.....\r\n\r\nPocolim is a village where pointless conversations are a way of life. Nothing ever really happens here and the people of Pocolim, well, they just exist.\r\n\r\nOne night, the old postman Ferdie, receives a letter that is slipped under his door. He realizes that it is the letter he had written 46 years ago to the love of his life, Stefanie Fernandes, asking for her hand in marriage. To his utter shock, he discovers that had never been delivered. All these years Ferdie has lived a life of melancholy regret, believing that Stefanie had rejected him. He decides to find his beloved Fanny (as he fondly called her) and tell her the truth. Where would she be after 46 years? Dead? Happily married? Would she even remember him? Or is Stefanie Fernandes merely a figment of Ferdie's imagination?\r\n\r\nFour colorful characters from the village join the trip under random pretexts, though in actuality everyone wants a distraction from their mundane lives. A young virgin widow, a bitter mechanic, a belligerent artist and an obnoxious self-appointed 'Lady' of Pocolim join Ferdie as they experience various hilarious and moving events that change their lives forever.\r\n\r\nFinding Fanny is an off the wall, comical story about a bunch of oddballs who venture out to find Stefanie Fernandes (Fanny); in the process, they discover a strange sense of solace and love amongst each other, and end up seeing a point to their previously pointless lives.","TrailerLink":"https://www.youtube.com/watch?v=5O86FUOrlkY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/5O86FUOrlkY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Family","RatingCount":12,"Rating":2.95,"CensorRating":"U/A","ReleaseDate":"9/12/2014","Runtime":102,"Budget":150000000,"Revenue":580000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/334E7688FD286C0A215E4147A3A415C5.jpg"},{"Id":"a32a3eef","ImdbId":"tt2372678","OriginalTitle":"2 States","Title":"2 States","Description":"2 States is a story about a journey of one such couple, Krish Malhotra and Ananya Swaminathan. They meet at the IIM-Ahmedabad and during the course they fall in love. Complications arise after the course comes to an end and they decide to get married. Krish and Ananya belong to two different states of India. Krish, a North Indian Punjabi boy from Delhi, and Ananya, a Tamilian Brahmin from Chennai. They take a conscious decision; till their parents don't agree they won't get married. Everything goes down hill when the parents meet. There is a cultural clash and the parents oppose the wedding. To convert their love story into a love marriage, the couple faces a tough battle in front of them. For its easy to fight and rebel, but much harder to convince. \r\n\r\nThey really do very hard to convince each other's parents and finally make it.The novel ends with Ananya giving birth to twin boys. He says that the babies belong to a state called 'India'; with a thought to end inequality.","TrailerLink":"https://www.youtube.com/watch?v=CGyAaR2aWcA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/CGyAaR2aWcA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.55,"CensorRating":"U/A","ReleaseDate":"4/18/2014","Runtime":149,"Budget":350000000,"Revenue":1500000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/DBD3096DC0DAF96795B22342DBAACBF3.jpg"},{"Id":"ee06b64b","ImdbId":"tt3017412","OriginalTitle":"Happy Ending","Title":"Happy Ending","Description":"Happy Ending is a romantic comedy film directed by Raj Nidimoru and Krishna D.K. The story synopsis is as follows....\r\n\r\nIt starts off with Kareena Kapoor's character (cameo) confessing her love by telling those three magic words to Yudi, a one-book wonder author and someone who is (self-confessedly) not allergic to 'I Love You', but the baggage attached with it'. And when Yudi doesn't reciprocate her feelings, Kareena's character shows him the middle finger (quite literally!). No sooner does she exit Yudi's life, enters Vishaka (Kalki Koechlin), a dentist by profession, and is head over heels in love with Yudi. She loves Yudi so much that she even installs a mobile app called 'Nospace' on his cell so that she can keep track of his whereabouts. While she leaves no stone unturned in gaining his attention, Yudi is totally unmoved by her and her feelings and emotions towards him and wants to constantly break up with her. \r\n\r\nWhenever Yudi is in trouble or feeling lonely, the only two people whom he always looks upto are his 'ex-girlfriend-now-a-mother-of-three childen' Divya (Preity Zinta), and his best friend of many years Montu (Ranveer Shorey), both of whom lend him a patient listening and help him sort out the mess of his life. Because he blows up all the money that he had made from his book, he returns back to writing but, he gets dejected when he sees that the same publishers hiring the gorgeous Aanchal Reddy (Ileana D'cruz), whose romantic novels sell like hotcakes. \r\n\r\nWhat peps him up is the offer to write a script for 'Armaanji' (Govinda), an actor who wants to capture multiplexes after having conquered the single screens. To get a hold of 'success formula' in writing, Yudi decides to befriend Aanchal. Taking resort to a few tricks here and there, Yudi not only manages to befriend her, but also lands up spending 'quality time' with her. Right at the start of this 'relationship', the duo agree to be together without falling in love with each other. While Aanchal is clear about this relationship, it is Yudi who goes onto realize that he has actually fallen in love with her!","TrailerLink":"https://www.youtube.com/watch?v=XxU1B54LRGs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/XxU1B54LRGs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":11,"Rating":2.7,"CensorRating":"U/A","ReleaseDate":"11/21/2014","Runtime":135,"Budget":550000000,"Revenue":214900000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F47F92C1D22DCC69CAC3226F23ED6809.jpg"},{"Id":"30d88954","ImdbId":"tt3036740","OriginalTitle":"Humshakals","Title":"Humshakals","Description":"Humshakals is a comedy film directed by Sajid Khan and produced by Vashu Bhagnani. The story synopsis is as follows...\r\n\r\nThis film promises to be a riot of laughter with Saif Ali Khan, Riteish Deshmukh and Ram Kapoor playing triple roles in the film. \r\n\r\nGreedy uncle Kunwar Amarnath Singh (aka Kans) has all his eyes on the property of Ashok Singhania (Saif) since his father is in coma. He manages to get a temporary power of attorney for the property by proving Ashok to be mad along with his best friend Kumar (Riteish). \r\n\r\nAs they get treated by Dr. Shivani in an asylum, another set of Ashok Kumar break out of that hospital who work with Kunwar to acquire the Singhania property. However, the confusion begins when a third pair of Ashok Kumar enters the scene who is introduced by Dr. Khan (Nawab Shah). Ashok Singhania too comes across Johny (a lookalike of Kunwar) whom he trains to behave like his uncle. However, his dilemma increases when he meets yet another look alike Balbir.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":4,"Rating":0.95,"CensorRating":"U/A","ReleaseDate":"6/20/2014","Runtime":159,"Budget":750000000,"Revenue":637000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/FAE4910C8B7C167D84F7678F1D9E25D2.jpg"},{"Id":"ef67726c","ImdbId":"tt3390572","OriginalTitle":"Haider","Title":"Haider","Description":"The film is a modern-day adaptation of William Shakespeare's tragedy Hamlet, set amidst the insurgency-hit Kashmir conflicts of 1995 and civilian disappearances. Haider, a young student and a poet, returns to Kashmir at the peak of the conflict to seek answers about his father's disappearance and ends up being tugged into the politics of the state.\r\n\r\nIn short, the story is about a young man who returns to Kashmir after his father's disappearance to confront his uncle - the man he suspects to have a role in his father's fate.","TrailerLink":"https://www.youtube.com/watch?v=xakmvJ0WPa4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/xakmvJ0WPa4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":17,"Rating":4.15,"CensorRating":"U/A","ReleaseDate":"10/2/2014","Runtime":160,"Budget":240000000,"Revenue":690000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E8730C5060A678E3B321188C7F8F571D.jpg"},{"Id":"15ba02bf","ImdbId":"tt3645014","OriginalTitle":"The Xposé","Title":"The Xposé","Description":"The Xpose is a musical-thriller film directed by Anant Mahadevan and produced by Vipin Reshammiya under the banner of HR Musik. The story synopsis is as follows...\r\n\r\nApart from the main story that unfolds, and that concerns four actors - Ravi Kumar, Chandni, Zara Fernandes and Virman Shah, the story has 2 directors, each trying to make their own movie a box-office hit, a music director with an older-age wife, a care-taker woman, and a police inspector whose revelations are quite important at the end. The movie is set in the 1960s.\r\n\r\nThe apparent suicide by Zara Fernandes turns out to be a homicide, and the suspects include all the main players in the game. An astute ex-policeman Ravi Kumar ultimately unravels the threads of different sub-plots and leads the viewer to a sensible ending.\r\n\r\nAnant Mahadevan as the director of Ujwal, Nirmal, Sheetal promotes Ravi Kumar, Virman Shah and Zara Fernandes together in a path-breaking movie, but his movie's hopes are sabotaged by another director, Rajan Anna, who is simultaneously making Reena Mera Naam with Chandni in the lead role.\r\n\r\nZara does manage to bag a Filmfare award for her role; at the post-awards party, a series of events leads to the death of Zara as she falls from a balcony high-up in the building. Treated at first as a sad suicide, the truth emerges later when it becomes apparent to the investigating police that this was a homicide. The needle of suspicion falls on the music director Kenny Damania (or KD), but the actual act of murder was an act of someone else. If I reveal the entire plot, there won't be any need to see the movie.","TrailerLink":"https://www.youtube.com/watch?v=IbJ1IpwoXZQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/IbJ1IpwoXZQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":7,"Rating":1.65,"CensorRating":"U/A","ReleaseDate":"5/16/2014","Runtime":113,"Budget":160000000,"Revenue":220000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D379ECBD78EBFF6778521A6AF813F99E.jpg"},{"Id":"390e6957","ImdbId":"tt2574698","OriginalTitle":"Gunday","Title":"Gunday","Description":"When they ran to save their lives for the first time, they were mere 12-year-old boys, and the world called them 'refugees'.They arrive at Kolkata by train and start their livelihood by working at a small restaurant. Bala gets into a fight with the owner who slaps him, scolds him and calls him a refugee. They start looting coal from trains and selling it in the market for a lower price. Then Bala slaps the owner of restaurant and warns him not to ill-treat children. As they grow up, Bikram (Ranveer Singh) and Bala (Arjun Kapoor) have started looting whole coal trains.\r\n\r\nOn their journey from gun couriers to coal bandits and new businessmen, they convert all their illegal trades to legal business with the help of Kali Kaka (Saurabh Shukla), they become town heroes, building schools and hospitals. They also provide work and help to the poor, thus becoming white collared and good hearted persons but is targeted by a law as 'Gunday'. A.C.P. Satyajeet Sarkar (Irrfan Khan) who is now summoned to Kolkata to catch Bikram and Bala, however, with the brothers successful in covering their tracks, Sarkar warns them that he will arrest them the day he finds a single piece of evidence against them.Then Nandita (Priyanka Chopra), a cabaret dancer, enters the boys' lives and both Bikram and Bala fall in love with her. They decide that whomever she loves will marry her. \r\n\r\nBala then finds out that all their business is in Bikram's name, hence he angrily calls Bikram and asks for equal partition of the business. He agrees and transfers half the business to Bala. Meanwhile, Bikram gets to know about the true identity of the man who Bala \"killed\" is also alive, with the man also a police officer. Nandita tried to convince Bikram otherwise, but Bikram believes that the police system were responsible for destroying his and Bala's innocence and childhood. Nandita tells her identity to Bikram, but shockingly he goes mad and blames her that she is also responsible for their getting into trouble. When she requests him to surrender but he refuses and goes to reunite himself with Bala.The film ends with a bullet fired towards them and their powerful words narrating the end of this film.","TrailerLink":"https://www.youtube.com/watch?v=HMMEODhZUfA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/HMMEODhZUfA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":6,"Rating":1.83333,"CensorRating":"U/A","ReleaseDate":"2/14/2014","Runtime":152,"Budget":500000000,"Revenue":1200000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/03E9138AFCEF482A39BF1B47BF1E8FA6.jpg"},{"Id":"8a734920","ImdbId":"tt2338151","OriginalTitle":"PK","Title":"PK","Description":"An alien (Aamir Khan) gets stranded on earth with nothing including clothes except a locket which was his remote to call the spaceship to go to his planet back. But, in a short time, the locket is looted from the alien. He tries to get it back but is unsuccessful. He comes to a land quite different from his home place where he slowly understands the use of money and clothes.\r\nOnce, when he was running for his life, he gets hit by the vehicle of Bhairon Singh (Sanjay Dutt) who thinks that the alien has lost his memory and is unable to recognize anyone. He takes the alien to his place and helps him try to adjust to Earth customs. He doesn't understand the language on Earth and in order to do so, he tries to transfer it from women's hands. Bhairon thinks that the alien is attracted towards women, so, he takes him to a night club where he was free to hold hands. After 6 hours of transferring, he gets to know their language from a girl, Phuljhadiya (Reema Debnath).\r\nAfter being able to speak, PK tells his friend Bhairon that someone stole his locket. So, Bhairon tells him that the robber won't sell the locket at that place to avoid getting caught and may have gone to Delhi. So, PK goes to Delhi and tries to inquire about his locket where he gets to listen phrases such as - \"Only God can help you\" from everywhere. So, he sets out to find God and ends up in a series of confusions as to find God of which religion. Meanwhile, everyone thinks that he is drunk and because of this gets the name 'PK'.\r\nOn a day, a TV reporter Jagat Janani (Anushka Sharma), better known as Jaggu, finds strange when she comes across PK as he was distributing posters for 'Missing God'. She follows him and end up saving him from being beaten up when he was stealing money from a temple. She inquires about everything and broadcast it on her channel. Jaggu tries to help PK find his locket to go back to his planet. His locket was with a Godman Tapasvi Maharaj (Saurabh Shukla). Jaggu and PK set out to get the locket in a series of drama and claim that Tapasvi Maharaj was calling the 'Wrong Number' and not really God.\r\nMeanwhile, PK falls in love with Jaggu but comes to know that she loved Sarfaraz (Sushant Singh Rajput) whom she was to marry but abandoned the idea following a misunderstanding. Meanwhile, Bhairon Singh catches the robber and reached Delhi with him but both died in a bomb blast. PK and Tapasvi Maharaj clash with each other during a TV Show on Jaggu's news channel. With the help of Jaggu's boss, he proves that Sarfaraz was not wrong for which in turn he got his locket.","TrailerLink":"https://www.youtube.com/watch?v=82ZEDGPCkT8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/82ZEDGPCkT8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":17,"Rating":4.15,"CensorRating":"U/A","ReleaseDate":"12/19/2014","Runtime":153,"Budget":850000000,"Revenue":7350000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B443AD7B10C2B8CA0D083EF2C7FBDE2D.jpg"},{"Id":"4b948012","ImdbId":"tt2372222","OriginalTitle":"Kick","Title":"Kick","Description":"Kick is an action film produced and directed by Sajid Nadiadwala under his Nadiadwala Grandson Entertainment banner. It is an official remake of a Telugu movie Kick which was released in 2009. The story summary is as follows...\r\n\r\nThe premise of KICK, first! On a train journey in Warsaw, a pretty psychiatrist, Shaina [Jacqueline Fernandez], meets Himanshu [Randeep Hooda], a police officer from India, for an arranged match. They share their pasts with each other. \r\n\r\nShaina shares the story of her ex-boyfriend Devi Lal Singh [Salman Khan], a guy who lived only for 'Kick'. She talks about his madness and their whirlwind romance, until one day he breaks up with her for a new kick and walks away, never to return. Himanshu tells her about his glorious escapades and that he has finally met his match - an intelligent thief. \r\n\r\nWhat they don't know is that their stories have one thing in common - Devil. He returns back into their lives under a new guise of having lost his memory. Behind it all is a deeper mystery and an uncompromising mission...","TrailerLink":"https://www.youtube.com/watch?v=u-j1nx_HY5o","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/u-j1nx_HY5o\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"7/25/2014","Runtime":146,"Budget":1400000000,"Revenue":3770000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BD8210394B7C5B62C7242ADAF3ADF633.jpg"},{"Id":"52be5689","ImdbId":"tt1188982","OriginalTitle":"Jai Ho","Title":"Jai Ho","Description":"Jai Ho is an action drama film directed by Sohail Khan and produced by Khan along with Sunil Lulla. The story summary is as follows...\r\n\r\naboutJai, an upright common man is fighting a solitary war against corruption and injustice. Honest and incorruptible, he has made it his mission to help as many people as he can. His mantra is quite simple - help somebody and then request that person to lend a helping hand to somebody else - thus forming an ever growing circle of people helping each other.\r\n\r\nIn a strange twist of fate, he finds himself pitted against a powerful politician and his vile family. Jai who is an ex army officer, will not shy away from a battle, however bloody it may get and firmly believes that you do not have to wear an uniform to serve your country. As the politician unleashes his violent goons on brave heart Jai, Geeta, Jai's sister, realises the horrific consequences this can have on her brother and the rest of their family.\r\n\r\nShe persuades a reluctant Jai to make peace with the politician. But when this leads to humiliation being heaped on him, Jai loses his cool and declares all out war. It is an unequal war - on side stand the politician with his numerous henchmen and on one side is Jai - alone. \r\n\r\nBut unknown to him, a silent revolution is taking place. The voiceless public, he has helped in the past, is gathering force. It finally has a voice and this voice cannot...will not be silenced. \r\n\r\nBecause Jai Ho is the resounding sound of victory...Jai Ho is the warrior cry of someone determined to win at all cost with a help-three-people concept .","TrailerLink":"https://www.youtube.com/watch?v=-wW3RP4cmNU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/-wW3RP4cmNU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"1/24/2014","Runtime":135,"Budget":650000000,"Revenue":1830000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C04EB6A8B24B9DC608BC22CC62B66D0E.jpg"},{"Id":"0de1888f","ImdbId":"tt2461132","OriginalTitle":"Happy New Year","Title":"Happy New Year","Description":"Six would-be thieves enter a prestigious dance competition as a cover for their larger goal of pulling off a major heist.","TrailerLink":"https://www.youtube.com/watch?v=JGHwANkQFrg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/JGHwANkQFrg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"10/23/2014","Runtime":180,"Budget":1500000000,"Revenue":3830000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C816E8202F644E3E3722612307DD93C8.jpg"},{"Id":"20b32b7c","ImdbId":"tt2926068","OriginalTitle":"Manam","Title":"Manam","Description":"A married couple die in an accident, leaving behind a son. As he grows up, he comes across reincarnations of his father and mother as youngsters and tries his best to unite them.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":10,"Rating":4.1,"CensorRating":"","ReleaseDate":"5/28/2014","Runtime":163,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D10BE2D0A7BA5515E4F895E70B951F9A.jpeg"},{"Id":"f90d80bb","ImdbId":"tt3531852","OriginalTitle":"Bhoothnath Returns","Title":"Bhoothnath Returns","Description":"Boothnath vows to redeem himself when spirits tease him, and searches for a child to terrify. He befriends Akhrot, a slum kid, and helps him take on the country's most powerful politician.","TrailerLink":"https://www.youtube.com/watch?v=BpC-Owk5MNY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/BpC-Owk5MNY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Fantasy","RatingCount":14,"Rating":3.5,"CensorRating":"U","ReleaseDate":"4/11/2014","Runtime":155,"Budget":200000000,"Revenue":684000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8234D0FB5FBACA08F2252DC2793362D7.jpg"}]