[{"Id":"6aa8f338","ImdbId":"tt3717068","OriginalTitle":"Court","Title":"Court","Description":"Court is a 2014 Indian courtroom drama film, written and directed by Chaitanya Tamhane in his directorial debut. Featuring a cast of newcomers, the film examines the Indian legal system through the trial of an ageing folk singer at a Sessions Court in Mumbai. Court theatrically released in India on 17 April 2015.\r\n\r\nA sewerage worker's dead body is found inside a manhole in Mumbai. An ageing folk singer is tried in court on charges of abetment of suicide. He is accused of performing an inflammatory song which might have incited the worker to commit the act. As the trial unfolds, the personal lives of the lawyers and the judge involved in the case are observed outside the court.","TrailerLink":"https://www.youtube.com/watch?v=UWvOAHjQysw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/UWvOAHjQysw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.95,"CensorRating":"U/A","ReleaseDate":"4/17/2015","Runtime":116,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E013643DFD5591AB19D90389DC5DD440.jpg"},{"Id":"388579c9","ImdbId":"tt4553900","OriginalTitle":"Paisa Ho Paisa","Title":"Paisa Ho Paisa","Description":"Paisa Ho Paisa is a 2015 Bollywood Hindi movie that was released 3 April 2015 starring Dhruv Bhandari, Madalasa Sharma and Kanishka Soni, directed by Muktha Sunder. Paisa Ho Paisa is a romantic comedy with several roller coaster joyrides situated on the India roads. This film is a remake of Sundar’s Tamil film Pathayiram Kodi.\r\n\r\nThis film is about Bungling cops and Buffoonery Gangsters chasing invisible people / loot and an invisible car. From Pondicherry to Sani Shingapur innumerable comic situations and laugh riot all the way. A road movie and a wacky comedy.","TrailerLink":"https://www.youtube.com/watch?v=gv7dToPTeMQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/gv7dToPTeMQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":0,"Rating":0.0,"CensorRating":"U/A","ReleaseDate":"4/3/2015","Runtime":105,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D08474DFE9571BFDA0F7AE0FD951102F.jpg"},{"Id":"f8401236","ImdbId":"tt3742284","OriginalTitle":"NH10","Title":"NH10","Description":"A couple, Meera (Anushka Sharma) and Arjun(Neil Bhoopalam), are going to a party, where Meera gets an urgent work call from her office. On the way, she is attacked by some street punks who smash her car's window. Meera manages to escape but is shaken by the incident. Arjun suggests a road trip for Meera's upcoming birthday. The couple starts their journey the next day. While stopping at a roadside Dhaba for lunch, a petrified young girl arrives and pleads for help, saying a few men are about to kill her. Meera shakes her off but they see a gang of men round up the same girl and a boy, beat them savagely and drag them to a SUV. Arjun intervenes but Satbir (Darshan Kumar), the gang leader, says the girl is his sister. As the horrified couple watches, the gang drives off. Despite Meera's pleading, Arjun drives after the gang. On a deserted area near the highway, the couple witnesses a brutal honor killing of the young boy and the girl Pinky. Terrified, Arjun and Meera attempt to flee but the gang finds them. As the gang digs graves, Satbir shoots Pinky. A fight ensues and Arjun shoots Chottey, one of the gang members. The gang is enraged and the couple run for their lives.\r\n\r\nAt night, the couple finds themselves face to face with one of the gang members. Arjun gets injured and Meera shoots the gang member dead. They make it to a railway bridge, where Meera tells Arjun to wait till she gets help. She finds a police station where she asks a policeman to help as they have witnessed an honor killing – at the mention of that term, the cop throws Meera out of the station. On the way, a senior police officer meets her in his van and starts driving back to where Arjun is. Meera realises that the police officer is with her attackers. She manages to stab him in his eyes, killing him and drive off, with the gang chasing her. As they find her car, Meera stumbles off and finds a laborer's hut. The laborer and his wife protect her from the gang and advise her to go to the chief of the nearby village.\r\n\r\nMeera reaches the village's Chief Ammaji (Deepti Naval), to whom she tells her story. Ammaji's mood changes the moment she hears of the honor killing and a puzzled Meera looks around to see pillow cover on her lap stiched 'Pinky' on it and a photograph of the dead girl in the room. Ammaji rapidly locks her in the room and calls the gang. As they arrived Ammaji criticized their job and handed Meera over to them. They drag her out and beat her in the courtyard in order to kill her. However, she managed to escape with their car and rushed to the bridge to find Arjun has been murdered brutally by the gang.\r\n\r\nMeera shrieks in grief and rage and returns to the village to avenge Arjun's death, where she drives the jeep ruthlessly into two gang members, killing them. Then she kills other gang members too. Ammaji arrives and gasps, seeing all the men dead. She says Pinky was her own daughter but she broke rules and needed to be punished. Meera echoes her words and leaves the village as dawn breaks.","TrailerLink":"https://www.youtube.com/watch?v=A9icNqWlylw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/A9icNqWlylw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.6,"CensorRating":"A","ReleaseDate":"3/13/2015","Runtime":115,"Budget":130000000,"Revenue":330000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AADF548A35769A1B5EB24AC21CF30844.jpg"},{"Id":"82ef99c5","ImdbId":"tt2872050","OriginalTitle":"Jai Jawaan Jai Kisaan","Title":"Jai Jawaan Jai Kisaan","Description":"Jai Jawaan Jai Kisaan is Hindi movie which pays a tribute to the glorious life of Indian Prime Minister Lal Bahadur Shastri. \"I am feeling excited to know that Doordarshan has decided to broadcast this movie on 22 January 2016, so please do not forget to watch the movie,\" Booker said.\r\n\r\nRenowned theatre actor from Bhopal Akhilesh Jain will essay the role of Lal Bahadur Shastri. While actors like Om Puri, Prem Chopra and Rati Agnihotri will be seen in strong roles of various political leaders. Actor Jatin Khurana also features in the film as Chandrashekar Azad, Ajit Khare as Lal Bahadur Shastri (age 14 to 21 years), Manoj Bhatt as Lal Bahadur Shastri young.\r\n\r\nFilm ‘Jai Jawaan Jai Kisaan’ based on the life of Lal Bahadur Shashtri. The film will be a tribute to India Second Prime Minister.","TrailerLink":"https://www.youtube.com/watch?v=EzhOk-n_Ce8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/EzhOk-n_Ce8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.8,"CensorRating":"U","ReleaseDate":"2/6/2015","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C890FC269DAE3113B60B6B75D71D316C.jpg"},{"Id":"bdee6679","ImdbId":"tt4107858","OriginalTitle":"MSG: The Messenger","Title":"MSG The Messenger","Description":"Guru ji (Gurmeet Ram Rahim Singh) is a spiritual leader who has a huge follower base. He has accepted the challenge of eradicating social evils including drugs and gender-related issues that have been prevailing in the society. Those with vested interests and apathetic towards the welfare of the society are now disturbed as there's someone who has taken control of the situation. They conspire to kill him.","TrailerLink":"https://www.youtube.com/watch?v=scuWiXG5bh8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/scuWiXG5bh8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"2/13/2015","Runtime":197,"Budget":550000000,"Revenue":1200000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3BC2BB0EFE3F0E501166EBD15B3CB219.jpg"},{"Id":"dea93fb0","ImdbId":"tt4594848","OriginalTitle":"Luckhnowi Ishq","Title":"Luckhnowi Ishq","Description":"Prem (Adhyayan Suman) a medical student of Lucknow attend a baraat of his friend's wedding and falls in love with Sunaina (Karishma Kotak). It is love at first sight and Prem wants to marry Sunaina, he even fights her brother Krishna who shares a close bond with his sister Sunaina. Prem swears to marry Sunaina in the next 10 days and does marry her. Prem is depressed and is not able to concentrate on work when Prof. KK (Sharad Saxena) scolds him and later consoles him and asks him to focus on his studies since he is a very bright student and the prof. wants him to top the MBBS exams. At Sunaina’s home every one is very upset and Sunaina decides that she would find Prem and bring him to justice and stop the entire families suffering. She swears that she would only come back once she finds Prem. KK Playing Love guru which gives the movie a pleasant feel.","TrailerLink":"https://www.youtube.com/watch?v=Tm6KZ9DqZt8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Tm6KZ9DqZt8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":1,"Rating":3.0,"CensorRating":"U/A","ReleaseDate":"4/3/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AD1CDC2E5D01E691F4FAF747CDA6BEAF.jpg"},{"Id":"b27a2d9b","ImdbId":"tt5151622","OriginalTitle":"Ranbanka","Title":"Ranbanka","Description":"Rahul Sharma (Manish Paul) who is an engineer working in Mumbai comes to Mathura, a city in Uttar Pradesh with his wife Priya (Pooja Thakur) and child Aayush. When entering the town the driver tells him about the most feared man in Mathura, Raghav (Ravi Kishan) and that he should stay away from him in case they cross paths. Raghav sees Priya one day and falls in love with her. One night when Raghav comes to Priya's house, he demands that she must marry him or else he will kill her husband and child. Rahul deals with Raghav in the rest of the movie.","TrailerLink":"https://www.youtube.com/watch?v=fhWKUb_QfwA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/fhWKUb_QfwA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":12,"Rating":2.95,"CensorRating":"U/A","ReleaseDate":"11/6/2015","Runtime":98,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F82CE6048F24BEA1ED29DE953D489439.jpg"},{"Id":"91fc1a3c","ImdbId":"tt3547616","OriginalTitle":"All Is Well","Title":"All Is Well","Description":"A musician finds himself on the run from a group of thugs with his friend and his estranged parents.","TrailerLink":"https://www.youtube.com/watch?v=wlyc0NxmRYs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wlyc0NxmRYs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":9,"Rating":2.17778,"CensorRating":"U/A","ReleaseDate":"8/21/2015","Runtime":126,"Budget":280000000,"Revenue":371000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A174964738C58BF7E13D16C9E342FA58.jpg"},{"Id":"c6519416","ImdbId":"tt3449292","OriginalTitle":"Manjhi The Mountain Man","Title":"Manjhi The Mountain Man","Description":"In the 1960s Dashrath Manjhi (Nawazuddin Siddiqui) lived in a small village Gehlaur near Gaya, Bihar, India with his family including his wife Phaguniya Devi (Radhika Apte). There was a rocky mountain near his village that people either had to climb across or travel round to gain access to medical care at the nearest town Wazirganj. One day Manjhi's wife fell while trying to cross the mountain, after which Manjhi decided to carve a road through it. When he started hammering the hill people called him a lunatic but that only steeled his resolve further. After 22 years of back-breaking labour, Manjhi carved a path 360 feet long, 25 feet deep in places and 30 feet wide.","TrailerLink":"https://www.youtube.com/watch?v=I9KAoTQlEWs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/I9KAoTQlEWs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":19,"Rating":4.02895,"CensorRating":"U/A","ReleaseDate":"8/21/2015","Runtime":120,"Budget":85000000,"Revenue":101700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2ED7E06409811B548496348B943698EB.jpg"},{"Id":"139c686e","ImdbId":"tt3483612","OriginalTitle":"Hamari Adhuri Kahaani","Title":"Hamari Adhuri Kahaani","Description":"Five years after the mysterious disappearance of her husband, a woman becomes romantically involved with a wealthy hotelier and together they confront her past.","TrailerLink":"https://www.youtube.com/watch?v=2fiT_TJlySk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/2fiT_TJlySk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.25,"CensorRating":"U/A","ReleaseDate":"6/12/2015","Runtime":129,"Budget":350000000,"Revenue":412300000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5725087DDF5C0D277F2BAAB3B57B0D76.jpg"},{"Id":"cdc40269","ImdbId":"tt4500734","OriginalTitle":"Ek Paheli Leela","Title":"Ek Paheli Leela","Description":"The movie starts with Karan (Jay Bhanushali) moving to a new house in Mumbai along with his friends. Karan is a singer and musician who often helps his sister Radhika with music for her fashion shows. Radhika (Shivani Tanksale), is a fashion photographer who wants to get Meera (Sunny Leone) for her shows with the help of her friend Andy (VJ Andy). They both discover that Meera is afraid of travelling in an aeroplane, but take her to India through aeroplane by making her drink. Meera discovers the truth and gets angry. Meanwhile, her mood changes as she sees rajasthani girls playing a traditional game and starts to play with them.\r\n\r\nMeanwhile in Bombay, Karan has persistent dreams of someone whipping him. In an attempt to figure why, his friend takes him to a Pandit (Nadi-Shakti Scholar) who tells him that his pain is rooted in his past life.\r\n\r\nWhile in India, Meera meets Ranveer Singh (Mohit Ahlawat), a Rajput prince, in Rajasthan. The two eventually fall in love and get married. Ranveer is in middle of a property dispute with his cousin Bikram Singh (Jas Arora).\r\n\r\nKaran travels through his past and figures out that he was Shravan (Rajneesh Duggal), 300 years ago. He was in love with a girl named Leela (also played by Sunny Leone) but his master, an artist, Bhairao (Rahul Dev) adopts her as his muse. Bhairao makes a statue of Leela and discovers that Leela is in love with Shravan. In a fit of rage, Bhairao kills both Shravan and Leela.\r\n\r\nKaran goes to Bhairao Virajana (a place of dispute between Ranveer and Bikram). Karan tries to remind Meera about their past but Meera does not believe him. Karan plays a song \"Tere Bin\" that takes Meera back into their past and she recollects her past life.\r\n\r\nMeera and Karan get kidnapped by Bikram who is looking for a statue that Bhairao made. The current market value of the statue is 10 billion and Bikram wants to keep the money for himself. Karan reveals that the statue was hidden behind a wall. When Bikram gets to the statue, he is killed by Ranveer.\r\n\r\nIt turns out Karan was wrong all along. He was actually the reincarnation of Bhairao and not of Shravan (who got reincarnated in Ranveer). Karan tries to redeem his ills by committing suicide but Meera and Ranveer don't let him. Karan's album \"Tere Bin\" gets him fame. Meera and Ranveer unite.","TrailerLink":"https://www.youtube.com/watch?v=azRVCV2k3Uc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/azRVCV2k3Uc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"4/10/2015","Runtime":145,"Budget":150000000,"Revenue":2657000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/74938CCEE86580AD0620CCAA29038A28.jpg"},{"Id":"05e35705","ImdbId":"tt4333674","OriginalTitle":"Hunterrr","Title":"Hunterrr","Description":"Mandar Ponkshe (Gulshan Devaiah), a typical youth, is a sex addict and a player. Now his in his early 30s, he is only interested in 'scoring' one night stands while his friends are all married with kids. The movie opens with one such scene where his friends tell him to get married as he too old to screw around. In his turn, Mandar explains his philosophy about sex as a purely physical act, somewhat akin to the satisfaction of the 'perfect' bowel movement. He feels that love is a different ball game and isn't necessary for sex. He is later shown attempting to pick up a young girl at a bar, but is chased away by the girl's male companions.\r\n\r\nThe narration now moves back several decades to Mandar's early teenage years. The year 1989, Mandar along with his cousin Dilip (nicknamed Yusuf) visits his village in Maharasthra where their cousin Kshitij is already waiting for them. 15 year old Kshitij is studying in a military school and is mature beyond his years in his views and aspects about marriage, love and sex. By the end of their vacation Mandar realises that he is no longer a kid. His life becomes more exotic as he starts to woo girls, watching adult films and fantasizing about ladies.\r\n\r\nLater in the year 1995, Mandar is now grown up and he is an engineering student in Pune. There also he is accompanied by his cousins Dilip and Kshitij; the latter is an army officer by now. Mandar stars, Parul (Veera Saxena) only for having sex with her.While making out in the hostel room, they get caught by the warden and Mandar gets expelled from the hostel, leading him to rent a small flat. There he meets a beautiful housewife Jyotsna (Sai Tamhankar) and sets his sights on her. The dapper Kshitij, in the meanwhile, beds a steady parade of stunning girls at Mandar's flat. In a side plot, one of Kshitij's many girlfriends has a friend Anju who is being sexually abused by her own father. Incensed on learning of this heinous act, Kshitij beats up the father and takes Anju` and her kid brother away and even helps them. The ordinary looking Anju has a maturity and strength that gradually makes Kshitij fall in love with her. In an amusing scene, Mandar and Dilip talk about how Kshitij didn't fall for any of the pretty girls he was seeing, but fell in love with a plain girl. They both conclude that love is blind. Kshitij marries Anju and they eventually have a son.\r\n\r\nGetting back to Mandar's dalliance with Jyotsana, their casual flirting gradually reaches a point where they start an affair. Hers is a sexless marriage as she's married to an obese, buffoonish man named Deepak. Jyotsna needed sexual fulfillment which she finds later in Mandar. Their furtive affair carries on for a while, Jyotsana visiting Mandar's flat from time to time, before Deepak finds out. Once again Mandar is forced to shift residences and finally ends up staying with Dilip. In 1996, Mandar meets Parul again in order to keep in touch with her and is left heartbroken when he finds her with another guy, Alok.\r\n\r\nAfter college, Mandar is shown working in software and is involved in a booty call arrangement with an older married woman who goes by Savita Bhabhi. After years of loveless one night stands, he takes Dilip's advise and decides to meet some girls through matrimonial sites. His strategy of being honest about his past affairs upsets most potential matches who are orthodox, stuck-up girls. When he finally meets Tripti (Radhika Apte), he is so smitten by her that he decides not be honest, but instead projects a whiter-than-snow image. This almost backfires, as Tripti turns out to be a very open-minded girl who has no hang-ups about her own past and admits to having been in relationships before. Now stuck in a lie, Mandar has to continue projecting himself as an orthodox man. All the same, the two continue to meet and start liking each other.\r\n\r\nIn the due course, Kshitij is martyred in an encounter with insurgents in Kashmir. Mandar again is left heartbroken from losing his cousin and friend. This incident brings Tripti close to him as she comforts him. They eventually get engaged, but Mandar is having a tough time with the idea of monogamy. He has one last encounter with Savita Bhabhi. Worst still, while on an errand to pick up a distant relative from the airport, Mandar assumes that the person hasn't turned up and instead tries to pick up an attractive woman who turns out to be the distant relative. Embarrassed and shamed, Mandar barely gets out of the situation by the skin of his teeth.\r\n\r\nAt this point, Tripti's ex-boyfriend Chaxx Suraj Jagan enters the equation. Cool, suave and charming, Chaxx is all that Mandar is not. That, and Tripti's history with Chaxx trouble him no end and make him insecure to the point where he assumes that Tripti is leaving him for Chaxx. Mandar decides to confess the truth about his sex obsession to Tripti and does so. Tripti also reveals that she got pregnant when she was with Chaxx and there is nothing between him and Tripti now as they broke up. Tripti makes it clear to Mandar that Chaxx abandoned her when she needed him the most and therefore she can never take him back. She also tells him that Mandar is her present and she wants a future with him.\r\n\r\nFinally, Mandar becomes very happy as he is getting married to the girl he loved and he tells all the mishaps happened between him and Tripti to his cousin, Dilip.","TrailerLink":"https://www.youtube.com/watch?v=ytDp30vuiCo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ytDp30vuiCo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":14,"Rating":3.45,"CensorRating":"A","ReleaseDate":"3/20/2015","Runtime":141,"Budget":60000000,"Revenue":135000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/80434AC5EFE795CC354A8611CB559527.jpg"},{"Id":"faa019e0","ImdbId":"tt4511416","OriginalTitle":"Badmashiyaan","Title":"Badmashiyaan","Description":"Badmashiyaan is a 2015 Hindi romantic comedy film.\r\n\r\nCafe owner Dev’s girlfriend Nari left him the night he meant to propose to her. Months later, he meets Palak, a young woman living next door, during a bank hold-up. Dev’s friend Pinkesh, a private investigator, has been trying to track down Nari for him. He finds that she is living with Don Jassi, a reformed gangster.","TrailerLink":"https://www.youtube.com/watch?v=w88ybSgyERQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/w88ybSgyERQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.6,"CensorRating":"U/A","ReleaseDate":"3/6/2015","Runtime":132,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/64528792744D1D715C16FBE37F1550A2.png"},{"Id":"3aeead26","ImdbId":"tt4271730","OriginalTitle":"Alone","Title":"Alone","Description":"The movie starts on a stormy night in Kerala. A large tree branch falls and breaks the roof of an outhouse, releasing a dark entity. The woman inspecting the outhouse ends up in a hospital suffering from a coma.\r\n\r\nIn another town, the woman's daughter, Sanjana (Bipasha Basu), and her husband, Kabir (Karan Singh Grover), argue about not being able to celebrate her birthday together. Sanjana gets a call about her mother's accident and they quickly fly to Kerala. In Kerala, Sanjana begins having visions that make her believe her dead conjoined twin's soul is after her. Her husband does not believe her, and sends her to his former professor for spiritual healing.\r\n\r\nDuring the treatment period, she tells the professor about how her conjoined twin sister Anjana (Bipasha Basu) always hated that Kabir liked Sanjana more than her. In fact, it was when Kabir told Sanjana that he was coming back home from abroad that Sanjana decided to separate from Anjana. It was during this operation that Anjana died, and Sanjana blames herself for her sister's death. The professor reassures Sanjana that her visions of Anjana is the result of her guilt and only a figment of her subconscious.\r\n\r\nAt her mother's place that night, Sanjana is forced into the outhouse by an unseen entity. Hearing noises, Kabir wakes up and finds her unconscious in the outhouse. When Sanjana awakes, she is possessed by Anjana's soul. After this, Sanjana/Anjana can't get enough of Kabir. When the professor meets her again, he feels there is something wrong and tells Kabir to keep an eye on her, which she overhears.\r\n\r\nThe caretaker suggests that a ritual be performed on Sanjana/Anajana. After the ritual, Anjana's stronghold on Sanjana escalates and her true colors are shown, resulting in an exorcist being called in.\r\n\r\nDuring the exorcism, Anjana reveals that she was murdered. As she leaves Sanjana's body, she urges Kabir to discover the truth of her death. After Sanjana wakes up, Kabir threatens to leave her. Sanjana tells him that years ago when he called her to tell Anjana that he was coming home, Anjana lost her mind and tried to kill her because she had feelings for Kabir too. In self-defense, Sanjana hit Anjana on the head with a glass music box, killing her. Their mother covered the truth to protect her daughter. After consulting with the professor, they try to find and burn the last possession of Anjana and set her soul free.\r\n\r\nSanjana, Kabir, the caretaker, and her daughter-in-law all follow the music leading to the outhouse. Under the floor, they find Anjana's corpse. The caretaker and her daughter-in-law go inside to get kerosene with which to burn the body. The two of them die at the hands of Anjana's soul. The professor arrives at the outhouse with kerosene, but is possessed by Anjana and tries to attack Sanjana. While Kabir fights him, he finds the locket he gave to Sanjana when they were young on Anjana's dead body. When he confronts Sanjana, she confesses that she is actually Anjana. She tells him that she killed Sanjana with the music box and took her sister's place so she could be with Kabir. Outraged, Kabir decides to leave her despite her pleas that she loves him. Sanjana (now revealed to be Anjana) hits him on the head with a chair to stop him from leaving. As the burning roof begins to fall, Sanjana's soul traps Anjana, saving Kabir and the professor.","TrailerLink":"https://www.youtube.com/watch?v=e0pdoezNhmc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/e0pdoezNhmc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"1/16/2015","Runtime":133,"Budget":180000000,"Revenue":250000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/FC94C24DF1258B3A5E65D857616AD19A.jpg"},{"Id":"7dbf9623","ImdbId":"tt3159708","OriginalTitle":"Welcome Back","Title":"Welcome Back","Description":"A large portion of Welcome Back was shot in the United Arab Emirates. It is the first Bollywood film to be shot inside the Emirates Palace in Abu Dhabi. \r\n\r\nA pair of reformed gangsters try to find a husband for their newly discovered sister, but complications arise due to mistaken identities.\r\n\r\nUday Shetty and Majnu Bhai have left the underworld, and are now big businessmen. Two women, Chandni and Maharani, enter their life. Chandni is the new love in Uday Shetty and Majnu's life and both friends dream of tying the knot with her. However, Appa - Uday's father, plays spoilsport by bringing in his other daughter, Ranjana. He tells Uday Shetty to get her married to someone from a good family. Maharani puts a condition that only after her sister is married, will Chandni will marry one of them. Now, a search to find a suitable husband for Ranjana starts.","TrailerLink":"https://www.youtube.com/watch?v=SIKfSPbsuyw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/SIKfSPbsuyw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"9/4/2015","Runtime":152,"Budget":880000000,"Revenue":1332600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/469D281C2CD7B163432C41F925BC8ADC.jpg"},{"Id":"4f456f38","ImdbId":"tt4309284","OriginalTitle":"The Silent Heroes","Title":"The Silent Heroes","Description":"The film, Silent Heroes, is based on the story of 13 real deaf children who through mountaineering want to prove that they are different but not disabled. The Leader who never considered the deaf children as capable and equal and discouraged them all through the course gets badly injured in an accident. This might be an end to Children dreams of scaling Himalayan peaks and proving their worth in front of the outside world. Now it is for these deaf children to show their skills, presence of mind and courage to save their Leader and prove their worth.","TrailerLink":"https://www.youtube.com/watch?v=HlM5FwY7iWo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/HlM5FwY7iWo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Adventure","RatingCount":14,"Rating":3.5,"CensorRating":"U","ReleaseDate":"12/11/2015","Runtime":115,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/40E072451C27941D15A393DAB473B099.jpg"},{"Id":"31fc0399","ImdbId":"tt4535650","OriginalTitle":"Dilwale","Title":"Dilwale","Description":"Dilwale is a 2015 Indian romantic action comedy film directed by Rohit Shetty, and produced by Gauri Khan and Rohit Shetty under the banner of Red Chillies Entertainment and Rohit Shetty Productions respectively. The film stars Shah Rukh Khan, Kajol, Varun Dhawan, and Kriti Sanon in lead roles, with Johnny Lever and Varun Sharma in supporting roles. The children of two competing families meet again after a 15-year separation.","TrailerLink":"https://www.youtube.com/watch?v=AHuOo1DLcRc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AHuOo1DLcRc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":3.06154,"CensorRating":"U/A","ReleaseDate":"12/18/2015","Runtime":158,"Budget":1000000000,"Revenue":3810000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8591DBDA8CD657EB488F726CCF2C3589.jpg"},{"Id":"b2117ac7","ImdbId":"tt3735246","OriginalTitle":"Bajirao Mastani","Title":"Bajirao Mastani","Description":"Bajirao 1, who fought over 41 major battles and many others, is reputed never to have lost a battle. Bajirao is described as \"RANMARD\" a man of the battlefield. Bajirao said to his brother \"Remember that night has nothing to do with sleep. It was created by God, to raid territory held by your enemy. The night is your shield, your screen against the cannons and swords of vastly superior enemy forces. \" Bajirao was a heaven born cavalry leader. In the long and distinguished galaxy of Peshwas, Bajirao was unequaled for the daring and originality of his genius and the volume and value of his achievements.","TrailerLink":"https://www.youtube.com/watch?v=eHOc-4D7MjY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/eHOc-4D7MjY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":24,"Rating":3.87499,"CensorRating":"U/A","ReleaseDate":"12/18/2015","Runtime":156,"Budget":1250000000,"Revenue":2698700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1C17368BF1BE4581873BD78232B279FA.jpg"},{"Id":"dcfd0cee","ImdbId":"tt4865436","OriginalTitle":"Hate Story 3","Title":"Hate Story 3","Description":"The story is about Aditya and Siya Singh who control the family business after the sad demise of Aditya's elder brother Vikram. Suddenly, an unknown businessman named Saurav Singhania enters their lives. Saurav, who shows interest in Aditya's company, makes them an unbelievable offer. What follows is Aditya and Siya's struggle to to uncover Saurav's real intentions. The erotic revenge thriller takes the audience through relationships, love, hatred and vengeance.","TrailerLink":"https://www.youtube.com/watch?v=o1Y7XhiWUvo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/o1Y7XhiWUvo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":9,"Rating":2.25,"CensorRating":"A","ReleaseDate":"12/4/2015","Runtime":132,"Budget":132000000,"Revenue":550000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F7EDA93499B3AAC1E404FD6707F34407.jpg"},{"Id":"fe23a24c","ImdbId":"tt3261022","OriginalTitle":"Kajarya","Title":"Kajarya","Description":"Set in the present times against two backdrops. New Delhi with its shining buildings and apparent cosmopolitan veneer, thinly veils an underbelly of crimes against women and corruption at all levels. And a small village just 80 kilometers from New Delhi that is stuck in a time warp. Kajarya a woman in her early thirties has a strange but important place in the village social structure; she murders unwanted girl infants in the garb of religion. Meera is a rookie reporter. She breezes into the village and the villagers feed her the story of Kajarya being a demonic baby killer. The story is juicy and one sided. Meera gets the front page of the newspaper. Kajarya goes to jail.","TrailerLink":"https://www.youtube.com/watch?v=8_1jBPqL9K8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/8_1jBPqL9K8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.8,"CensorRating":"U/A","ReleaseDate":"12/4/2015","Runtime":132,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0262DBD3E655927292E2FA5C90EF7EDF.jpg"},{"Id":"99cda30c","ImdbId":"tt4467202","OriginalTitle":"Hero","Title":"Hero","Description":"Sooraj Kaushik (Sooraj Pancholi) is a gangster from Mumbai who meets Radha Mathur (Athiya Shetty), daughter of the city's Chief of Police, IG Shrikant Mathur, during a party. Sooraj, under instructions from his gangster father, Suryakant 'Pasha' Ranade (Aditya Pancholi), kidnaps Radha because Shrikant (Tigmanshu Dhulia) brought evidence against Pasha in court, and kidnaps Radha in the guise of a police officer, by telling her that he received instructions from the police to take her away from city as there is a threat that Pasha and his gang will kidnap Radha unless they move for some time. During these days they slowly fall in love. One day the police tracks them and Sooraj and Radha escape but Sooraj is shot in the arm when trying to jump over a broken bridge and they both fall in water . Later they are rescued by a colony of monks but the world thinks both are dead. Sooraj, who was badly injured remained unconscious long after Radha woke up. After a couple of days when Radha talks about her love for him she finds Sooraj is awake. Later he confesses to Radha that he had kidnapped her. Radha has however fallen in love with Sooraj. Radha asks Sooraj to surrender and Sooraj is sent to jail for 2 years . During that time Radha's brother Dheeraj (Sharad Kelkar) asks her to go to Paris .\r\n\r\nOne and a half years later, the court reduces Sooraj's sentence on grounds of good behaviour. Sooraj is out of jail and is ready to start a new life with Radha but to live a life he needed to earn. So he starts a fitness centre for living with support from Radha and Dheeraj. Then Dheeraj introduces Ranvijay (Vivan Bhatena) his junior, who is a smuggler, and a helper of Pasha but shows them that he is innocent. He is liked by Radha's family and Shrikant decides to tie Ranvijay and Radha into the knot. But Ranvijay, being Pasha's henchman, intends to break Radha's and Sooraj's love. Radha and Sooraj tell Radha's family about what happened, how they met and how they fell in love, but her father still refuses to accept Sooraj as he was a goon. One night Ranvijay stabs Sooraj, who loses consciousness.\r\n\r\nLater, in the morning, Pasha arrives intending to kill Radha and Sooraj but seeing their love for each other, leaves them unharmed. But Ranvijay still holds grudge against Sooraj. A fight ensues and Ranvijay is shot by Radha's father. Radha's father accepts Sooraj and they get married and live a happy life.","TrailerLink":"https://www.youtube.com/watch?v=0B5pRrXWFkI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/0B5pRrXWFkI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":8,"Rating":1.8,"CensorRating":"U/A","ReleaseDate":"9/11/2015","Runtime":145,"Budget":0,"Revenue":290000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/88FBDBA19692CF79C4F1C6C30E21685A.jpg"},{"Id":"a5e2301c","ImdbId":"tt5207116","OriginalTitle":"X: Past Is Present","Title":"X Past Is Present","Description":"X - Past is Present is a 2015 Indian collaborative feature film directed by a team of eleven filmmakers including Abhinav Shiv Tiwari, Anu Menon, Nalan Kumarasamy, Hemant Gaba, Pratim D. Gupta, Q, Raja Sen, Rajshree Ojha, Sandeep Mohan, Sudhish Kamath and Suparn Verma. It will feature actor-director Rajat Kapoor and Anshuman Jha in the lead. X is not an anthology,but one whole story with the eleven directors making sections of it. The film has been produced by Manish Mundra and has been announced for a nationwide release in India on 20 November 2015.","TrailerLink":"https://www.youtube.com/watch?v=jbNNBHImphg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/jbNNBHImphg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Mystery","RatingCount":12,"Rating":2.8,"CensorRating":"U/A","ReleaseDate":"11/20/2015","Runtime":105,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/505C4D4ED3A4F5882F40BDB4F27A1B1A.jpg"},{"Id":"aaf5971f","ImdbId":"tt3148502","OriginalTitle":"Tamasha","Title":"Tamasha","Description":"Tamasha tells the story of an individual who loses his self by living according to the social conventions expected of him.Based in France, this unusual fairy tale unfolds the lives of a nomad and a tourist who gradually develop fondness for each other as they orchestrate 'Tamashas' all across the island. In detail Tamasha story is as follows...\r\n\r\nThe film opens with Ved Vardhan Sahni (Ranbir Kapoor) as an adult and Tara Maheshwari (Deepika Padukone), who are in a spectacle which shows of the monotonous life of a person in the corporate world.[clarification needed] A scene in the spectacle turns to a flashback in Shimla where younger Ved Vardhan Sahni (Yash Sehgal) and his father (Javed Sheikh) return to home from school. As a child, Ved is fascinated by the stories narrated by a road side story teller (Piyush Mishra) who keeps mixing up his characters.\r\n\r\nIn the present, the film moves to Corsica where Tara meets adult Ved. However, they have a verbal pact to keep their real identities undisclosed. They explore the island together. They make conversations as \"Don\" and \"Mona Darling\". Running out of money, they put up a spectacle at an expensive restaurant. As Tara is set to leave for India, she is lovelorn despite a romantic friendship with Ved. The story flashes back to young Ved who questions the story-teller about the reason for happy times ending up quickly.\r\n\r\nTara returns to Kolkata in India and her routine life is shown through the song \"Heer To Badi Sad Hai\". Tara's father (played by Nikhil Bhagat) hands over his tea business to Tara so that she starts a line of tea boutiques, taking the company ahead.[6] She is off to Delhi for work and four years have passed. Once upon a day, Tara surprisingly meets the adult Ved, who is now a product manager. They reveal their original identities. She makes an attempt to move ahead of the unrequited love by fixing a dinner with Ved at a Japanese restaurant. She expects him to talk like the days in Corsica but Ved talks about business. She calls Ved up home to be intimate. Ved leaves for his home and next morning Ved wakes up on time, completes the morning chores, wipes the car, ignores the eunuch on the way, lets a female colleague into the lift—all this happens on his way to the office. He fixes a plan for meeting Tara again in the evening. The evening to evening incidents repeat monotonically.\r\n\r\nIt is Ved's birthday when he proposes Tara but she is unhappy with a changed Ved after his arrival from Corsica. She declines the proposal. Ved leaves for his home by an auto-rickshaw driver (played by Ishteyak Khan) who narrates how his dreams of becoming a singer were crushed.\r\n\r\nThe film goes in flashback, scene in Shimla, where Ved tells his weakness in Mathematics and doesn't wish to do engineering. His Dad narrates him that he had to give up his interest for flute playing to support his family after they moved to Shimla from Lahore post the Partition of India.\r\n\r\nThe film comes back to present day Delhi where he starts telling his life story to some local people in search of answers and certain flashback scenes of Shimla are shown where Ved leaves Shimla to pursue engineering. Ved, due to his split personality[7] ends up upsetting his boss by non-sensical business meeting performance. The story returns to Tara's door where Ved puts up his frustration at Tara. Tara promises him to help him come out of his divergent behaviors but he leaves.\r\n\r\nThe next day, Ved continues his office routine with a change, now giving the diamond ring to the eunuch. Ved comes back to Shimla and revealing his joblessness. After a quarrel with his father, Ved gains introspection from a reflection in the mirror where he realizes that to complete his own story, he needs to meet the same story-teller. The story-teller criticizes Ved's regression, compelling him to complete his own story. Ved narrates his life story to his family members. Moved by this, his father lets Ved pursue his interest.\r\n\r\nVed returns to Delhi and takes the diamond ring back from the eunuch. Tara, after finishing a business meeting at Oracle in Tokyo, she heads for refreshment where she finds a note titled \"Don Returns\". Perplexed about Ved's presence, she moves around the office campus where Ved draws her attention as the disguised \"Don\" in Corsica.\r\n\r\nThe film goes into a flashback and shows scenes from Shimla of a free spirited-young Ved, a college going Ved and an adult Ved. The film returns to present day (first scene of the film) where Ved and Tara complete the process of putting up a show on stage (in continuation of the opening scene of the film) through the spectacle which is the complete story of the film on presented on the stage.","TrailerLink":"https://www.youtube.com/watch?v=VN_qxutU_qc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/VN_qxutU_qc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.7,"CensorRating":"U/A","ReleaseDate":"11/27/2015","Runtime":139,"Budget":650000000,"Revenue":1061800000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4FF8C4CDB4DBF9383B25AAD0EE3729BE.jpg"},{"Id":"59f74be6","ImdbId":"tt3368222","OriginalTitle":"Angry Indian Goddesses","Title":"Angry Indian Goddesses","Description":"Freida invites her all girls group of friends to Goa at her family home. They are all in for a surprise when she tells them all that she's getting married. The announcement sets off a chain of reactions, letting out hidden secrets.","TrailerLink":"https://www.youtube.com/watch?v=dIdxxvph-Vw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/dIdxxvph-Vw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.7,"CensorRating":"U/A","ReleaseDate":"12/4/2015","Runtime":115,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/05212BD67449402B2A757388DC34C256.jpg"},{"Id":"41b1b216","ImdbId":"tt4921860","OriginalTitle":"MSG 2 the Messenger","Title":"MSG 2 The Messenger","Description":"MSG 2 The Messenger is based on true events of Dera Sacha Sauda in years 2000-2001. Although the main story line is true, action & comedy is added for entertainment. Saint Gurmeet Ram Rahim Singh Insan plays plays to be a warrior fighting against the wild & primitive lifestyle of tribal and succeeding in turning them into civilized human beings.","TrailerLink":"https://www.youtube.com/watch?v=2OxIWWcPgxc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/2OxIWWcPgxc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":17,"Rating":2.8,"CensorRating":"U/A","ReleaseDate":"9/18/2015","Runtime":134,"Budget":0,"Revenue":40000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/05D3EACFD361F0DA72E1DB24CFA81FBA.jpg"},{"Id":"73eb4768","ImdbId":"tt4513812","OriginalTitle":"Gour Hari Dastaan","Title":"Gour Hari Dastaan","Description":"Gour Hari Das, a freedom fighter who works in Khadi Kraft and lives along with his wife & son, lives a content life in his neighborhood. However, one day when his son is unable to secure college admission for lack of a Freedom Fighter's Certificate, he feels the need to establish his identity. In the quest for this piece of paper to prove his authenticity to his son, his neighbors & to the world, he begins a journey that sucks up almost his entire life.","TrailerLink":"https://www.youtube.com/watch?v=OqpHsT41CM4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/OqpHsT41CM4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":18,"Rating":4.03889,"CensorRating":"U","ReleaseDate":"8/14/2015","Runtime":114,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7057672AF11628E32A53655D357ADE2C.jpg"},{"Id":"dd0d32ae","ImdbId":"tt4760900","OriginalTitle":"Aisa Yeh Jahaan","Title":"Aisa Yeh Jahaan","Description":"The film is set in Mumbai. It depicts the relationship between a husband and wife, the ever growing human detachment with nature and people's attitude towards the physiology of a child's growth which is portrayed in a lighthearted yet satirical fashion.[2] Rajib, works for a multinational company and is far apart in terms of his nature from his wife, Ananya, who is a receptionist at a private firm. On the other hand, Kuhi, their three-year-old daughter, and Pakhi, the domestic help of the house, share a relationship based on innocence and pure emotions. Pakhi takes good care of Kuhi when Rajib and Ananya are away at work during the day.The whole family plans a vacation to their hometown in Assam. There, Kuhi gets to know Nalia Kai, the helper of the house, who introduces her to a new world – a world of trees, birds, greenery, paddy fields and the environment at large. There she realizes the difference between the concrete world of Mumbai and the natural environment of her father's hometown. She also fears that one day the people of Mumbai would not have air to breathe, as she learns that we get oxygen from trees. This compels her to question the scarcity of trees in Mumbai.","TrailerLink":"https://www.youtube.com/watch?v=6tC7wgEAna0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/6tC7wgEAna0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"7/24/2015","Runtime":129,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2A9E375E33725ECA4EAFAFA00ABA1E23.jpg"},{"Id":"68eb7638","ImdbId":"tt4760750","OriginalTitle":"Bezubaan Ishq","Title":"Bezubaan Ishq","Description":"The film has been shot in various parts of India like Jaipur, Jaisalmer and Mumbai. The film is set in a modern milieu with traditional Indian backdrop and values. It revolves around three friends and their families. Mansukh Patel is an NRI business tycoon residing with his British wife, Lisa and daughter Rumzum in London, UK. The Patels live in the United Kingdom but haven't forgotten their Indian tradition and values. Mansukh's younger brother, Rashmikant lives in Mumbai with his daughter, Suhani. Having lost his wife Rekha early in life, Rashmikant is a protective father and pampers Suhani with all her demands, and so does his mother, Savitri. Rashmikant's childhood friend, Vipul is also his business partner. He lives with his wife, Laxmi and son, Swagat. Suhani and Swagat have been childhood sweethearts. Suhani is a open-hearted girl while Swagat is more subdued in nature. He also plays an important role in Suhani's life. Swagat is bowled over by Rumzum's simplicity, pure innocence, beauty and her nature. Whereas, Suhani is madly in love with Swagat. Will Swagat marry Suhani and live happily ever after or will he find true love in Rumzum? Jashwant Gangani's Bezubaan Ishq unravels the beautiful story of unspoken love and sacrifice with pure characters from real life.","TrailerLink":"https://www.youtube.com/watch?v=RPygTLo1Bsg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/RPygTLo1Bsg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.65,"CensorRating":"U","ReleaseDate":"7/3/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/09694830B3468ED77722AD1300585441.jpg"},{"Id":"6f473770","ImdbId":"tt4541102","OriginalTitle":"Uvaa","Title":"Uvaa","Description":"Ram, Anil, Vikram, Salmaan and Deenbandhu are the rebellious brats of suburban Delhi NCR, with the world at their feet and nothing to worry they stomp everything in their path without knowing the consequences, but challenge lay ahead when all of them are put in a totally new world of convent school, here they survive and thrive only to find love. But one night they encounter a horrifying event which puts them in the hands of law. Their lives change forever, they have to fight for justice and moral integrity to make an example for the world.","TrailerLink":"https://www.youtube.com/watch?v=e9vnNUFlblc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/e9vnNUFlblc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":14,"Rating":3.4,"CensorRating":"U/A","ReleaseDate":"6/26/2015","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1DD3761FCDCF4BB677C1B62803ACD1C0.jpg"},{"Id":"864ea870","ImdbId":"tt4707940","OriginalTitle":"Miss Tanakpur Haazir Ho","Title":"Miss Tanakpur Haazir Ho","Description":"Miss Tanakpur is a political satire that unfolds in the backdrop of a Love-story set in a village of Haryana. In the villages of Haryana the Pradhans in general have insurmountable powers. The Pradhan of Tanakpur, Sualal Gandas is no different. Like his contemporaries, Sualal rules his village using powers vested upon him by Khap. Not just the traditional court but when time comes Sualal manages to manipulate and exploit the bigger powers of the state i.e. the Police and the Law of the land. Ms Tanakpur is Sualal's Buffalo. She had won the Beauty pageant for Buffaloes in the Local fair. She had won the trophy because she produced more milk than all other Buffaloes in the contest. Serendipity will strike in this story. Ms Tanakpur thy name is justice.","TrailerLink":"https://www.youtube.com/watch?v=qtg99-HNBmI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/qtg99-HNBmI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":13,"Rating":2.59231,"CensorRating":"U/A","ReleaseDate":"6/26/2015","Runtime":120,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6DAD4C2D2BF6B38EAA6E35BF15A0A093.jpg"},{"Id":"3da85ff4","ImdbId":"tt5154096","OriginalTitle":"Love Exchange","Title":"Love Exchange","Description":"Love Exchange is a romantic journey of a culturally opposite couple -Siddharth Sathe and Shanoo Kapoor. They meet at their work place, become good friends and ultimately fall in love. Things are fine till they decide to get married.\r\n\r\nLove Exchange is a romantic journey of a culturally opposite couple -Siddharth Sathe and Shanoo Kapoor. They meet at their work place, become good friends and ultimately fall in love. Things are fine till they decide to get married. Sid and Shanoo belong to two different cultural backgrounds of India. Sid, a Marathi boy, and Shanoo, a Punjabigirl.Coming from different backgrounds, little did they know that their love would face a cultural tornado ahead. Before they could confront their love in front of their parents, the parents are all set to separate the love birds due to the cultural clash. Mr. Sathe (Sid's father) and Mr. Kapoor (Shanoo's father) get together as a team and intentionally set a condition for them to stay at each others house for 3 months to have a better understanding of the culture. To be together for life, there lies a tough battle ahead for the couple. For it is easy to fight and rebel, but much harder to convince.","TrailerLink":"https://www.youtube.com/watch?v=1_U4q6wxH5Y","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/1_U4q6wxH5Y\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":10,"Rating":2.5,"CensorRating":"U/A","ReleaseDate":"10/30/2015","Runtime":122,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E0C6F55A5513E8845C68674586F32486.jpg"},{"Id":"3c1859c3","ImdbId":"tt3255586","OriginalTitle":"P Se PM Tak","Title":"P Se PM Tak","Description":"A satirical drama on Indian politics wherein, Kasturi(Meenakshi Dixit), a prostitute(p) who gets caught up in politics and as the title says, contests for Prime Minister's seat.","TrailerLink":"https://www.youtube.com/watch?v=iDXBe7n5BZE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/iDXBe7n5BZE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":13,"Rating":2.73846,"CensorRating":"U/A","ReleaseDate":"5/29/2015","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/05BCB450575902C39EB5A5FBA3EA4B7D.jpg"},{"Id":"507438ee","ImdbId":"tt4610308","OriginalTitle":"Ishqedarriyaan","Title":"Ishqedarriyaan","Description":"Ishqedarriyaan is a story about love, sacrifice, family values and relationships. Rishteydarriyaan means relationships and Ishqedarriyaan signifies the relationship when you fall in love! The movie stars Mahaakshay Chakraborty, Evelyn Sharma and Mohit Dutta. Evelyn Sharma is the lead actress, who will play the character of Luvleen, a teacher by profession who wants to collect donations for her grandfather's school. Mahaakshay Chakraborty plays Aagam Diwan, a millionaire who loves his profession more than anything else. Mohit Dutta will play Arjun, a passionate singer.","TrailerLink":"https://www.youtube.com/watch?v=i_F6LCSaEeI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/i_F6LCSaEeI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.65,"CensorRating":"U/A","ReleaseDate":"5/15/2015","Runtime":135,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/CC35242394B87D8C944EF080E1426185.jpg"},{"Id":"c1b00139","ImdbId":"tt4718678","OriginalTitle":"I Love Desi","Title":"I Love Desi","Description":"This is a love story, of an urban girl who, marries an Indian man with a rural background, just to inherit her ancestral property, conditioned to this requirement. Before untying this relation forever, as she had planned, she agrees to live for 6 months with her To-be forlorn husband, and gradually falls in love with him.","TrailerLink":"https://www.youtube.com/watch?v=W3g_k32L1jI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/W3g_k32L1jI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/29/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/2FDE5F27699AE17EC08B8F7F5A18B01B.jpg"},{"Id":"e4f6e68a","ImdbId":"tt3797478","OriginalTitle":"Main Hoon Rajinikanth","Title":"Main Hoon Rajinikanth","Description":"Main Hoon (Part-Time) Killer previously known as Main Hoon Rajinikanth is a 2015 Indian comedy spoof film in the Hindi language. The film is written and directed by Faisal Saif and produced by Mrs. Saroj under the banner of Varsha Production House. The film marks Bollywood début of South Indian actor Adithya Menon.\r\n\r\nThe film was initially supposed to release in the year 2014, but faced huge opposition and controversy when South-Indian actor Rajinikanth approached Madras High Court to stop the film's release based upon the use of his name in the film's title.\r\nAfter a long-running court battle, filmmaker Faisal Saif finally changed the title of the film falling under producer's pressure and it was released on 22 May 2015 across North India. However, in South India it was not released to avoid any further legal disputes","TrailerLink":"https://www.youtube.com/watch?v=WC2wsjs32Ek","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/WC2wsjs32Ek\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"5/22/2015","Runtime":127,"Budget":8000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/AA1CC40BC3051C0A95CA1320BFEA720E.jpg"},{"Id":"ba99bb05","ImdbId":"tt4654760","OriginalTitle":"Sabki Bajegi Band","Title":"Sabki Bajegi Band","Description":"The film is based on true events - when the controversial RJ Anirudh recorded candid conversations between his celebrity/Bollywood pals at a farmhouse party: their intimate sexual desires, kinks, rivalries, affairs and bitching about Bollywood. The sensational uncensored footage has become India's First Reality Film.","TrailerLink":"https://www.youtube.com/watch?v=KfnBo98Hc6Q","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/KfnBo98Hc6Q\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":12,"Rating":3.0,"CensorRating":"U/A","ReleaseDate":"5/1/2015","Runtime":108,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B491B1FAC6798520C85E0167BD3D1C37.jpeg"},{"Id":"6edcd502","ImdbId":"tt4581722","OriginalTitle":"Ishq Ke Parindey","Title":"Ishq Ke Parindey","Description":"Saare Jahan Se Achchha Hindustan Hamara Hum Bulbule Hain Iski Ye Gulsitan Hamara When Allama Iqbal wrote the above couplet he never knew that the seeds sown by the British would lead to the creation of India and Pakistan. The land nurtured by the romantic poetry of Ghalib became a battleground. Friends for generations were separated forever in the name of partition. Humanity was buried under hatred. Sheen, the love bird from Pakistan flies down to Lucknow, the city of Nawabs. Faiz, the poet at heart, is mesmerised by the angelic beauty from heaven. Across rooftops and in the by lanes of Lucknow blossoms the innocent love of Sheen and Faiz. Bloodshed in the name of supremacy is a common phenomenon in India and Pakistan. Sheen's entire family was engulfed in gang wars in Pakistan. The violence she hated and thought she left behind in Pakistan accidentally creeps into her love life. Sheen and Faiz would face any thunderstorm to protect the flame of love. Thus begins the soulful journey of the love birds... Ishq Ke Parindey.","TrailerLink":"https://www.youtube.com/watch?v=_CiVV5ybXeo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/_CiVV5ybXeo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"4/24/2015","Runtime":141,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1DC4591291D54ED59BC1615BE993BF5D.jpg"},{"Id":"f84ecf43","ImdbId":"tt4671212","OriginalTitle":"NH-8 Road to Nidhivan","Title":"NH-8 Road To Nidhivan","Description":"NH-8 Road to Nidhivan is an Indian Psychological- Suspense Thriller film directed by Munindra Gupta and produced by Sunil Goel and Niharika Jha. The film is released on 17 April 2015. \r\n\r\nThe gripping film is inspired by true stories of the mysterious conception of Nidhivan, a place near Mathura. The film is set against the backdrop of a road trip of four friends from Mumbai to Nidhivan, a place close to Mathura (Uttar Pradesh).","TrailerLink":"https://www.youtube.com/watch?v=hlaIg4kcIaQ","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/hlaIg4kcIaQ\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":6,"Rating":1.4,"CensorRating":"U/A","ReleaseDate":"4/17/2015","Runtime":95,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9F4C487C3DEB0D1F43A1C454FD214E99.jpg"},{"Id":"263de350","ImdbId":"tt4556848","OriginalTitle":"Barkhaa","Title":"Barkhaa","Description":"Barkhaa  is a Bollywood Romantic film, directed by Shadaab Mirza and produced by Shabana Hashmi. It stars Sara Loren in the lead role. The film also stars Taaha Shah, Shweta Pandit, Priyanshu Chatterjee and Puneet Issar as supporting cast. The film was extensively shot in Himachal Pradesh, India.Follows the relationship between two young minds, which took a unfavorable turn.","TrailerLink":"https://www.youtube.com/watch?v=N-kD5HNRG4A","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/N-kD5HNRG4A\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.65,"CensorRating":"U/A","ReleaseDate":"3/27/2015","Runtime":127,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4AF8933B55BD9A347E8EC9D9DBAE29C9.jpg"},{"Id":"4ee3f497","ImdbId":"tt2800452","OriginalTitle":"Dilliwaali Zaalim Girlfriend","Title":"Dilliwaali Zaalim Girlfriend","Description":"Dilliwaali Zaalim Girlfriend is a Hindi romantic comedy film directed by Japinder Kaur and produced by Tarnpreet Singh and Manjeet Kaur under JAP Films. The film features Divyendu Sharma, Jackie Shroff, Prachi Mishra and Ira Dubey in lead roles.\r\n\r\nDhruv an aspirant IAS officer, takes a private loan from a company in order to buy a car in order to woo the girl he loves, Sakshi. Soon enough, life turns upside down for him as he is unable to pay back the loan and the car is seized. From then on, begins Dhruv's encounters with today's super materialistic girls (where money comes above love), the finance company, the system and a hardened criminal named Minocha.","TrailerLink":"https://www.youtube.com/watch?v=NjYG9ccLD0A","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/NjYG9ccLD0A\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.4,"CensorRating":"U/A","ReleaseDate":"3/20/2015","Runtime":118,"Budget":0,"Revenue":25000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/63882684ECAF88E4BA5DC7C89E5D50BC.jpg"},{"Id":"00012b5b","ImdbId":"tt4501576","OriginalTitle":"Dirty Politics","Title":"Dirty Politics","Description":"Dirty Politics is a 2015 Hindi language Indian political thriller film written and directed by K.C. Bokadia. The ensemble cast film was released on 6 March 2015 with Adult Rating due to its strong sexual content.\r\n\r\nIn order to gain power, Anokhi Devi blackmails and sleeps with a politician. However, when she goes missing; the CBI step in to investigate.","TrailerLink":"https://www.youtube.com/watch?v=V5v72YRsKqc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/V5v72YRsKqc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":6,"Rating":1.35,"CensorRating":"A","ReleaseDate":"3/6/2015","Runtime":130,"Budget":750000000,"Revenue":1380000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1CF468F8AA8C4D6964601DC066C52874.jpg"},{"Id":"255e7943","ImdbId":"tt3666258","OriginalTitle":"Coffee Bloom","Title":"Coffee Bloom","Description":"Coffee Bloom is a 2014 Indian romantic drama film directed by debutant director Manu Warrier. It stars Arjun Mathur and Sugandha Garg in lead roles. The film is produced by Speaking Tree Productions. It tells the story of a young man Dev, who sells his family coffee estate as a statement underlining his renunciation of the world.\r\n\r\nDev, though a self proclaimed wise man finds comfort in being a loser, having given up on life as a result of a love gone wrong. A life changing event takes him on a journey to a coffee plantation. There he meets Anika,once the love of his life, now his boss. Love blooms in an idyllic setting, bringing Dev out of his self imposed funk and Dev finds a new reason to live. A terrible misunderstanding pushes him into taking drastic measures. Much is at stake as the yearly bloom is round the corner. And Dev is confronted with his past, present and future – all at once.","TrailerLink":"https://www.youtube.com/watch?v=zt64Maw5WSU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/zt64Maw5WSU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":14,"Rating":3.45,"CensorRating":"U/A","ReleaseDate":"3/6/2015","Runtime":90,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/ED28AE6FFC1DBD7BA3A48D61617AD6BF.jpg"},{"Id":"4fb67378","ImdbId":"tt4373886","OriginalTitle":"Sharafat Gayi Tel Lene","Title":"Sharafat Gayi Tel Lene","Description":"Prithvi Khuranna (Zayed Khan), a middle class working professional, who has to work in order to survive in the city and also to pay the landlord's rent plus other 'unavoidable' expenses. One day he discovers that his account has been credited with 100 crores! Finding it hard to believe, he calls up the bank's customer care. And when he hears that his account has been upgraded into a 'platinum class'. Even before the news can sink in his system, he gets a call from an 'unknown number' with caller claiming that his name is 'Dawood'. Dawood then, \"orders\" Prithvi to get into a mutually profitable deal with him, as he has to deliver the money time to time at different places to dawood's lady hechmen Rasheeda (Talia Bentson). Prithvi immediately calls up his roommate Sam (Rannvijay Singh) who thrives on women and money (easy money, to be precise), to share the news with him. Just when the duo is busy planning as to what to do with the whopping amount, the bank's Vice President D.K. Thawani (Anupam Kher) lands up at his doorstep to offer his personalised service to his 'esteemed customer'. All of this startles Prithvi to no end. Seeing Prithvi behave 'abnormally', his ever-so-concerned girlfriend Megha (Tena Desae), who is a TV journalist by profession, immediately calls her top-cop uncle G.S. Chaddha (Yuri Suri), who then, starts tracking Prithvi's phone calls. Prithvi's confidence levels take a U-turn when he discovers that D.K. Thawani is actually Dawood's man in disguise of a bank manager. Just as when things are getting settled down, life again takes a U-turn for Prithvi when he hears the breaking news about Dawood's sudden death on TV channels. Needless to say that, Dawood's death only means that Prithvi becomes the sole owner of the remaining 60 crores in his bank account.\r\n\r\nBut Prithavi tells the whole story to Megha and they both decides to go to police next day, before Sam convinces them to enjoy and party for once before returning all the money. But at the club Prithavi gets a call from Dawood and Megha gets abducted only to found unconscious in Prithvi's car. Shocked by this incident Sam confesses to them that the calls from Dawood were fake and were made by Rasheeda whose real name is Rachel. Sam has actually won an online lottery from a link send by Rachel but by using Prithvi's Debit card. On winning the prise money of 100cr the whole amount got transferred in Prithavi's bank account. Hence Sam and Rachel faked Dawood calls to get all the money back from him. But now Sam came to know that D.K. Thawani and Rachel are planning to kill him as well after they get all the money. They also realise that the lottery site is fake and it was all a money laundering scheme which was devised by business tycoon Ram Sharan Oberoi and been transferred to India through them. This gets them in trouble as they will be soon interrogated by RBI and Police for transferring black money in India.\r\n\r\nPrithvi then makes a plan and they all abduct Rachel. Then makes fake call as Oberoi to Thawani and steels all the money from his house in Rachels car. Later Prithavi goes to Thawani's office and records his confession in hidden camera, before getting him and Oberoi arrested. Film ends with Prithvi getting a price money of 2 cr from govt. of India, but receiving a call from real Dawood.","TrailerLink":"https://www.youtube.com/watch?v=BQRBUmUGSAU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/BQRBUmUGSAU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"1/16/2015","Runtime":108,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3C773D74F2A69C814B3EA247691EEB2D.jpg"},{"Id":"78dd709e","ImdbId":"tt4094820","OriginalTitle":"Crazy Cukkad Family","Title":"Crazy Cukkad Family","Description":"This roller coaster ride begins with the Wealthy Mr. Beri slipping into his third Coma. His four estranged children have to make it back home to be there while their father “hopefully” breathes his last, leaving behind his huge estate in the mountains.\r\n\r\nPawan Beri (Swanand Kirkire), the oldest child of Mr. & Mrs Beri, is a hustler who is in big trouble with a local mafia don turned Politician. Rude, brash, and arrogant, he looks at everything from his own crooked view. Archana Beri(Shilpa Shukla) is a wannabe socialite and former Miss India hopeful, forced to give up her dreams after an arranged marriage at a young age. She is bitter towards the entire world, including her family, and bullies her meek husband Digvijay (Ninad Kamat) who in secret has a dual personality. Aman Beri (Kushal Punjabi) is the New York based son who returns with his American wife, Amy (Nora Fatehi) who meets the family for the first time. He pretends to be a top fashion photographer, but in reality he is struggling as an unemployed light boy. Abhay Beri/ Chotu (Siddharth Sharma) is the youngest in the family. Not much is known about his present status. Years ago he was sent to New Zealand to study, but never returned... well until now!\r\n\r\nAlong with the four siblings are a bunch of other unique and nutty characters like a village item girl, an extra slow family lawyer, and 3 goofy investigators. The chaos begins when they discover that in order to open their they need to get ‘Chotu’ married. Set in a lush green, picturesque hill station, this story is about the dysfunctional 'Beri' family. A mad- caper but true to life, hilarious but emotional, fast paced yet heartwarming story of a family estranged for years, brought together by greed but eventually finding each other, discovering the true meaning of being a family.","TrailerLink":"https://www.youtube.com/watch?v=CJz1hdiuMiI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/CJz1hdiuMiI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.45,"CensorRating":"U/A","ReleaseDate":"1/16/2015","Runtime":105,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F78A8D299C678B9992A9911E6597A536.jpg"},{"Id":"62675e6f","ImdbId":"tt4384270","OriginalTitle":"Take It Easy","Title":"Take It Easy","Description":"The protagonists are both almost ten-year-old children. The father of one of them is a player who wants hist son to become one too, but his son is more interested in Studying. The other boy's story is contrary. The Parents are imposing the dreams.","TrailerLink":"https://www.youtube.com/watch?v=AkF4vdWdTA8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AkF4vdWdTA8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.65625,"CensorRating":"U/A","ReleaseDate":"1/2/2015","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D8914904AA49815674AF326EE473ADF4.jpg"},{"Id":"2004e746","ImdbId":"tt4355892","OriginalTitle":"Mumbai Can Dance Saalaa","Title":"Mumbai Can Dance Saalaa","Description":"Mumbai Can Dance Saala is a 2015 Bollywood film written and directed by Sachindra Sharma and . The film stars Ashima Sharma, Aditya Pancholi, Shakti Kapoor and Rakhi Sawant in lead roles","TrailerLink":"https://www.youtube.com/watch?v=q0G36gZyl74","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/q0G36gZyl74\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":7,"Rating":1.65,"CensorRating":"U/A","ReleaseDate":"1/2/2015","Runtime":135,"Budget":320000000,"Revenue":180000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/447AC0B070D9B04CCF35CCA2581706A7.jpg"},{"Id":"8413fd8a","ImdbId":"","OriginalTitle":"Hogaya Dimaagh Ka Dahi","Title":"Hogaya Dimaagh Ka Dahi","Description":"The film is tailored around the cat and mouse concept, where characters are preying on each other’s life. Hogaya Dimaagh Ka Dahi would take you on a roller-coaster-dialogue ride soaked in out-an-out comedy deals with a plot that is applicable on certain section of the youth who are pampered, spoiled and is not serious about their future life. And for parents, it becomes a challenge to handle such mischievous but talented youth. It’s a story about relationships where life’s mantra can be taught through experiences.","TrailerLink":"https://www.youtube.com/watch?v=tQkM-5AKfXU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/tQkM-5AKfXU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"10/16/2015","Runtime":118,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8F995325C5CE98C8BD7EDBBDF2486787.jpeg"},{"Id":"79fb0b7a","ImdbId":"tt3595298","OriginalTitle":"Prem Ratan Dhan Payo","Title":"Prem Ratan Dhan Payo","Description":"A king, who is loved by his subjects, wants to lead a normal life away from all the responsibilities and his kingdom, while his step brother plans to steal the throne from him. But things are changed when the king finds out the common man who looks exactly like him and they change their identities with each other temporarily.","TrailerLink":"https://www.youtube.com/watch?v=sPV5_m9GGqo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/sPV5_m9GGqo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":11,"Rating":2.63636,"CensorRating":"U/A","ReleaseDate":"11/12/2015","Runtime":164,"Budget":1100000000,"Revenue":4310000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3259BBC7E530F0FCFB9D335AE8EA9B99.jpg"},{"Id":"fcf2513b","ImdbId":"tt5052972","OriginalTitle":"Yaara Silly Silly","Title":"Yaara Silly Silly","Description":"Yaara Silly Silly is an Indian romantic film directed by Subhash Sehgal. It stars Paoli Dam and Parambrata Chatterjee in the lead roles.\r\nFrom Romantic Comedy To The Intense Love Story Of A Prostitute(Paoli Dam) And Parambrata.","TrailerLink":"https://www.youtube.com/watch?v=bmQM1XvyxZc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/bmQM1XvyxZc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":13,"Rating":3.15,"CensorRating":"U/A","ReleaseDate":"11/6/2015","Runtime":107,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BD168E078C8BA58494028E2DAB04A6B1.jpg"},{"Id":"1171ab18","ImdbId":"tt2190820","OriginalTitle":"Charlie Kay Chakkar Mein","Title":"Charlie Kay Chakkar Mein","Description":"Our life revolves around perception of truth, in our lives we act only on our ability to judge the truth. Truth though is a fickle thing, paradoxically because it only occurs in absolution; rest is only our interpretation that allows us to live in a certain subjective truth. Addl. Commissioner of Police, Sanket Pujari and the rookie officer, Sameera sit across the television screen to decipher a rare case of multiple homicides caught on camera and this case is going to test their fundamental perception of truth.","TrailerLink":"https://www.youtube.com/watch?v=hGqddfO2qCs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/hGqddfO2qCs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":12,"Rating":3.0,"CensorRating":"U/A","ReleaseDate":"11/6/2015","Runtime":102,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/28112BD8607A2AE66E30F11568409F56.jpg"},{"Id":"d0d6188b","ImdbId":"tt4565796","OriginalTitle":"Four Pillars of Basement","Title":"Four Pillars Of Basement","Description":"Four Pillars of Basement is a psycho thriller that shows human fragilities and capricious nature. Protagonist Samir is a conniving person and works as a security officer at the mall. He has a crush on Priya, working in one of the offices in the mall. His twin brother, a lunatic and a mad person elopes to the mental hospital to add more confusion to the plot. The movie unfolds dramatically as the heroine is trapped in the basement and is unable to get out. Whosoever comes to help her, meets with a tragic death. In the climax, will the hero of the movie- as the twin lunatic be held responsible? Will the security officer be punished?","TrailerLink":"https://www.youtube.com/watch?v=XNRvhGMEfY4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/XNRvhGMEfY4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":0,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"11/6/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B5B981DE45C64B50D001C23900B2756E.jpg"},{"Id":"be336499","ImdbId":"tt4024944","OriginalTitle":"Main Aur Charles","Title":"Main Aur Charles","Description":"The movie revolves around Charles, an enigmatic con man and a vicious killer, and the lives he touched with his inescapable charm and mysterious personality.We follow Charles, who is literally evil personified, as he manipulates innumerable people to facilitate his jail break. The thin line between his victims and accomplices include a copywriter of an international ad agency clinging on to Charles for hope, a royal princess seeking adventure in an otherwise bland life, a young hippie girl hopelessly drawn towards him, and an innocent law student Mira madly in love with the dreams sold by Charles amongst various others - from a financial wizard, an extortionist from Haryana to a helpless prison supervisor. Bit by bit, the character of Charles is revealed through all those who encountered him. Probably the only person who interacted with Charles the least, Commissioner Amod Kanth, was affected by him the most. We see the impact of Charles on all through the eyes of Amod Kanth - and their ever raging battle of good and evil, where good eventually wins but evil always resurfaces. This story, set in the 1980s, shows how Charles escapes from Indias most securely guarded prison and is then subsequently arrested once again in Goa. It reveals the story behind the seemingly simple cat and mouse game between Amod Kanth and Charles. But more importantly, the movie gives the world a peek into the dangerous mind of Charles, how he led different people to perceive him differently, how he filled the vacuum in their lives and ultimately, his dark world where right and wrong blend into a charming and mystique grey existence.","TrailerLink":"https://www.youtube.com/watch?v=wOF9MlEOfuE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wOF9MlEOfuE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":14,"Rating":3.35,"CensorRating":"U/A","ReleaseDate":"10/30/2015","Runtime":123,"Budget":600000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/263C11EFD7FE2DFB5208A38F20D41C3A.jpg"},{"Id":"8324c77b","ImdbId":"tt4386684","OriginalTitle":"31st October","Title":"31St October","Description":"31st October is an upcoming Bollywood film written and produced by Harry Sachdeva and directed by National Award Winner, Shivaji Lotan Patil. It is the first Bollywood Film on the aftermath of Indira Gandhi's Assassination. A thriller about a Sikh family trapped in a riot-affected part of Delhi during the anti-Sikh riots following Indira Gandhi's assassination.","TrailerLink":"https://www.youtube.com/watch?v=CucGte4wKzI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/CucGte4wKzI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":13,"Rating":3.2,"CensorRating":"U/A","ReleaseDate":"10/30/2015","Runtime":109,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/1236626EBDB9D251AD63EBDBF75DDC89.jpg"},{"Id":"c8fc50d3","ImdbId":"tt4354740","OriginalTitle":"Dharam Sankat Mein","Title":"Dharam Sankat Mein","Description":"Dharampal (Paresh Rawal) is an atheist living in a Hindu household. He is very stereotypical towards Muslims. He starts his days with the old songs of a Punjabi Sikh pop singer Manjeet Manchala (Gippy Grewal), who has now stopped producing albums and disappeared mysteriously. As well as this, he has regular arguments with a Muslim man named Nawab Mehmood Nazim Ali Shah Khan Bahadur (Annu Kapoor) who happens to live in the same area as him. Dharampal later visits his late mother's bank vault to collect her belongings. He then finds adoption papers certifying he was adopted in 1960 and that his biological parents were Muslims. This shocks him, considering how much he dislikes Muslims, and he decides to keep this a secret. Eventually, he admits to Nawab that he is also a Muslim, and that he must find his real father in order to speak to him. They discover that his father is in critical condition due to old age, living in an senior home. The Imaam taking care of his father tells Dharampal that if his father saw that his only son has been brought up as a non-Muslim, it could cause severe damage to his health. Therefore, he tells Dharampal to learn how to become a true Muslim and come back to meet his father once he is ready.\r\n\r\nWith the help of Shah, he begins to learn the ways of Muslim people. However, the Imaam declines Dharampal's request to meet his father once again, claiming he is still not coming across as a true Muslim. Meanwhile, Dharampal's son falls in love with a young girl named Shraddha and in order to marry her, he must have her father accept him and his family. Shraddha's father is a devout follower of a spiritual baba named Neelanand (Naseeruddin Shah). To help him impress Shraddha's father, he asks Dharampal to also follow Neelanand and become spiritual. However, at one occasion, Dharampal ends up admitting publicly that he is a born Muslim. Dharampal's family and Shraddha's father witness this, and Neelanand advises Shraddha's father not to have his daughter marry Dharampal's son. Due to this, Dharampal's family leave him. A case is lodged against Dharampal for offending Muslims, and in the court, the Immam comes and gives character witness of how Dharampal detests Islam. His witness backfires when Nawaab, now Dharampal's attorney, accuses the Immam of trying to wrongfully convert Dharampal to Islam.\r\n\r\nThe court gives permission to Dharampal to see his ailing father. However, before they arrive at the senior home, his father has already died. Furious over the whole situation, Dharampal tries to bring down Neelanand, the main cause of most of his troubles. He then accidentally discovers that Neelanand Baba's eye twitches due to Blepharospasm, a very rare abnormality causing contraction of the eyelid, which the Punjabi pop singer Manjeet Manchala also suffered from. This reminds Dharampal that Manchala had disappeared years ago, and then matches the voices of Manchala and Neelanand, confirming they are the same person. He then crashes an event of Neelanand and reveals to a large audience how Neelanand Baba is actually a born Sikh and has been a fraud and characterless pop-singer with various cases lodged against him for adulterous relationships with many women. He gives a speech on how the religion a person follows should not matter as long as they are acting rightfully. Dharampal's family finally returns and his son is allowed to marry Sharaddha.","TrailerLink":"https://www.youtube.com/watch?v=qNripK67rH0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/qNripK67rH0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.05,"CensorRating":"U/A","ReleaseDate":"4/10/2015","Runtime":129,"Budget":190000000,"Revenue":100000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A5AAE1AD16B667DE34A2DDDED1802F96.jpg"},{"Id":"b1cdd42f","ImdbId":"tt4007558","OriginalTitle":"Shaandaar","Title":"Shaandaar","Description":"The leading stars are Alia Bhatt and Shahid Kapoor,who are working with Pankaj Kapur and Sanjay Kapoor in supporting roles.Shahid beared is about cuteness and Alia Bhatt is about throb hearts.\r\nRomance blossoms as the families of two East Indian business dynasties prepare for a merger.","TrailerLink":"https://www.youtube.com/watch?v=k99-vMPh3-A","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/k99-vMPh3-A\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.65,"CensorRating":"U/A","ReleaseDate":"10/22/2015","Runtime":144,"Budget":1300000000,"Revenue":510000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/66EEBB66036CA3303D6D832BDE0DA61A.jpg"},{"Id":"cc4779cf","ImdbId":"tt3019620","OriginalTitle":"Titli","Title":"Titli","Description":"In the badlands of Delhi's dystopic underbelly, Titli, the youngest member of a violent car-jacking brotherhood, plots a desperate bid to escape the 'family' business.","TrailerLink":"https://www.youtube.com/watch?v=OOqiQiMkXDA","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/OOqiQiMkXDA\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":3.2,"CensorRating":"U/A","ReleaseDate":"10/30/2015","Runtime":124,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/53B133F1A28CB0B18FF9540F11A2B59C.jpg"},{"Id":"c83f685f","ImdbId":"tt4430136","OriginalTitle":"Pyaar Ka Punchnama 2","Title":"Pyaar Ka Punchnama 2","Description":"Anshul a.k.a. Gogo (Kartik Aaryan), Siddharth a.k.a. Chauka (Sunny Nijar) and Tarun a.k.a Thakur (Omkar Kapoor) are flatmates and best friends. Film start with Gogo meeting Ruchika a.k.a Chiku (Nushrat Bharucha) and gives her his number. Siddharth ends up meeting Supriya (Sonnalli Seygall) at a family wedding and instantly falls for her. Thakur meets Kusum (Ishita Raj Sharma) while working out at the gym and they start seeing each other. The guys get into relationships with the girls. However, sweetness of love starts to fade. Gogo disapproves of the proximity between Chiku and Sunny, her best friend. Siddhart helps Supriya and her family in their chores, but Supriya is not willing to take the relationship forward. Kusum does not support Thakur in his business adventure and is using him for her luxuries. At the end, the boys give up and leave the girls. The film ends with them acknowledging that the only place where they can get the true love is from their mother.","TrailerLink":"https://youtu.be/tC-HGUhxyyc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/tC-HGUhxyyc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":16,"Rating":3.85,"CensorRating":"U/A","ReleaseDate":"10/16/2015","Runtime":136,"Budget":80000000,"Revenue":535000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/D45567D3C30E1909FAA5B55D6C9D357C.jpg"},{"Id":"e27a917f","ImdbId":"tt4651394","OriginalTitle":"The Wedding Pullav","Title":"The Wedding Pullav","Description":"Wedding Pullav shows the story of two best friends Diganth and Anushka Ranjan who are in love but they themselves are unaware of it. When Anushka is invited to attend the wedding of Diganth this love confusion further increases. On one hand Diganth is jealous with Anushkas boyfriend while on other side Anushka do not like Diganth to marry another girl whom she initially praises. The story then moves to a stage where they know their feelings but not sure what to do next.","TrailerLink":"http://www.cinemalytics.com/movie/e27a917f-The-Wedding-Pullav","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/mqhcr4QZE6s\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":11,"Rating":2.7,"CensorRating":"U/A","ReleaseDate":"10/16/2015","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F6D0D2D3F689F3D12A42AB607FE9CE98.jpg"},{"Id":"b541b8fa","ImdbId":"tt4323504","OriginalTitle":"Jazbaa","Title":"Jazbaa","Description":"Aishwarya Rai Bachchan is the main protagonist. She will essay the role of a lawyer. Irrfan Khan cast in a role of a suspended cop while Shabana Azmi will be playing the role of a mother. Chandan Roy Sanyal plays the main antagonist in the film. Siddhanth Kapoor will be essaying the role of a troubled individual undergoing psychiatric treatment.","TrailerLink":"https://www.youtube.com/watch?v=nx7z1enCLWs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/nx7z1enCLWs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":13,"Rating":2.93077,"CensorRating":"U/A","ReleaseDate":"10/9/2015","Runtime":119,"Budget":300000000,"Revenue":331900000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/888FA7431FF685EC9660A74E3440682D.jpg"},{"Id":"4b29c3ae","ImdbId":"tt4934950","OriginalTitle":"Talvar","Title":"Talvar","Description":"The story revolves around the mysterious murder cases of a 14-year girl, Shruti and the domestic help, Khempal who worked at her place. The film is based on the real life Noida Double Murder Case of 2008, where the parents were said to be the prime suspects of the murders. The film showcases three perspectives to the case which emerge as the investigation moves forward.","TrailerLink":"https://www.youtube.com/watch?v=aQNMsw8Ljjc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/aQNMsw8Ljjc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":15,"Rating":3.53333,"CensorRating":"U/A","ReleaseDate":"10/2/2015","Runtime":132,"Budget":0,"Revenue":347500000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0BFAD6B86325B80445686BA6A945C169.jpg"},{"Id":"d896b56f","ImdbId":"tt3696192","OriginalTitle":"Singh Is Bling","Title":"Singh Is Bling","Description":"A comic caper about Happy Singh, a Punjabi villager who goes through a series of misadventures and eventually becomes the King of the Australian underworld.","TrailerLink":"https://www.youtube.com/watch?v=nuVAGjO-s2I","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/nuVAGjO-s2I\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":11,"Rating":2.75,"CensorRating":"U/A","ReleaseDate":"10/2/2015","Runtime":140,"Budget":910000000,"Revenue":1162700000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/CF2845EE1D8A6C1000B6D34D7F375351.jpg"},{"Id":"25500b33","ImdbId":"tt4897908","OriginalTitle":"Calendar Girls","Title":"Calendar Girls","Description":"The film focuses on five girls who hail from different regions of India, and who have been selected to pose for the country's most prestigious annual calendar which is a joint effort between business tycoon Rishabh Kukreja and his photographer friend Timmy Sen.","TrailerLink":"https://www.youtube.com/watch?v=hKFktOIlkRo","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/hKFktOIlkRo\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":10,"Rating":2.325,"CensorRating":"A","ReleaseDate":"9/25/2015","Runtime":131,"Budget":900000000,"Revenue":300000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/55ACD7F9051CE0B477C129C15B051DD2.jpg"},{"Id":"198995ae","ImdbId":"tt4302956","OriginalTitle":"Kis Kisko Pyaar Karu","Title":"Kis Kisko Pyaar Karu","Description":"This is the story of a man who goes by 3 names - Shiv, Ram and Kishan because he is married to 3 women. As luck would have it, all his wives live in the same building but none of them know that Shiv, Ram and Kishan are the same man who is cheating on all of them. \r\n\r\nDespite having 3 wives, he falls for a fourth woman and he plans to marry her as well. But before he can do this, all his three wives come to know of his cheating. What happens next?","TrailerLink":"https://www.youtube.com/watch?v=Xhmej50EGM8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Xhmej50EGM8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":15,"Rating":3.55,"CensorRating":"U/A","ReleaseDate":"9/25/2015","Runtime":137,"Budget":150000000,"Revenue":190000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A2FC496C632DA758C678E447A079051D.jpg"},{"Id":"26f6e8f4","ImdbId":"tt3619710","OriginalTitle":"Bhaag Johnny","Title":"Bhaag Johnny","Description":"Thrilling story of Johnny who is sick and tired of living with painful vicarious feelings. Explains how much formidable is it to tackle with both ends of coin. No matter whatever choices you have made in your past you are going to regret it.","TrailerLink":"https://www.youtube.com/watch?v=ZybkdyM-Y5g","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ZybkdyM-Y5g\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":17,"Rating":4.05,"CensorRating":"U/A","ReleaseDate":"9/25/2015","Runtime":118,"Budget":200000000,"Revenue":400000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C54E9C51FC6FE20190EC7CA4EF90CD53.jpg"},{"Id":"92ebv8cg","ImdbId":"tt2631186","OriginalTitle":"Baahubali: The Beginning","Title":"Baahubali The Beginning","Description":"Baahubali: The Beginning is a 2015 Indian epic historical fiction film directed by S. S. Rajamouli. Produced by Shobu Yarlagadda and Prasad Devineni, it is the first of two cinematic parts. The film was simultaneously made in Telugu and Tamil and dubbed into Hindi, Malayalam and French. The film stars Prabhas, Rana Daggubati, Tamannaah and Anushka Shetty in lead roles. Sathyaraj, Ramya Krishnan, Nassar, Adivi Sesh, Tanikella Bharani and Sudeep appear in supporting roles. The soundtrack and background score were composed by M. M. Keeravani while the cinematography, editing, art direction and visual effects supervision were done by K. K. Senthil Kumar, Kotagiri Venkateswara Rao, Sabu Cyril and V. Srinivas Mohan respectively.\r\n\r\nThe film, which was made on a budget of ₹120 crore (US$18 million), released worldwide on 10 July 2015 to positive reviews from critics, became the highest grossing Indian film within India, and became the third highest grossing Indian film globally. It became the first South Indian film to gross over ₹600 crore (US$89 million) worldwide and the first non-Hindi film to gross over ₹100 crore (US$15 million) in the dubbed Hindi version. It is also the highest grossing Telugu film of all time.\r\n\r\nAn international version of the film edited by Vincent Tabaillon was screened at the Open Cinema Strand of Busan International Film Festival, Indian Film Festival The Hague,  Sitges Film Festival in Spain, Utopiales Film Festival in France, Golden Horse Film Festival in Taipei, Taiwan, Tallinn Black Nights Film Festival in Estonia, L'Etrange International Film Festival in Paris, Five Flavours Film Festival in Poland and Hawaii International Film Festival in Honolulu. The international version of the film is scheduled to be released in China, Japan, Korea, Taiwan, Indonesia, Thailand, Vietnam, Laos, Cambodia, Myanmar, Timor-Leste along with some European and Latin American countries. The story synopsis is as follows...\r\n\r\nIn the ancient Kingdom of Mahishmati in India, Sivagami, the queen (Ramya Krishnan), emerges from a cave adjoining a big waterfall, carrying a baby. She kills the soldiers pursuing her and sacrifices herself to save the baby. Local villagers spot the queen carrying the baby while almost drowning in the river and rescue the infant. The queen drowns after pointing towards the mountain above the waterfall.  Sanga (Rohini) and  her husband name the infant Shiva and raise him as their own son. They seal the cave fearing that someone may come to take away the child.\r\n\r\nShiva (Prabhas) grows up to be a well-built young man aspiring to hike the mountain and makes many unsuccessful attempts at it. It is revealed that he possesses unnatural strength. He then finds a mask of a girl which falls from the waterfall. Driven to find out the identity of the girl, he climbs the mountain again and succeeds this time.\r\n\r\nOn top of the waterfall, Shiva discovers that the mask belongs to Avanthika (Tamannaah), a rebellious warrior whose group has indulged in a guerrilla warfare against king Bhallala Deva / Pallvalathevan (Rana Daggubati) of the Mahishmati Kingdom. The group intends to rescue their former queen Devasena (Anushka Shetty) who has been chained in the kingdom for the past 25 years. Avanthika is given the opportunity to rescue the queen.\r\n\r\nAvanthika falls in love with Shiva after she finds out that he has climbed the waterfall for her. Shiva pledges to help her in her mission and sneaks into Mahishmati to rescue Devasena. Shiva rescues her and flees along with her but is chased down by the king's Royal slave Kattappa (Sathyaraj), known for his great warrior abilities. After Shiva beheads Bhadra (Adivi Sesh), Bhalla Deva's son, Kattappa drops his weapons on realising that Shiva is Mahendra Baahubali, the son of late king Amarendra Baahubali.\r\n\r\nA flashback reveals Amarendra Bahubali's past. Amarendra's mother died while giving him birth, while his father had died much before that. Sivagami takes charge of running the kingdom with Kattapa's assistance until a new king is elected. Amarendra Bahubali and Bhallala Deva are brought up together, trained in all areas including arts, science, disguise, politics and warfare, but both of them have different approaches towards kingship. Amarendra Baahubali is liberal to everyone but Bhallala Deva is violent and achieves his goals with any means possible.\r\n\r\nWhen a war is forced upon Mahishmati by the Kalakeyas, Sivagami promises that the new king will be the one who beheads the Kalakeya king and orders that the war resources be distributed equally between the two cousins. Bijjala Deva (Nassar), Bhalla Deva's father, uses his cunningness to make sure Bhalladeva gets the maximum war fare. When it seems that Mahishmati would end up being defeated, Amarendra inspires his soldiers to fight to the death and they end up crushing the enemy. Despite Bhalla Deva being the one to kill the Kalakeya king, Sivagami announces Amarendra Baahubali as the new emperor because of his nobility and leadership in the war.\r\n\r\nAfter the flashback, when asked about Amarendra's current whereabouts, a tearful Katappa reveals that the King is dead, and that he is the King's killer.","TrailerLink":"https://www.youtube.com/watch?v=VdafjyFK3ko","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/VdafjyFK3ko\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":19,"Rating":4.52632,"CensorRating":"A","ReleaseDate":"7/10/2015","Runtime":159,"Budget":2500000000,"Revenue":6000000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F66ED301F1869801D5881010E68B9004.jpg"},{"Id":"97f63b65","ImdbId":"tt2555736","OriginalTitle":"The Second Best Exotic Marigold Hotel","Title":"The Second Best Exotic Marigold Hotel","Description":"Muriel Donnelly and Sonny Kapoor travel to San Diego, California to propose a plan to hotel magnate Ty Burley for buying and opening a second hotel in India as a companion to the Best Exotic Marigold Hotel. They are told that a company inspector will anonymously visit India to evaluate the project.\r\n\r\nBack in Jaipur, Evelyn Greenslade is offered a job as a fabric buyer. She is concerned that at age 79, the job will require many responsibilities and considerable travel. Douglas Ainslie, who is in love with Evelyn, is worried about losing time with her as well, and also eager to introduce her to his daughter.\r\n\r\nSonny's life becomes complicated by plans for his upcoming wedding to Sunaina, plus a possible rival for her affections and in his business interests. He also is desperate to impress American visitor Guy Chambers, whom he immediately identifies as the American hotel chain's anonymous inspector. Noting the immediate interest Guy has taken in Sonny's mother, he encourages a romantic relationship between them at first, then angrily resents it when he concludes Guy is not the inspector after all.\r\n\r\nMadge Hardcastle's dilemma is deciding between two suitors from India and which to wed. Norman Cousins becomes frantic when he believes a local taxi driver mistakenly assumed Norman wanted a fatal accident to befall his current sweetheart, Carol, but then discovers that she has been sleeping with other men. And Douglas' daughter arrives for a visit with his estranged wife Jean (who returned to the UK at the end of the previous movie) seeking a divorce so that she can remarry.\r\n\r\nMuriel, having possibly received bad news from a medical appointment, struggles to keep Sonny from ruining his wedding, his business and his future, having become quite fond of him. Decisions come to a head for all during the colourful wedding of Sonny and Sunaina.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.3,"CensorRating":"U/A","ReleaseDate":"2/26/2015","Runtime":122,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8268CA26F6CCDDD55EC66D407F28F01F.jpg"},{"Id":"0fbd2ca4","ImdbId":"tt2820852","OriginalTitle":"Furious 7","Title":"Furious 7","Description":"After defeating Owen Shaw and his crew and securing amnesty for their past crimes, Dominic \"Dom\" Toretto, Brian O'Conner, and the rest of their team have returned to the United States to live normal lives again. Brian begins to accustom himself to life as a father, while Dom tries to help Letty Ortiz regain her memories. Meanwhile, Owen's older brother, Deckard Shaw, breaks into the secure hospital the comatose Owen is being held in and swears vengeance against Dom, before breaking into Luke Hobbs' DSS office to extract profiles of Dom's crew. After revealing his identity, Shaw engages Hobbs in a fight, and escapes when he detonates a bomb that severely injures Hobbs. Dom later learns from his sister Mia that she is pregnant again and convinces her to tell Brian. However, a bomb, disguised in a package sent from Tokyo, explodes and destroys the Toretto house just seconds after Han, a member of their team, is killed by Shaw in Tokyo. Dom later visits Hobbs in a hospital, where he learns that Shaw is a rogue special forces assassin seeking to avenge his brother. Dom then travels to Tokyo to claim Han's body, where he meets and races Sean Boswell, a friend of Han's, who gives him personal items found at Han's crash site.\r\n\r\nBack at Han's funeral in Los Angeles, Dom notices a car observing and chases after the vehicle, driven by Shaw. Both prepare to fight, but Shaw slips away when a covert ops team arrives, led by Frank Petty. Petty says that he will assist Dom in stopping Shaw if he helps him obtain the God's Eye, a computer program that uses digital devices to track down a person, and save its creator, a hacker named Ramsey, from a mercenary named Jakande. Dom, Brian, Letty, Roman Pearce, and Tej Parker then airdrop their cars over the Caucasus Mountains in Azerbaijan, ambush Jakande's convoy, and rescue Ramsey. The team then heads to Abu Dhabi, where a billionaire has acquired the flash drive containing the God's Eye, and manages to steal it. With the God's Eye, the team manages to track down Shaw, who is waiting at a remote factory. Dom, Brian, Petty and his team attempt to capture Shaw, but are ambushed by Jakande and his militants, and they are forced to flee while Jakande obtains the God's Eye. At his own request, Petty is then left to be evacuated by helicopter. Left with no other choice, the team decides to return to Los Angeles to fight Shaw, Jakande and his men on their home turf. Meanwhile, Brian promises Mia that once they deal with Shaw, he'll dedicate himself to their family full-time.\r\n\r\nWhile Jakande pursues Brian and the rest of the team with a stealth helicopter and a drone, Ramsey attempts to hack into the God's Eye while sharing her mobile between their vehicles. Hobbs, seeing the team in trouble, breaks out of hospital and destroys the drone. Ramsey then regains control of the God's Eye and shuts it down. Meanwhile, Dom and Shaw engage in a one-on-one brawl on a parking garage, before Jakande intervenes and attacks them both, and Shaw is defeated when part of the parking garage collapses beneath him. Dom then launches his vehicle at Jakande's helicopter, tossing a bag of grenades onto its skids, before injuring himself when his car lands and crashes. Hobbs then shoots the bag of grenades from ground level, destroying the helicopter and killing Jakande. When Dom remains unconscious, the team fears that he is dead. As Letty cradles Dom's body in her arms, she reveals that she has regained her memories, and that she remembers their wedding. Dom regains consciousness soon after, remarking, \"It's about time\".\r\n\r\nLater, Shaw is taken into custody by Hobbs and locked away in a secret, high-security prison. Meanwhile, at a beach, Brian and Mia play with their son while Dom, Letty, Roman, Tej and Ramsey observe, acknowledging that Brian is better off retired with his family. Dom silently leaves, but Brian catches up with him at a stop sign. As Dom remembers the times that he had had with Brian, they bid each other farewell and drive off in separate directions.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"4/3/2015","Runtime":137,"Budget":190000000,"Revenue":1506249360,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0CB69361B44E5F4F37D67060DBFA3972.jpg"},{"Id":"a5b07edf","ImdbId":"tt3886444","OriginalTitle":"Khamoshiyan - Silences have Secrets","Title":"Khamoshiyan - Silences Have Secrets","Description":"Kabir (Ali Fazal), is a novelist, whose failed career and relationship with Simran (Debina Bonnerjee) forces him to move to Kashmir in search of an inspirational story. In Kashmir, Kabir stops at a guest house run by the mysterious Meera (Sapna Pabbi). Meera is married to Jaidev (Gurmeet Chaudhary), who is confined to his bed. On his first night at the guest house, Kabir begins seeing strange apparitions. He also becomes attracted towards Meera. Meera, who is also falling for Kabir, refuses to go with him. Kabir finds out that Meera has not been out of the house for two years.\r\n\r\nKabir now in love with Meera, tries to take her away from the house. While driving away,an evil force comes before their car and they have an accident. Curious, Kabir calls a tantrik after drugging Meera. The tantrik discovers an evil spirit in the house which attacks them, he claims that the spirit is of Jaidev, who is dead. Realization dawns upon Kabir, and he recalls Meera speaking on the phone in a man's voice and never seeing Jaidev in person. Kabir sneaks into Jaidev's room, only to find Jaidev sleeping. Furious with Kabir, Meera tells him to leave.\r\n\r\nKabir later returns to confront Meera. She reveals that she was involved in a hit and run two years back and to evade imprisonment she ran away to a small town in Kashmir, where she met Jaidev, a rich industrialist who lived in the huge mansion. She fell in love with him and soon they both got married. One night Meera saw Jaidev performing a ritual slaughter and praying to the devil. Scared and shocked Meera tried to run away but she was caught by Jaidev. In a struggle to stop her, Jaidev fell from the balcony and was paralysed below the waist. Later Jaidev committed suicide and left a letter for Meera, mentioning that she will have to live in the house forever with his soul, and if she ever tried to run away, his lawyer was instructed to open a letter upon news of his disappearance, which will detail that Meera has killed him and was the culprit in the hit and run. Meera had to stay in the house with Jaidev's soul and delude the world that her husband is alive.\r\n\r\nKabir decides to steal the letter from the lawyer's office, however he finds that there was no lawyer and Jaidev was bluffing. On knowing Jaidev's lie, Meera and Kabir plan to cremate Jaidev's body and set his spirit to rest. While they cremate his body, inside the house a laugh echos in the one of the rooms and Jaidev in a painting smiles sadisticly. To their surprise Jaidev returns to haunt Meera and captures her in the painting. Kabir goes to the tantrik for help, who it turns out is also a spirit. The tantrik tells Kabir that the painting is merely a portal to the world of spirits. He gives Kabir holy water to spray on Jaidev and informs him that he doesn't have long to save Meera. After a lot of deadly struggles, Kabir drinks a drop of Jaidev's blood to get Jaidev's spirit to enter his body. He later drinks holy water, which makes Jaidev's evil spirit perish, setting Meera free.\r\n\r\nKabir is shown at a book launch for his latest novel, Khamoshiyan. Meera is also at the party but the two leave to spend some time alone together","TrailerLink":"https://www.youtube.com/watch?v=-tBWvbyIiVM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/-tBWvbyIiVM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Horror","RatingCount":8,"Rating":1.95,"CensorRating":"U/A","ReleaseDate":"1/30/2015","Runtime":122,"Budget":0,"Revenue":140200000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/9FCF7DED655E7CD5C8D7B684A5F9F707.jpg"},{"Id":"243b5856","ImdbId":"tt3948240","OriginalTitle":"Second Hand Husband","Title":"Second Hand Husband","Description":"Rajbir (Gippy Grewal) and Gurpreet (Tina Ahuja) are in love and want to marry each other. The only thing stopping them is the alimony that Rajbir has to pay every month to his ex-wife, Neha (Geeta Basra). Gurpreet, being a lawyer, is aware that the alimony needs to be paid only till Neha gets married to somebody else. Thus, begins the two lovers' journey to find a suitable groom for Rajbir's ex-wife! Their comic journey goes through various twists and turns and finally culminates at a point where Rajbir's boss, Ajit Singh (Dharmendra), gets into trouble with his wife because of his flirtatious ways. What is the special in the special appearance of Mr. Aman Pathela and Is there a ray of hope here for Gurpreet and Rajbir? Can they manipulate their way out of this mess?","TrailerLink":"https://www.youtube.com/watch?v=vqAJ_romrFk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/vqAJ_romrFk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":11,"Rating":2.55,"CensorRating":"U/A","ReleaseDate":"7/3/2015","Runtime":105,"Budget":150000000,"Revenue":50000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C9B32FF79AF67214F21402787E1919A5.jpg"},{"Id":"2b92ce28","ImdbId":"tt2503954","OriginalTitle":"Broken Horses","Title":"Broken Horses","Description":"Firmly in the tradition of American Westerns, it follows the lives of the two orphaned brothers. The older one, Buddy, sees his father being shot. Vulnerable and described as “slow”, Buddy gets co-opted by gangster Julius Hench (Vincent D’Onofrio) and turns into his key assassin. While Buddy grows up in a lawless environment, younger brother Jakey is a violinist auditioning for the New York Philharmonic and on the verge of marrying his Italian girlfriend. But first Jakey must return to his dusty home town near the U.S.-Mexican border to receive his wedding present from his older brother. Returning to that one-horse town opens up unhealed wounds and forces Jakey and Buddy to confront some ugly truths.\r\n\r\nHench won’t let Buddy quit the job. He will do anything to keep his most efficient, easily manipulated killing machine on his rolls, including bumping off Jakey. When Jakey realizes what Buddy is up against, he orchestrates a rather poorly designed plan to help them both escape from Hench.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"4/10/2015","Runtime":101,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/6FD558595A2C175988DFA88CC8D3A07F.jpg"},{"Id":"599b8344","ImdbId":"tt2962230","OriginalTitle":"Kaagaz Ke Fools","Title":"Kaagaz Ke Fools","Description":"Kaagaz Ke Fools is a 2015 Indian comedy film directed by Anil Kumar Chaudhary and produced by Faisal Kapadia and Arun Bhairav under the Globe Filmy Entertainment banner. The film was released on 24 April 2015.\r\nRevolving around a middle-class family, Kaagaz Ke Fools touches upon the issue of lack of good novel writers","TrailerLink":"https://www.youtube.com/watch?v=bC0dh7LmxF4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/bC0dh7LmxF4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":8,"Rating":1.9,"CensorRating":"U/A","ReleaseDate":"4/24/2015","Runtime":109,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/C302FB6023BAF379A869674D196C0A6D.jpg"},{"Id":"99779888","ImdbId":"tt3043252","OriginalTitle":"Parched","Title":"Parched","Description":"Parched is a 2015 Indian drama film directed by Leena Yadav. It was shown in the Special Presentations section of the 2015 Toronto International Film Festival.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"9/10/2015","Runtime":116,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3595104629E6695848B21E9BF982FB0E.jpg"},{"Id":"84add4be","ImdbId":"tt2049630","OriginalTitle":"Unfreedom","Title":"Unfreedom","Description":"Set in two different cities, New York and New Delhi,[9] the film approaches sexuality and violence head on with a focus on the Muslim and LGBT identities.[10]\r\n\r\nIn New York arrives a fundamentalist Muslim Mohammed Husain, imprisoned by his brutal past, on a mission to kidnap and kill a peaceful Muslim scholar, Fareed Rahmani.[11] “The choices we make, when we are most cornered in life, define who we are.” Once they come face to face, the only way out is through a true examination of the bare bones of each one's existence to make a choice.[12]\r\n\r\nIn New Delhi, Leela Singh, a closeted homosexual girl leaves her orthodox cop father's home with a mission to kidnap her activist bisexual lover, Sakhi Taylor, and marry her.[13] Not only do the lovers need to come to terms with their own differences, they need to face Devraj,[14] the truth of the society they live in.\r\n\r\nSet in the most archetypal cities of economic and patriarchal control, four characters come face to face with gruesome acts of violence in a battle of identities against unfreedom. \"Unfreedom\" examines the struggle between the powerful and powerless and those who strive to stand against dominating torturing socio political injustices","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/29/2015","Runtime":102,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F56C766A880C8A62BC45310863E5D3C7.jpg"},{"Id":"063e8d37","ImdbId":"tt3337550","OriginalTitle":"Rahasya","Title":"Rahasya","Description":"Rahasya is a 2015 Indian murder mystery film which is directed by Manish Gupta. The film stars Kay Kay Menon, Tisca Chopra, Ashish Vidyarthi, Mita Vashisht and Ashwini Kalsekar. The film was inspired by the Aarushi murder case, which was met with some criticism by Rajesh and Nupur Talwar. The film was released on 30 January 2015 to positive reviews.\r\n\r\nThe film revolves around the story of an 18-year-old girl, Ayesha Mahajan (Sakshi Sem), who is murdered in her own house. Her father Sachin Mahajan (Ashish Vidyarthi) is deemed the prime suspect for the murder.\r\n\r\nCBI Officer Sunil Paraskar (Kay Kay Menon) picks up the case and soon finds evidence that makes it more difficult to determine who exactly is responsible for Ayesha's death. At the end, he realizes that Ayesha's mother (Tisca Chopra) had murdered her, because Ayesha was an illegitimate child of Sachin and the family's maid (Ashwini Kalsekar).","TrailerLink":"https://www.youtube.com/watch?v=Cvm-KpdRrbk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/Cvm-KpdRrbk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Mystery","RatingCount":16,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"1/30/2015","Runtime":123,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/3C5850C1165FCDD048637225CA343472.jpg"},{"Id":"e8ed2020","ImdbId":"","OriginalTitle":"Oh Yaara Ainvayi Ainvayi Lut Gaya","Title":"Oh Yaara Ainvayi Ainvayi Lut Gaya","Description":"Oh Yaara Ainvayi Ainvayi Lut Gaya is a 2015 Punjabi romantic comedy film written and directed by Raj Sinha. It stars Jassi Gill and Gauhar Khan.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"5/22/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/B42CDFEA985756C60205CE3C65938DD6.jpg"},{"Id":"7cf0c0c7","ImdbId":"tt4467262","OriginalTitle":"Katti Batti","Title":"Katti Batti","Description":"Madhav \"Maddy\" Kabra (Imran Khan) is an architect who is in love with Payal (Kangana Ranaut) because of her attitude towards life. They are in a live-in relationship for 5 years until a sudden turn of events makes Payal leave Maddy.A story which explains the deepness of relationship signifies relationship well accordingly","TrailerLink":"https://www.youtube.com/watch?v=a23GO0NXOtg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/a23GO0NXOtg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":9,"Rating":2.15,"CensorRating":"U/A","ReleaseDate":"9/18/2015","Runtime":135,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/943BDFBC945F98930C4A323D31539890.jpg"},{"Id":"5d1b4405","ImdbId":"tt2708644","OriginalTitle":"I Love NY","Title":"I Love NY","Description":"I Love New Year is a comedy film starring Sunny Deol and Kangana Ranaut in the lead. It's a story on what happens between two people in a span of two days after New Year's Eve.[2]\r\n\r\nThe movie follows a beautiful musician (Kangana Ranaut) and a serious Wall Street banker (Sunny Deol), that have a chance encounter on New Year's Eve that the banker can't seem to remember and the events that come about as a result of the two meeting.[3][4]","TrailerLink":"https://www.youtube.com/watch?v=GYFT2aiDkjI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/GYFT2aiDkjI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Romance","RatingCount":8,"Rating":1.9,"CensorRating":"U/A","ReleaseDate":"7/10/2015","Runtime":127,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/55E08E7183D8CB2088BBD8297B200AD9.jpg"},{"Id":"74e8942a","ImdbId":"tt3742284","OriginalTitle":"N.H 10","Title":"NH 10","Description":"A couple, Meera (Anushka Sharma) and Arjun (Neil Bhoopalam), are going to a party, where Meera gets an urgent work call from her office. On the way, she is attacked by some street punks who smash her car's window. Meera manages to escape but is shaken by the incident. Arjun suggests a road trip for Meera's upcoming birthday. The couple starts their journey the next day. While stopping at a roadside Dhaba for lunch, a petrified young girl arrives and pleads for help, saying a few men are about to kill her. Meera shakes her off but they see a gang of men round up the same girl and a boy, beat them savagely and drag them to a SUV. Arjun intervenes but Satbir (Darshan Kumar), the gang leader, says the girl is his sister. As the horrified couple watches, the gang drives off. Despite Meera's pleading, Arjun drives after the gang. On a deserted area near the highway, the couple witnesses a brutal honor killing of the young boy and the girl Pinky. Terrified, Arjun and Meera attempt to flee but the gang finds them. As the gang digs graves, Satbir shoots Pinky. A fight ensues and Arjun shoots Chotte, one of the gang members. The gang is enraged and the couple run for their lives.\r\n\r\nAt night, the couple finds themselves face to face with one of the gang members. Arjun gets injured and Meera shoots the gang member dead. They make it to a railway bridge, where Meera tells Arjun to wait till she gets help. She finds a police station where she asks a policeman to help as they have witnessed an honor killing – at the mention of that term, the cop throws Meera out of the station. On the way, a senior police officer meets her in his van and starts driving back to where Arjun is. Meera realises that the police officer is with her attackers. She manages to stab him in his eye and drive off, with the gang chasing her. As they find her car, Meera stumbles off and finds a laborer's hut. The laborer and his wife protect her from the gang and advise her to go to the chief of the nearby village.\r\n\r\nMeera reaches the village's Chief Ammaji (Deepti Naval), to whom she tells her story. Ammaji's mood changes the moment she hears of the honor killing and a puzzled Meera looks around to see pillow covers saying 'Pinky'. Ammaji locks her in the room and calls the gang. They drag her out and beat her in the courtyard. She rushes to the bridge to find Arjun has been murdered.\r\n\r\nMeera shrieks in grief and rage and returns to the village, where she drives the jeep ruthlessly into two gang members, killing them. Then she kills every gang member. Ammaji arrives and gasps, seeing all the men dead. She says Pinky was her own daughter but broke rules and needed to be punished. Meera echoes her words and leaves the village as dawn breaks.","TrailerLink":"https://www.youtube.com/watch?v=A9icNqWlylw","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/A9icNqWlylw\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":15,"Rating":3.55,"CensorRating":"U/A","ReleaseDate":"3/13/2015","Runtime":115,"Budget":130000000,"Revenue":330000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/22D409D4A69314B6FD48CC6F80164DA2.jpg"},{"Id":"663621ed","ImdbId":"tt4332114","OriginalTitle":"Dolly Ki Doli","Title":"Dolly Ki Doli","Description":"The movie centres around a young woman, Dolly (Sonam Kapoor), who is a young con artist. First she married Sonu Sherawat (Rajkummar Rao). She marries men from different religions and runs away with their wealth on the night of the wedding.[4][5] Her entire family consists of con artists. After conning quite a few number of rich men, she gets media attention, who label her as \"looteri dulhan\". A cop Robin Singh (Pulkit Samrat) decides to catch Dolly. When she tries to con Delhi boy Manjot (Varun Sharma), she slips and her photographs are splashed all over the media.\r\n\r\nWhen Dolly and her gang try to con a prince (Saif Ali Khan), they are arrested by Robin Singh. Then it is revealed that Robin Singh and Dolly have a past. She is put behind bars but she escapes with Robin's help and they get married. But she leaves him too and regroups with her old gang members and goes in search of their next victim.","TrailerLink":"https://www.youtube.com/watch?v=uzdu62XspwY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/uzdu62XspwY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.3,"CensorRating":"U/A","ReleaseDate":"1/23/2015","Runtime":98,"Budget":250000000,"Revenue":192100000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BC9E26B48534582902F45592D88FEA3E.jpg"},{"Id":"995ac5cb","ImdbId":"tt3422462","OriginalTitle":"Bangistan","Title":"Bangistan","Description":"Two blundering terrorists with Lofty Ideologies, but ordinary Talent, on a mission to change the world.","TrailerLink":"https://www.youtube.com/watch?v=uPtyOoYL12Y","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/uPtyOoYL12Y\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"8/7/2015","Runtime":135,"Budget":260000000,"Revenue":54600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/75B6CD9AFDE6DEA2CF1FE0A67CEA8BEA.jpg"},{"Id":"5cf5b750","ImdbId":"tt4272420","OriginalTitle":"Kuch Kuch Locha Hai","Title":"Kuch Kuch Locha Hai","Description":"Praveen Patel (Ram Kapoor) is a 45-year-old Gujarati NRI store-owner living with his wife and 20-something son in Kuala Lumpur. Though he loves his wife, Kokila (Suchita Trivedi), he is often annoyed by her over-religious and sometimes dominating nature. Patel has an enormous fascination for a Bollywood actress named Shanaya (Sunny Leone) and he avidly watches her movies, in privacy though.\r\n\r\nPatel’s son, Jigar (Navdeep Chhabra), is in love with their neighbor Naina (Evelyn Sharma). Jigar is an aspiring musician. Jigar wants to marry Naina, but Kokila doesn’t approve her as Naina is “too modern” and she wants a “traditional, homely Gujurati” daughter-in-law.\r\n\r\nDestiny brings Shanaya from Mumbai to Kuala Lumpur, where she is the “prize” for a Valentine’s day competition, and the winner of the contest gets a date with her. For Patel, this is his dream come true moment that he has been waiting for his entire life. He leaves no stone unturned to win the contest and eventually succeeds and secures a date with Shanaya. Before leaving for Kuala Lumpur, Shanaya signs a movie playing the role of a “middle class Gujurati wife” and in order to do proper justice to the role, her director advises to live with a Gujarati family for while to bring her role to life. While Patel is on a date with Shanaya, she considers living with Patel’s family for a few days, as Patel lies to her he lives just with his father and also lies that he’s not married yet.\r\n\r\nPatel makes Jigar as his fake father and Jigar gets Naina to be Patel’s fake mother. Patel fakes a family emergency back home in India and puts Kokila on the first flight back to India before Shanaya’s arrival to his house. Shanaya finally comes to live with Patel’s family. Patel cherishes every moment she spends in his house, profoundly flirting and getting affectionate towards with her.\r\n\r\nOne night, when Patel is dancing in the rain with Shanaya, Kokila suddenly arrives home, while Patel is unaware that she’s back in the house. Next morning, Patel’s friend brings a “Kenyan” woman to his house, who could teach garba to Shanaya. She is, in fact, Kokila in disguise, and Patel fails to recognize her. Meanwhile, Patel gets possessive and jealous as he feels Shanaya is ignoring him and spending more time with her co-actor. When Patel notices Shanaya grooving to music with a band, he gets extremely upset and bawls at her, “When you have time to do all this, you have time for parties, you have time for your co-actor, why don’t you have the time for me? Have you ever asked me if I’m okay or not, even once?”Shanaya feels insulted and gets outraged, and packs her suitcase to leave his house. She explains, “If we were together, would you be able to adjust to the lifestyle of an actress. Would you be able to control yourself when people stare at me? No. Because you’re insecure. It takes a strong, secure man to marry an actress.” She leaves the house.\r\n\r\nWhen Patel gets back from work, he is surprised to see a wedding is being arranged for him and he is groom. He is very confused and assumes he is about to get married to Shanaya. Shanaya gets that “Kenyan” woman and asks Patel to marry her. Patel confesses that he lied to her and tells her that he can’t marry her or that “Kenyan” woman. He says, “I’m already married. I love my wife very much. Please forgive me.” The “Kenyan” woman reveals that she’s Kokila and Shanaya explains that they set up this entire situation, when Kokila returned to the house. Jigar and Naina get engaged on that occasion. When Shanaya gets ready to leave, she says, “(Living with you), I’ve learnt more about life, than my role.”","TrailerLink":"https://www.youtube.com/watch?v=KNMoY9SoKpM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/KNMoY9SoKpM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":6,"Rating":1.45,"CensorRating":"U/A","ReleaseDate":"5/8/2015","Runtime":143,"Budget":150000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/83F4F2517249AB7A18991CD2E4DBD254.jpg"},{"Id":"b1cf5715","ImdbId":"tt2614722","OriginalTitle":"Umrika","Title":"Umrika","Description":"The film begins with Udai (Prateik Babbar) leaving his village for the United States. Following the death of father, Udai's younger brother Ramakant (Suraj Sharma) realises that the letters his family have been receiving from Udai have been forged by his father and uncle, and learns that Udai vanished when he reached his port city, Mumbai. He embarks upon a journey to locate his brother.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"1/23/2015","Runtime":98,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0D6C2725DDF48E00519C29459F90CEAE.jpg"},{"Id":"6e43e9e4","ImdbId":"tt2140465","OriginalTitle":"Tanu Weds Manu Returns","Title":"Tanu Weds Manu Returns","Description":"In London, four years later in their marriage, Tanu and Manu visit a mental rehabilitation center where they start bickering at each other. Because of Tanu's various allegations, Manu gets enraged, and is later taken by the doctors into custody suspecting his mental health. Tanu's friend Payal calls her from India and tells Tanu that she gave birth to a baby girl. Being alone at city, Tanu decides to return to her hometown, Kanpur. While leaving London, Tanu rings Manu's friend Pappi in Delhi and tells him to come to London and release Manu.\r\n\r\nIn Kanpur in her parents home, Tanu finds a crafty law student called Chintu has become a lodger who refuses to pay or leave. Chintu befriends Tanu and slowly develops a crush on her, being bemused by her antics. Tanu also comes to know that her ex-boyfriend, Raja Awasthi, is getting engaged to another girl. Pappi reaches London and gets Manu out and they reach India, where Manu sends a legal notice to Tanu to make her apologize, but she does not respond.\r\n\r\nOne day Manu goes to Delhi University to give a medical speech, where he sees Kusum, a young Haryanvi student-athlete, who looks like Tanu. He slowly gets obsessed with Kusum and keeps following her despite Pappi's warning. One day after Kusum confronts them, Manu tells her about Tanu. Kusum sympathises and they gradually develop feelings for each other. Manu tells Kusum he wants to marry her and meets Omi, her elder brother. Omi has no issues with Manu but shows a picture of the boy his wife wanted Kusum to marry, who turns out to be Raja. Payal calls Tanu and confides that her newborn baby's father is not her husband Jassi.\r\n\r\nChintu gets jealous of Raja going around with Tanu and tells her father about it. He even sends Manu a nasty legal notice for a divorce, without Tanu's consent, but Manu responds by agreeing, which shocks Tanu. She confronts Chintu who says he loves her but Raja shoves him off. Raja also discovers his engagement is being called off as Manu is going to marry the new girl in his life. Both Raja and Tanu are enraged and decide to go to Delhi to confront Manu.\r\n\r\nManu, Kusum and Pappi travel to Chandigarh to convince Komal, Payal's sister-in-law whom Pappi loves, to run away from her wedding with Pappi instead. There Kusum is mistaken by everyone at the wedding as Tanu, including by Payal, who tells her she had a test-tube baby as Jassi was impotent. Kusum gets frantic on hearing these secrets and gives Payal a karate chop which knocks her out. She also gives Komal a karate chop too and they smuggle her to Jhajjar, where Kusum's villagers are waiting. But once her family finds out she loves Manu, they attack Manu and Pappi and lock up Kusum. Omi arrives and saves the day with his logic. The village agrees to Kusum and Manu's marriage.\r\n\r\nAs wedding preparations start Tanu and Raja reach there with Jassi, Payal, their baby and Manu's parents. Tanu makes fun of Kusum who snaps at her saying she is a state-level champion who is independent, loving and honest. She also reveals the truth behind Payal's baby in front of Jassi. A shocked and drunk Tanu meets Manu at night who brutally brushes off her love. In the morning, Tanu tells Kusum she is sorry about her behavior and would like to stay and help at their wedding.\r\n\r\nOn the wedding evening, Tanu gets drunk and dances in front of Manu in the baraat. Her parents arrive with Chintu and are shocked to see Tanu shattered as Manu leaves for his marriage. Tanu sits quietly as Manu is marrying Kusum, until Manu stops and confronts Kusum, who confesses he still loves Tanu and cannot marry Kusum. Kusum honourably releases him and walks off, to break down privately.\r\n\r\nTanu and Manu are joyously reunited. Kusum comes out to find drunken Chintu, delivering an angry speech. She gives him a karate chop.","TrailerLink":"https://www.youtube.com/watch?v=wGGmyaurjAI","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wGGmyaurjAI\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":16,"Rating":4.0,"CensorRating":"U/A","ReleaseDate":"5/22/2015","Runtime":128,"Budget":390000000,"Revenue":2430000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0FB5755C82EC5E114AE563F432A764D1.jpg"},{"Id":"48cfbe1e","ImdbId":"tt3447364","OriginalTitle":"Detective Byomkesh Bakshy","Title":"Detective Byomkesh Bakshy","Description":"Detective Byomkesh Bakshy! is a 2015 Indian action mystery thriller film directed by Dibakar Banerjee and produced by Banerjee and Aditya Chopra.The story is based on the fictional detective Byomkesh Bakshi created by the Bengali writer Sharadindu Bandyopadhyay. The film stars Sushant Singh Rajput, Anand Tiwari and Swastika Mukherjee in principal roles.\r\n\r\nIn 1940s Calcutta, recent college graduate Byomkesh Bakshy (Sushant Singh Rajput) squares off against an evil genius who wants to destroy the world. \r\nIn a contemporary interpretation of war-torn Calcutta during the 1940s, the film follows the first adventure of Byomkesh (Sushant Singh Rajput), fresh out of college, as he pits himself against an evil genius who is out to destroy the world. It's his wits against the most villainous arch criminal the world has seen, in a world of murder, international political intrigue and seduction","TrailerLink":"https://www.youtube.com/watch?v=ZG--GOpi_0g","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ZG--GOpi_0g\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":16,"Rating":3.9,"CensorRating":"U/A","ReleaseDate":"4/3/2015","Runtime":147,"Budget":350000000,"Revenue":360000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/7807ED14A928976EBD8DFA30B649A190.jpg"},{"Id":"b0a6a6c2","ImdbId":"tt4338154","OriginalTitle":"Hawaizaada","Title":"Hawaizaada","Description":"During the era of British India, lives a happy go lucky, school drop-out Shivkar Bapuji Talpade aka Shivi (Ayushmann Khurrana), who falls in love with a local stage dancer Sitara (Pallavi Sharda). This makes Shivi's father throw him out of the house and he bumps into a crazy scientist Pandit Subbaraya Shastri (Mithun Chakraborty). Shastri is constantly been chased by British soldiers for his weird experiments but lesser they know that Shastri is secretly building a flying machine. Seeing Shivi's great knowledge of Vedas, Shastri shares his secret book based on ancient Indian aeronautics, which he was using to build an aeroplane. Shastri offers Shivi to be his assistant but Shivi refuses. Shivi later proposes to Sitara to marry her, but Sitara resists on the grounds that society will not accept their marriage and goes away to Hyderabad.\r\n\r\nHeartbroken, Shivi goes back to Shastri and accepts his offer to assist him. Together they work for several months to design a perfect machine which can fly but kept failing. On running out of funds they request a local king to sponsor their experiments. Finally, they manage to build a small aeroplane and had a successful unmanned test flight in presence of many eyewitnesses, but it crashes within a few seconds. Shivi later learned that Sitara is back in Bombay and now lives in a poor condition under heavy debts. Shivi and Sitara reunite, but in order to get her out of debt, Shivi sells Shastri's secret book to a British officer. Feeling betrayed, Shastri could not survive this trauma and dies. Shastri's death makes Shivi feel so guilty, that he decides to fulfil Shastri's incomplete dream along with Sitara and his nephew Narayan.\r\n\r\nIn his quest to build a perfect flying machine, Shivi goes to Banaras to meet a guru, to whom Shastri used to refer. The guru gave Shivi a code \"4121\", which later helped Shivi to figure out that mercury will be the best fuel for the engine, since the word \"mercury\", when written in Hindi in terms of chemistry, looks like the number 4121. Before Shivi could complete his machine, British officers arrest him on his brother's complaint. After being rescued by a freedom fighter, Shivi finally takes the aircraft to sea beach. In the end, before soldiers could arrest him again, Shivi flies away with Sitara and they become the world's first humans to ride in a flying machine.","TrailerLink":"https://www.youtube.com/watch?v=pjtN0IV_lJc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/pjtN0IV_lJc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":13,"Rating":2.73846,"CensorRating":"U/A","ReleaseDate":"1/30/2015","Runtime":148,"Budget":250000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4B3C505556F26342004C397046229450.JPG"},{"Id":"4f974fea","ImdbId":"tt2202086","OriginalTitle":"Ab Tak Chhappan 2","Title":"Ab Tak Chhappan 2","Description":"Ab Tak Chhappan 2 opens to encounter specialist Sadhu Agashe (Nana Patekar) proclaiming what he did was right. The film then goes into flashback, where we are shown what happened a few months back. Away from Mumbai, with a few cases pending against him, Sadhu now leads a peaceful life in his village (Goa) with his son Aman, mourning the loss of his wife. He cooks, lives in a house by the river and listens to his son playing the piano. However, his retired phase comes to a halt, when ex-police commissioner (Mohan Agashe) convinces Sadhu to get back on the job on the home minister's (Vikram Gokhale) request to tackle Mumbai's escalating crime scene.\r\n\r\nSadhu is hesitant but his son talks him into accepting the offer, which brings him back to Mumbai. While Sadhu's encounter squad is happy to see him, Thorat (Ashutosh Rana), Sadhu's junior is not too pleased with the decision as he hopes to become the chief. Sadhu senses the rivalry and makes it clear to Thorat that he will have to follow orders.\r\n\r\nThe squad begins their mission by reconnecting with their sources and targeting gangsters of two gangs (Rauf and Rawale). Meanwhile crime reporter Shalu Dixit (Gul Panag) becomes a regular visitor at Sadhu's residence, since she wants to finish the book on 'encounter cops', which her journalist father couldn't complete, since he was shot by a gangster.\r\n\r\nAs the encounter squad goes on a shooting spree, Sadhu starts getting threats from unknown parties. Soon, Sadhu's son is targeted by the gangsters and is killed. Rawale informs Sadhu that Rauf has done it. Sadhu nabs Rauf. He initially denies being the culprit but later accepts it. However, he also warns Sadhu that Rawale has been assigned the job of killing the righteous CM (Dilip Prabhawalkar) by someone, whom Sadhu trusts a lot. Before Rauf could give away the name, he gets shot by Thorat. The latter says he was ordered to do so. It is soon announced that Rawale would be returning to Mumbai and may join politics soon. Both Sadhu and Shalu suspects that the home minister is involved in the CM's assassination and was the one who took Rawale's help to plot the murder.\r\n\r\nSadhu confronts the home minister and the later admits it, saying his political career wouldn't have taken off in the presence of the CM, who didn't favour him and his devious activities. He also dares Sadhu to expose him, having a firm opinion that no one would believe Sadhu.\r\n\r\nSadhu decides to give up but Shalu tells him that she has found evidence against the home minister, a video proof of his meeting with Rawale but before she could pick up the CD, she gets shot by Thorat, who is now revealed to be Jagirdar's Henchman. Sadhu arrives at nick of time and shoots Thorat dead before he can kill Shalu.\r\n\r\nSadhu goes to an event, where the home minister is to pay tribute to the late CM. Sadhu steps on stage, requests he be given an opportunity to speak. After appreciating the Home Minister, he quickly moves towards him and stabs a sharp pen into his shoulder, thus killing him.\r\n\r\nThe film continues at present time, and it is revealed that Aman is alive. His death was merely faked to eliminate the underworld. Commissioner Pradhan leaves after interrogating Sadhu, and promises him that he will take care of Aman. An epilogue is shown where we are told that Sadhu was given life imprisonment for also killing Rawale in same jail where both were imprisoned together.","TrailerLink":"https://www.youtube.com/watch?v=bhiHnL8Gx8o","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/bhiHnL8Gx8o\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":12,"Rating":2.9,"CensorRating":"U/A","ReleaseDate":"2/27/2015","Runtime":105,"Budget":165000000,"Revenue":66400000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F26AA68EF4F92531DE1E039B6AEECC78.jpeg"},{"Id":"3bb807be","ImdbId":"tt4170186","OriginalTitle":"Beeba Boys","Title":"Beeba Boys","Description":"Beeba Boys: a ferocious, adrenaline-charged Indo Canadian gang war, and a violent clash of culture and crime. Gang leader Jeet Johar and his young, loyal, and often-brutal crew dress like peacocks, love attention, and openly compete with an old style Indo crime syndicate to take over the Vancouver drug and arms scene. Blood is spilled, hearts are broken, and family bonds shattered as the Beeba Boys (\"Good Boys\") do anything \"to be seen and to be feared\" in a white world.","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"1/1/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/72A7A79A333B0ADADE3E0191629384E3.jpg"},{"Id":"c291ce58","ImdbId":"tt3679000","OriginalTitle":"Any Body Can Dance 2","Title":"Any Body Can Dance 2","Description":"Based on the actual story of the Fictitious Dance group; their rise to fame, sudden downfall, and their heroic attempt to seek vindication by regaining their lost pride and glory.","TrailerLink":"https://www.youtube.com/watch?v=IKUtAC-dwFM","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/IKUtAC-dwFM\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.8,"CensorRating":"U/A","ReleaseDate":"6/19/2015","Runtime":154,"Budget":650000000,"Revenue":1570000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/8C111D8F32DF616E0BD4232FAA5328A3.jpg"},{"Id":"78b729c8","ImdbId":"tt2424988","OriginalTitle":"Gabbar Is Back","Title":"Gabbar Is Back","Description":"The police get information that 10 tehsildars across Maharashtra have been mysteriously kidnapped. But they are as mysteriously returned - except the most corrupt officer, who is hanged in public. The police get a CD from mystery man 'Gabbar' who says his mission is to target corrupt officers. Police driver Sadhuram (Sunil Grover) is convinced he can crack who Gabbar is - but his superior officers insulted him in front of all the other officers.\r\n\r\nOn his way home, Professor Aditya (Akshay Kumar) is stopped by lawyer Shruti (Shruti Haasan) who makes him drive her and a pregnant woman to the hospital. When Shruti wants to thank Aditya, she finds he has left. Sadhuram finds from the village tehsil to the district office that there's one honest officer in each department. He's convinced all these honest officers have a link to the Gabbar case. Shruti and Aditya become close, and one day, she gets hit by a scooter. Although not badly injured, doctors at Patil Hospital insist on taking expensive tests and Aditya realizes how helpless patients and their families are fleeced and often, inhumanly treated. A poor woman mourns her deceased husband in the civil hospital nearby. Aditya tells her he'll get her medical insurance. He checks in her husband as a patient to Patil Hospital. The hospital tries to swindle money out of Aditya by pretending to treat the dead man, making Aditya pay for tests and medicines. Aditya then shows them the death certificate, which proves they knowingly admitted a dead man. The young owner of the hospital is furious when Aditya releases the video of the hospital's corruption to the media. However, the owner is killed by an angry mob. His father, powerful builder Digvijay Patil (Suman Talwar), sees Aditya in the hospital CCTV footage and is stunned to realize that this is the same man he supposedly killed five years ago.\r\n\r\nAditya and Shruti attend a wedding where Aditya remembers his late wife Sunaina (Kareena Kapoor Khan) and how they moved into a new apartment when they were expecting a baby. While Aditya was out playing Holi, the building collapsed and killed hundreds of people, including his wife and unborn child. Aditya collected proof of the faulty building against builder Digivijay Patil, but Patil bribed everyone and no one was willing to hear Aditya out. Aditya beats Digvijay severely but the latter attacks him with an axe and thinks his blows have killed Aditya. But a bus full of medical students finds unconscious Aditya on a highway and save his life. He then decides to use the power of young, idealistic, honest youth and trains students at National College to join his cause. Sadhuram meanwhile finds out all the honest officers attended National College. Shruti sees Aditya as Gabbar and is shocked but when he tells her the truth, she supports his cause.\r\n\r\nCBI officer Pahwa (Jaideep Ahlawat) taking charge is mystified by the case. He listens to Sadhuram's findings and they arrest National College students. But even upon being beaten, the students don't divulge anything about Gabbar. Shruti tells the CBI officer that because the law doesn't work, a vigilante like Gabbar is a hero for ordinary citizens today. Sadhuram changes his view of Gabbar. Patil kills an honest officer to terrorize others into passing his faulty building plans. The cops are sure Gabbar will target Patil for this outrageous act - and he does. Patil throws a birthday party for himself at his farmhouse. As he cuts the cake, he spots Gabbar in the crowd. The next moment, Gabbar and his gang kidnap him, wearing the same masks. As police search the city for Patil, Gabbar tells him to call anyone to save himself - but every minister tells him to not involve them, so that Gabbar doesn't come after them next. Gabbar and Patil then have a violent clash and Gabbar kills Patil.\r\n\r\nAditya goes to the police to hand himself in. He is given the death penalty but there are huge public protests and enraged students block his jail van. Officer Pahwa requests him to speak to the students and he does, telling them to channel their anger against corruption and be the change society needs. As Aditya is taken to be hanged, Shruti breaks down, but he leaves, smiling, asking the hangman, Ab tera kya hoga, Kaalia.","TrailerLink":"https://www.youtube.com/watch?v=T95zFC4Z2pY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/T95zFC4Z2pY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.60938,"CensorRating":"U/A","ReleaseDate":"5/1/2015","Runtime":128,"Budget":720000000,"Revenue":1054800000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/5AD45575DD4FC5AFE59800492F1BB222.jpg"},{"Id":"8bcea71f","ImdbId":"tt3137546","OriginalTitle":"Legacy","Title":"Legacy","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"6/19/2015","Runtime":95,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/62458F7E5C6D7634222C83A6586A1183.jpg"},{"Id":"e4accca0","ImdbId":"tt2345634","OriginalTitle":"Hey Bro","Title":"Hey Bro","Description":"Hey Bro is a 2015 Hindi action comedy film directed by Ajay Chandhok, produced by Vidhi Acharya and Music by Nitz 'N' Sony (Nitin Arora & Sony Chandy) Lyrics by Pranav Vatsa. The film stars Ganesh Acharya, Maninder Singh, Nupur Sharma and Hanif Hilal.\r\n\r\nA villager goes to Mumbai to find his judwa brother. But he finds his judwa brother is opposite to him and the whole movie runs around this.","TrailerLink":"https://www.youtube.com/watch?v=wu55BQG-W7M","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/wu55BQG-W7M\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":10,"Rating":2.45,"CensorRating":"U/A","ReleaseDate":"3/6/2015","Runtime":120,"Budget":150000000,"Revenue":12600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/34CF3E9781CEE36117AC1BEB68AEEC0E.jpg"},{"Id":"4802f5d6","ImdbId":"tt3802576","OriginalTitle":"Brothers","Title":"Brothers","Description":"Two estranged, street-fighting brothers square off against each other in a mixed martial arts tournament.","TrailerLink":"https://youtu.be/QuRSCU0tOKs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/QuRSCU0tOKs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.4,"CensorRating":"U/A","ReleaseDate":"8/14/2015","Runtime":156,"Budget":820000000,"Revenue":1226200000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/94BB239C2115D62A7A711CFDDB954055.jpeg"},{"Id":"d1a6fa09","ImdbId":"tt3848892","OriginalTitle":"Baby","Title":"Baby","Description":"The story follows a team of fictional secret agents called Baby; which is a temporary task force headed by Feroz Khan (Danny Denzongpa) formed in response to the 2008 Mumbai attacks whose job is to find and eliminate terrorists who are planning attacks in India.\r\n\r\nWhile attempting to rescue a fellow Indian security agent in Turkey, Ajay Singh Rajput (Akshay Kumar) captures a traitor Jamal (Karan Aanand) who formerly worked under Ajay and threatens to kill his family unless he gives them the information about their terror attack plans on India. Ajay is told about a terrorist plot to cause a bomb blast in a Delhi mall which he and Jai (Rana Daggubati) are able to prevent. In the process they learn that this was only the first, of a series of massive attacks that had been planned. Terrorist mastermind Maulana (Rasheed Naz), is causing trouble near the Pakistan-India border. He plans and executes a daring prison escape plan for Bilal (Kay Kay Menon). A team of officers is dispatched to interrogate Taufiq who is an ISI agent posing as a local leader. Ajay manages to get information on their local contacts after torturing him. They go to their hideout, but things go haywire when all of the squad members on the mission except Ajay are killed in an explosion. To collect further information from a terrorist logistics planner in Nepal, Ajay and officer Priya (Tapsee Pannu) travel to Nepal pretending to be husband and wife. Their plan to capture the terrorist Wasim Khan (Sushant Singh) goes wrong when Wasim finds out that Priya is in fact an undercover officer. Priya manages to hold Wasim and Ajay arrives to find that Priya has knocked him unconscious.\r\n\r\nAs per the information given by Wasim, Feroz sends Ajay, Jai and Shukla (Anupam Kher) to meet their deep asset Ashfaq (Mikaal Zulfiqar) in Saudi Al-Dera where Bilal is holding meetings to discuss the funding and execution of their plans. Ajay and Jai crack into Bilal's room with the help of Shukla and manage to kill Bilal. As they are about to return, they find that Maulana is also at the suite. Jai knocks him out and they decide to bring Maulana back to India, under the pretext that he is a relative who needs to visit India for an urgent liver transplant. They manage to get a visa from the local authorities for Maulana (being shown as Ashfaq's ill uncle) with Ashfaq's help. Soon after, the hotel security discover the corpse of Bilal. The Arab police authorities put the police chief Hani Mohammad (Hasan Noman) on charge of investigating the crime. He attempts to track down the murderers quickly and eventually succeeds. However, once he learns that the murderers are Indian military agents who are attempting to smuggle Maulana back to India, he smiles and lets them escape without any hindrance. For successfully bringing in Maulana, Baby is given permanent status.","TrailerLink":"https://www.youtube.com/watch?v=-Yu_2nyOP5o","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/-Yu_2nyOP5o\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":17,"Rating":4.05,"CensorRating":"U/A","ReleaseDate":"1/23/2015","Runtime":159,"Budget":589700000,"Revenue":1250000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E25E978CFF4984AB9FD976E1E32FA31E.jpg"},{"Id":"04cbc9e7","ImdbId":"tt1321869","OriginalTitle":"The Lovers","Title":"The Lovers","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"","RatingCount":1,"Rating":2.0,"CensorRating":"","ReleaseDate":"2/13/2015","Runtime":109,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/688204AFDDF4756D7EF5191C4DC94B26.jpg"},{"Id":"1fbaa65c","ImdbId":"tt3848938","OriginalTitle":"Mr. X","Title":"Mr X","Description":"After gaining the power of invisibility; a man becomes a vigilante, in order to take revenge on those who have wronged him.","TrailerLink":"https://www.youtube.com/watch?v=uMT-neszmVU","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/uMT-neszmVU\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Thriller","RatingCount":8,"Rating":1.85,"CensorRating":"U/A","ReleaseDate":"4/17/2015","Runtime":133,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/32216253807FB0EB3B1ECD74D026ABBA.jpg"},{"Id":"8047a4c0","ImdbId":"tt4684028","OriginalTitle":"Guddu Rangeela","Title":"Guddu Rangeela","Description":"Based in the dusty plains of North India, Guddu Rangeela is a story about two cousins trying to make ends meet in the crime infested surroundings. Orchestra singers by day and informants by night, acquiring measly pay offs from the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. Although cousins by blood, both are very much unlike each other. The love hate rapport of the two comes to be seen through the many dangerously funny circumstances that they are met with and their impromptu methods of saving their skin each time. Having suffered a tragic past at the hands of the gang lord turned politician Billo; the antagonist of the tale; both are discreetly entangled in a 10 year old legal battle against him through Gupta, an honest advocate fighting on their behalf. While the unorthodox and impulsive Guddu aspires to grow out of their hand to mouth way of life by executing the loot themselves, the comparatively self-righteous and mature Rangeela despises the idea of getting onto the dark side of the city's law. Like money, women too are Guddu's poison, who is time and again seen flirting and effortlessly pulling off one night stands. Rangeela on the contrary hasn't moved on from the tragedy that consumed his only love Babli years back. Rangeela's prime motto has always been to overthrow his nemesis Billo, thus undoing the injustice and cruelty that transpired years back. Lucky enough, one such opportunity comes knocking, which he immediately snags and in the process finds himself confronting the vicious and tyrannical Billo. What follows is a chaotic tale of redemption and payback. An ambition, a plan, a kidnapping and a to and fro tale of victory and defeat leading up to a dramatic climax.","TrailerLink":"https://www.youtube.com/watch?v=EOGKZTxvCss","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/EOGKZTxvCss\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.59583,"CensorRating":"U/A","ReleaseDate":"7/3/2015","Runtime":124,"Budget":150000000,"Revenue":73600000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0B2AB5DB7637FED5B8CD76D49E94A552.jpg"},{"Id":"361063fb","ImdbId":"tt4023852","OriginalTitle":"Welcome 2 Karachi","Title":"Welcome 2 Karachi","Description":"Story kicks off with two dumb and dumber friends, Shami (Arshad Warsi) a court martialed navy officer and Kedar (Jackky Bhagnani) a Gujarati who has been denied American visa multiple times. Both plans to sail to USA using a boat but with a twist of fate, end up on the beach of Karachi, Pakistan. On realizing the truth they both try to escape, while being chased by an ISI Agent (Lauren Gottlieb). Both get kidnapped by a local don Azher Baluch, who demands ransom from Kedar's father and later releases them in a pathan colony to collect fake passports. But Shami, messes up with a bunch of pathans over an India-Pakistan match. In struggle to escape from pathans both meets a talibani militant, who takes them to a Taliban camp where they are misunderstood as Talibani militants.\r\n\r\nFew days later, Shami and Kedar plans to escape the camp by stealing camp leader's mobile phone, which was actually a detonator of a bomb designed by Taliban to attack US army. In attempt to dial a number Shami unknowingly triggers the bomb destroying the Talibani camp itself. Attracted by the explosions, a Drone arrives and the two are arrested by American Army. After knowing their reality both are been released only to be captured by Pakistani intelligence, who wants to take the credit of attack on Taliban by announcing both Shami and Kedar as Pakistani soldiers.\r\n\r\nSoon the two are declared as national hero by Pakistani media while the Indian media claims them as Indians stuck in Pakistan. Caught in this tough of war Shami and Kedar are once again been kidnapped by American army, who promises to deport them to India if they could give the credit of Talibani camp attack to US Army in media. They agree and are been sent to Karachi Airport to finally catch a flight back to India. While waiting for their flight, Shami notices a Talibani militant disguised as an airlines pilot. Seeing a possibility of a terror attack they both decide to rescue, being backed by Pakistani army. During crossfire Shami and Kedar manage to over power the militant and takes off with the plane, finally able to depart from Pakistan. Movie ends with both sitting in cockpit only to find a strange voice behind them (possibly another militant).","TrailerLink":"https://www.youtube.com/watch?v=gb3WnG4HXc4","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/gb3WnG4HXc4\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Comedy","RatingCount":10,"Rating":2.03,"CensorRating":"U/A","ReleaseDate":"5/28/2015","Runtime":131,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BBA90F966B6D708C00237663CC2CEE0F.jpg"},{"Id":"99b6a0ab","ImdbId":"tt4588730","OriginalTitle":"Chal Guru Ho Ja Shuru","Title":"Chal Guru Ho Ja Shuru","Description":"Chal Guru Ho Ja Shuru is a 2015 Hindi film Produced by Pankaj Narayan and Apoorva Bajaj of Ath Entertainment Pvt. Ltd. in association with Himalayan Dreams, the film is a hilarious take on the fake godman who rule the roost these days. This film is a comic satire on the life of the many fake new-age gurus who thrive at the ignorance of general public. It is a satire on those who use religion for their petty personal gains. At same time, the film also carries a strong social message. Directed by Manoj Sharma, who was in news some years back for his another directorial venture Swaha: Life Beyond Superstition. The lead role is played by actor Hemant Pandey who essayed the rile of Pandeyji in the Noted TV serial Office Office, that was telecast on Sab TV. Sanjay Mishra, best known for his character of Apple Singh, an \"icon\" used by ESPN Star Sports during the 1999 Cricket World Cup, is also portraying an important role in the film. In fact, most actors Office Office have been roped in for this film. Others include Chandrachur Singh, Brijendra Kala, Geeta Bisht, Tiku Talsania, Govind Pandey and Vrajesh Hirjee. The film released in India on 30 January 2015. Movie had been exempted from tax by Chief Minister of Uttarakhand Harish Rawat ahead of its release.","TrailerLink":"https://www.youtube.com/watch?v=SnNvGVaeJkc","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/SnNvGVaeJkc\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":10,"Rating":2.3,"CensorRating":"U/A","ReleaseDate":"1/30/2015","Runtime":127,"Budget":10000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/809203B4F4ED8E093D4430DCB21C4210.jpg"},{"Id":"3317cd45","ImdbId":"tt3495030","OriginalTitle":"Dum Laga Ke Haisha","Title":"Dum Laga Ke Haisha","Description":"Set in 1995, Prem Prakash Tiwari (Ayushmann Khurrana) owns a cassette shop in the local market of Haridwar. His father is keen to get him married to an educated but overweight girl Sandhya (Bhumi Pednekar). In spite of him not liking her, the school drop out Prem must marry her because he is incapable of attaining a girl with 'Juhi Chawla-level-of-looks.' In an elaborate community-wedding ceremony, Prem and Sandhya get married.\r\n\r\nPrem visibly shows his disinterest in the marriage and does not consummate the marriage on the wedding night. While his sister, aunt and mother argue about his non-existent life, Prem leaves for akhara. Friends and seniors make fun of him and he tells them about his anguish. His trainer suggests that he must run away but that is not an option for him. At home, Sandhya tries to get Prem attracted to her. But he is too embarrassed to even walk with her in market. Prem and Sandhya's relationship continues to remain strained although they do kiss and have sexual intercourse on their second night together. Over time, Sandhya's frustration shows, when Prem's aunt brings up a petty topic, the two have a heated exchange of words and she tells them how he does not treat her well.\r\n\r\nAmidst all this, a close friend of Prem's gets married. Prem and Sandhya go for the ceremony where due to his excessive drinking and jealousy over his friend's pretty wife, he tells everyone that sleeping with Sandhya feels like hell. Sandhya hears this and slaps him in front of his friends and he slaps her back. The next morning, Sandhya reflects on what she's been through and decides she has had enough and decides to leave Prem. She blames her father-in-law for his lack of respect towards women and not giving his son a proper education. Sandhya's mother tries to pacify her that she must return to her husband. But she decides that she can live by herself. Meanwhile, Prem decides to channel his energy into studying and to take his English paper again; he enrolls for the examination. His friends too give up on him; after a verbal squabble, they throw him out of the group.\r\n\r\nSubsequently, a friend's father opens a competing shop selling music CDs in the same market, clearly affecting their business. Prem's family talks to the shop-owner's family and the discussion ends with Prem's friend challenging him to participate and win the \"Dum Lagao\" contest. (The contest entails him picking up his wife on his shoulders and running an obstacle course). Meanwhile, Sandhya and Prem reach the court to file divorce. The court decides that the two must spend six months with each other and try to salvage their marriage. Both decide to live together just as a formality but the two begin to get on, as they both start understanding each other. Sandhya gets accepted for a teaching job in Meerut.\r\n\r\nPrem's aunt successfully convinces him to participate in the competition and the couple take a last chance to save their marriage. The day arrives and much to the surprise of the society members, Prem and Sandhya join the co-participants. Surprisingly, Prem shoulders the weight of his wife and surges past all other contestants who fall. In the last lap, Sandhya confesses to Prem that she does not want to go to Meerut and wants Prem to let her stay. Prem knows winning this competition is the only way to do this and pushes himself further to eventually win the race, defeating his friend who owns the CD store.\r\n\r\nBut Prem does not let Sandhya get off his back even long after the race is over. He takes her back all the way to his house where they seal their love with a kiss and witness their love blossoming for the first time.","TrailerLink":"https://www.youtube.com/watch?v=lFZpPpSU3k0","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/lFZpPpSU3k0\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.75,"CensorRating":"U/A","ReleaseDate":"2/27/2015","Runtime":110,"Budget":150000000,"Revenue":1000000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A5D32DDBBAE291BE89165B33E1295CC2.jpg"},{"Id":"087da473","ImdbId":"tt4635372","OriginalTitle":"Masaan","Title":"Masaan","Description":"Four lives intersect along the Ganges: a low caste boy hopelessly in love, a daughter ridden with guilt of a sexual encounter ending in a tragedy, a hapless father with fading morality, and a spirited child yearning for a family, long to escape the moral constructs of a small-town.","TrailerLink":"https://www.youtube.com/watch?v=IVZzYa0MxM8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/IVZzYa0MxM8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":17,"Rating":4.05,"CensorRating":"U/A","ReleaseDate":"7/24/2015","Runtime":109,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/46707E339E955EA72D2AA92FCCD8394C.jpg"},{"Id":"94c70718","ImdbId":"tt4430212","OriginalTitle":"Drishyam","Title":"Drishyam","Description":"Vijay Salgaonkar (Ajay Devgn) is an orphan who had dropped out of school after his 4th grade. Now he is a contended successful businessman running a cable TV service called Mirage Cable in Goa. He is married to Nandini (Shriya Saran) and they have two daughters, Anju, his adopted daughter (Ishita Dutta), a Plus Two student, and Annu, a student of class sixth. His only interest apart from his family is watching films. He spends most of his time in front of the TV in his small office.\r\n\r\nDuring a nature camp, Anju gets recorded on video in the bathroom by a hidden cell phone. The culprit, Sam aka Sameer is the son of Inspector General of Goa Police Meera Deshmukh (Tabu). Sam comes to blackmail Anju, when Vijay is out of home. Nandini intervenes and pleads with Sam to leave their family. But Sam refuses to leave them or delete the video clip unless his demand is fulfilled. Suddenly Anju hits Sam's hand to break his mobile phone, but it hits his head hard and Sam dies immediately. They hide his body in a compost pit, which is witnessed by Annu. At morning, Nandini tells Vijay about the incident and he devises a way to save his family from the police. He removes the broken cell phone and disposes of Sam's car, which is seen by Sub-Inspector Laxmikant Gaitonde, who has a grudge against Vijay. The next day, Vijay takes them out on a trip to Panjim, where they visit an Ashram, watch a movie and eat at a restaurant. Meera, realising that her son has gone missing starts an investigation.\r\n\r\nAfter a preliminary investigation, Meera calls Vijay and family for questioning. Vijay had predicted that this would happen and taught his family how to change their alibi at the time of murder. When questioned individually, they replied the same thing and they had also shown the bill of the restaurant, the movie ticket and the bus journeys' tickets as proof of their alibi. Meera questions the owners of the establishments they have been to and their statements prove Vijay's alibi. Meera realises that on the day of the incident, Vijay had taken the tickets and the bill, made acquaintance with the owners and had gone for the trip with his family the next day, thus proving his alibi and making the owners unwittingly tell the lie.\r\n\r\nMeera arrests Vijay and family and Gaitonde uses brute force to beat the truth out of them. Eventually, Annu gives in and reveals the place where the body is buried. After digging the compost pit, they find the carcass of a dog, indicating that Vijay had moved the body. Vijay reports to the media that Gaitonde thrashed both his daughters and complains against Gaitonde causing the public to beat up Gaitonde. The Sub-inspector is suspended and Meera resigns from her post. When Nandini asks Vijay about what he did to the body, he refuses to tell her, saying that it'll only worsen things. The fact that she does not know where the body is in fact better than she knowing it. Meera and her husband meet Vijay to ask forgiveness for their rude and violent behavior. But Vijay indirectly tells them that he had got rid of 'the uninvited guest'. Vijay, now in remand, signs a register at the newly constructed local police station. Police inspector threatens Vijay that he shall find the body. As Vijay leaves, a flashback shows him leaving the incomplete police station with a shovel in hand, indicating that he has hidden Sam's body under the floor of the police inspector's room in the station itself.","TrailerLink":"https://www.youtube.com/watch?v=AuuX2j14NBg","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AuuX2j14NBg\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":21,"Rating":4.39048,"CensorRating":"U/A","ReleaseDate":"7/31/2015","Runtime":163,"Budget":620000000,"Revenue":738400000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/F7CBAAD11D35283EF708E60CF803BDCF.jpg"},{"Id":"018603bb","ImdbId":"tt3741834","OriginalTitle":"Lion","Title":"Lion","Description":"","TrailerLink":"","TrailerEmbedCode":"","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":1,"Rating":2.0,"CensorRating":"U/A","ReleaseDate":"12/31/2015","Runtime":0,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/448448AB0AD256FBF8956F23672B84C0.png"},{"Id":"b14e33c0","ImdbId":"tt3678782","OriginalTitle":"Badlapur","Title":"Badlapur","Description":"Misha (Yami Gautam) and her son Robin become the victims of a bank robbery getaway during a shopping trip. Liak (Nawazuddin Siddiqui) and his friend Harman (Vinay Pathak) are on the run after robbing a bank and use Misha's car to flee. Robin falls out of the moving vehicle during the struggle, while Misha is shot by Liak. Both mother and son later died from their injuries in the hospital. Harman jumps out of the car to protect the money while Liak is arrested.\r\n\r\nRaghu (Varun Dhawan), shattered from the loss of both his wife and his son, immerses himself in seeking revenge on both culprits. Liak is sentenced to 20 years in prison, but refuses to reveal the identity of his partner in crime. Raghu tries his best to get the name of this partner, who he believes killed his wife and child, but fails. He hires a detective and learns about Jhimli (Huma Qureshi), a prostitiute who is Liak's girlfriend, and visits her to inquire about the missing partner. However, he gets angry at Jhimli's trust in Liak and ends up torturing and raping her. After Liak's sentence, Raghu exiles himself to a reclusive life at a chance station where he gets down from a train and unsuccessfully attempts to commit suicide – Badlapur.\r\n\r\n15 years later, a cancer-ridden and terminally ill Liak is paroled from prison on compassionate grounds. Unknown to Liak, Raghu has facilitated the release by providing a letter of pardon for Liak to the court, in exchange for being told the elusive partner's name by Liak's mother. Bent on vengeance, Raghu starts for Pune and finds Harman, who now runs a well-established restaurant in Pune and is a respected member of society.\r\n\r\nAfter his parole, Liak is kept under watch by police as they believe he will lead them to the unknown partner. Liak nevertheless manages to contact Harman, and arranges to meet him and take his share of the money. However, Raghu has already met and interrogated Harman along with Harman's wife Kanchan (Radhika Apte). Harman pleads with Raghu not to reveal his name to the cops. He tells Raghu that while he was involved in the robbery, it was Liak and not him who shot and killed his son and wife. Raghu, however, does not seem convinced. Harman promises to give Raghu Liak's share of the money. Raghu takes the money but kills both Harman and his wife. Raghu meets Shobha (Divya Dutta), the NGO worker who was instrumental in arranging Liak's parole, to create an alibi. He pretends to be in love with Shobha and sleeps with her. Later he returns and buries the bodies of Harman and Kanchan on a lonely hilltop.\r\n\r\nPolice now turn suspicious and start investigating Harman, who seems to have disappeared with his wife.\r\n\r\nA despondent Liak learns from his mother that Raghu came to know Harman's name from her. Liak breaks into Raghu's house in search of the money and gets into a scuffle with Raghu. But Raghu soon overpowers Liak and beats him senseless. When Liak regains consciousness, Raghu tells him in detail how he killed Harman and his wife and disposed of their bodies and also tell him that Herman's wife was also ready to sleep with him.Liak tells Raghu that it was him, and not Harman, who killed Raghu's wife and child, but he did it in a moment of panic, unlike Raghu who, Liak points out, planned his murders with a cool mind and without any certain knowledge of guilt. Liak tells Raghu that there is no difference between them, and that Raghu has become mad and should go for treatment.\r\n\r\nLiak meets his former girlfriend Jhimli for one last time. Jhimli, who is now a keep of a local businessman, breaks down knowing that Liak is now near death.\r\n\r\nThe police inspector investigating the case now has circumstantial evidence that Raghu murdered Harman and his wife. He meets Raghu and offers a deal, the money which Raghu got from Harman for removing the evidence.\r\n\r\nLiak returns home in a distraught state knowing he has caused misery and possibly his friend's death too. He finds that his mother does not have a single good word to tell about his father and realizes that soon he will also be spoken of in the same manner by people – a complete no-gooder without a single good deed to speak of.\r\n\r\nRaghu refuses the policeman and prepares for a final showdown. Liak walks into the police station and confesses to killing Harman and his wife and also reveals where to find the dead bodies. Liak takes Raghu's blame, giving Raghu a second chance to live his life, and also doing one good thing in his own life before dying.\r\n\r\nAfter seven months, Liak succumbs to cancer in jail.Raghu finally did away with the Liak's share by dumping it in a drum and sending it away. Jhimli meets Raghu and tells him that he has a second chance thanks to Liak, that very few get such chances – Liak never did – and that he should not waste it. She also asks Raghu that, now that his revenge is complete and all the guilty are dead, what good it did for him. Raghu is silent as Jhimli drives away with Patil,leaving him standing in the rain.","TrailerLink":"https://www.youtube.com/watch?v=9KEoZanqlOE","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/9KEoZanqlOE\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":16,"Rating":3.8,"CensorRating":"U/A","ReleaseDate":"2/20/2015","Runtime":147,"Budget":250000000,"Revenue":770000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/36D771643373C6CB1A87AC1560CFD5B4.jpg"},{"Id":"c4237548","ImdbId":"tt3398048","OriginalTitle":"Tevar","Title":"Tevar","Description":"Pintoo (Arjun Kapoor) is a young Kabbadi player who goes to factionism-hit Mathura to take part in practice. There, in a twist of fate, he saves Radhika (Sonakshi Sinha) from Gajendar Singh (Manoj Bajpayee), a dangerous faction leader, who is in love with Radhika and wants to marry her against her wishes. Pintoo tries to comfort her because Gajendar Singh killed her brother. When he saves Radhika, he humiliates Gajendar into taking his pants off. Ganjendar refuses to put them back on until someone finds Radhika and brings her back. Pintoo helps Radhika escape and takes her to his house in Agra, hiding her in his room with the help of his sister, Pinky (Gunjan Malhotra).\r\n\r\nSoon, his parents find out she is hiding in their house. Radhika and Pintoo run away again and she falls in love with him. The next day, after taking care of Gajendar and his men, Pintoo and his friends drop Radhika off at the airport to go to America. Radhika cries on the way there, not wanting to leave Pintoo. They bring her parents to see her one last time before she leaves. After Radhika is past airport security, Pintoo realizes he loves Radhika. She shows up behind him, saying that she was waiting for him to stop her. She turns to leave when Pintoo is silent, taking it as a refusal, but Pintoo calls her back, and they confirm their love with a hug.\r\n\r\nPintoo's police chief father (Raj Babbar) and Gajendar show up at the airport, and Pintoo's father arrests him while Gajendar takes Radhika away. While under Gajendar's jurisdiction, Radhika taunts him and says that Pintoo will definitely come for her. Gajendar goes to the jail and asks Pintoo to come with him. Here, Pintoo and his father solve their relationship, when Pintoo's father expresses that he's not worried Pintoo will come home hurt; rather, he's worried for Gajendar.\r\n\r\nGajendar and his men get Pintoo injured in front of the whole town. The Home Minister, who is the reason Gajendar has not gotten in trouble all this time, tells him to stop making a scene, as he's ruining his political party, but Gajendar slaps the minister and goes on to fight Pintoo. He is further enraged when he sees how much Radhika loves Pintoo, and stabs him with a knife. Pintoo falls to the ground. Radhika tries to run to him, crying his name, but Gajendar drags her away. Pintoo is able to get up again, picking up the scarf that Radhika dropped. He ties it around his waist where the knife wound is, and fights and defeats Gajender's men. He also defeats Gajender until Gajendar gets back up with a gun. However, he is shot down by Kakdi, his own right-hand man on the instructions of the Home Minister who has had enough of Gajender's antics and insubordination and it is implied that Kakdi has now been appointed as Gajender's replacement. With Gajender dead, his goons have no interest in Pintoo and Radhika who are reunited and go home and they get married.","TrailerLink":"https://www.youtube.com/watch?v=LvMpWn2CNzs","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/LvMpWn2CNzs\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":9,"Rating":2.05,"CensorRating":"U/A","ReleaseDate":"1/9/2015","Runtime":159,"Budget":400000000,"Revenue":560000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/0A11B1F4D17CD685C85410D6E9E549C0.jpg"},{"Id":"6a2356cc","ImdbId":"tt4110568","OriginalTitle":"Dil Dhadakne Do","Title":"Dil Dhadakne Do","Description":"On a cruise to celebrate their parents' 30th wedding anniversary, a brother and sister deal with the impact of family considerations on their romantic lives.","TrailerLink":"https://www.youtube.com/watch?v=ZlIaiLoBEvk","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ZlIaiLoBEvk\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":15,"Rating":3.47333,"CensorRating":"U/A","ReleaseDate":"6/5/2015","Runtime":170,"Budget":850000000,"Revenue":1440000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/4868963F19DCD68C6700F48EA4416AF8.jpg"},{"Id":"ae3f8b63","ImdbId":"tt2334779","OriginalTitle":"Qissa: The Tale of a Lonely Ghost","Title":"Qissa The Tale Of A Lonely Ghost","Description":"During the Partition of India in 1947, a Sikh Punjabi named Umber Singh (Irrfan Khan) evacuates his house with his wife Mehar (Tisca Chopra) and three daughters. He is disgruntled at the fact that he does not have a son to carry on his family lineage which is assumed to be carried forward by the males of the next generation. He tells his wife that he is confident the next child will be a boy, but Mehar is unsure, and fearful that if she has another girl, Umber will leave her. During the birth of their 4th child, Umber takes the child from the womb and declares with happiness that it is a boy. Mehar checks the gender of the child and realizes the child is in fact a girl. Umber is declaring child to be a male because of his strong desire to have son. She tells Umber that it is better to kill the girl child than enforcing his desire of son on the child. Umber ignores her and happily, in his own denial, declares the new child as a boy named Kanwar and go to sleep.\r\n\r\nUmber fosters the Kanwar as a son and want her to gain strength, endurance, and ability to shoot a gun like a son. Kanwar has lapses of normal behavior for a young girl, including crying, giggling, and having her first period, which her father tries hard to repress and ignore. One time, when Kanwar goes out to play with her sisters, they end up fighting and Kanwar falls to the ground and breaks her leg. Once home and given proper medical treatment, Umber is blindingly furious at his three daughters for hurting his only \"son\". He drags his daughters off the bed and starts beating them mercilessly, but his wife Mehar comes in to stop him and tells him to get out. Umber declares if anything happens to his \"son\", he will cut his daughters to pieces.\r\n\r\nOnce Kanwar becomes a fully functioning \"man\" (Tillotama Shome), after having her turban ceremony, she starts to converse with a girl named Neeli (Rasika Duggal), who is the daughter of one of Umber's close friends. Kanwar and Neeli tease each other and kid around over the course of several weeks. In one instance, they fool around near the woods, where Kanwar tries to lock Neeli in a shed. She escapes and they both wrestle each other. Umber oversees this and sees his \"son\"'s happiness and asks Neeli's father for Neeli's hand in marriage to marry Kanwar. Soon, after the wedding ceremony, Neeli comes to know that Kanwar does not have a penis, though she doesn't know that he is actually a girl. Umber tells her that Kanwar had an 'accident' when he was younger. Neeli is disheartened knowing that she will never be able to have children with Kanwar. During one night, Neeli packs her bags and tries to escape her marriage. Umber spots her and pleads for her to come back. When she refuses, Umber wrestles her to the ground and attempts to rape her. Kanwar hears the commotion and comes outside to see her father trying to rape Neeli. Kanwar cries, trying to stop her father, but Umber tells her \"it is the only way to have a son in the family\". Umber promises Kanwar that if he leaves and lets Umber rape Neeli, they will have a son. Kanwar leaves in a fit of rage, but comes back carrying a shotgun, which he uses to shoot Umber in the back, killing him.\r\n\r\nAfter the funeral of Umber, Mehar forces Kanwar and Neeli to run away and start a new life together in her father's abandoned house and never come back. Neeli and Kanwar profess their affection to each other, accepting a sisterly love towards each other, but hiding Kanwar's gender from all others. As they continue to live together as women, Neeli helps Kanwar shed the manhood her father forced on her and embrace the fact that she is biologically a woman.\r\n\r\nAfter some time, Kanwar decides to go and bring her mother to their new home. When she arrives, she sees that their house has been burned down and her mother and two sisters have died in the fire. The only person left is her eldest sister, who has gone mentally insane and talks about \"making Umber's dinner and cleaning Umber's room\". As Kanwar explores the house, she sees her father's spirit in the mirror. The unsatisfied spirit of Umber continues to haunt Kanwar all the way back home. Umber tells Kanwar that they must make things right. Kanwar is haunted in her dreams by Umber, and on Lohri night, Kanwar yells out the window to her father that she wants to pretend to be a man as per his desire but her womanhood is beyond her control now and she is failing to control that. Kanwar strips naked and professes her womanhood. The town's people hear this and are extremely disproving. They attempt to break into the house. Neeli tells Kanwar to go and not to come back otherwise they will both get killed. Kanwar leaves again, and as she wanders through the desert she sees her father. Broken and at her wits end, Kanwar submits to her father's spirit who drowns her in an oasis. Umber goes to the village to call Neeli, where he masquerades as being Kanwar and removes his shirt off in front of the disputing villagers (to evince his masculinity); and later brings Neeli to the burned down house in which Kanwar's family used to live. He tells her that he will start the life once again and build everything afresh just like he did when he migrated from Pakistan. Neeli commits suicide by falling off the top balcony, leaving Umber by himself, wandering as a lost soul with his unfulfilled desire to have a son to carry his family lineage.","TrailerLink":"https://www.youtube.com/watch?v=t_6IDkVHFmY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/t_6IDkVHFmY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":14,"Rating":3.3,"CensorRating":"U/A","ReleaseDate":"2/20/2015","Runtime":110,"Budget":0,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/BAE45A5EAFE55AB2BCC3B8E066BB1FC7.jpg"},{"Id":"b948a38b","ImdbId":"tt2976182","OriginalTitle":"Roy","Title":"Roy","Description":"Kabir Garewal (Arjun Rampal), a Casanova film maker and screenwriter is making multiple films (GUNS Trilogy) based on a thief's life and robberies. All his films have been highly successful. In order to shoot the third part of the trilogy, he goes to Malaysia, where he meets a London-based film maker Ayesha (Jacqueline Fernandez). Kabir and Ayesha get friendly and soon fall in love. When Ayesha finds out about Kabir's Casanova attitude, she breaks up with him and returns to London. Dejected, Kabir goes into depression and returns to Mumbai, leaving his film incomplete. After several attempts, Kabir is unable to find the perfect climax for his film. On his assistant Meera's (Shernaz Patel) suggestion, Kabir attends a film festival as part of the jury, where Ayesha's film is being screened. Ayesha thinks Kabir is following her and asks him to stay away from her life. After his father's (Anupam Kher) death followed by him being sued by his film's financiers, Kabir decides to move on and complete his film.\r\n\r\nIn a parallel story, an infamous Roy (Ranbir Kapoor) is a mysterious international art thief whom no country seems to be able to get their hands on, including Detective Wadia (Rajit Kapur). On his new assignment, Roy goes to an unknown foreign land to steal an expensive painting only to find that its owner is the beautiful Tia (also played by Jacqueline Fernandez). Tia lives alone in a huge mansion where the painting is kept. Hence, Roy tries to befriend Tia during an art auction and soon impresses her with his charm. Sparks fly between them and both start spending time together, giving Roy entry into the mansion. Looking for the right opportunity, one night Roy runs away with the painting, leaving Tia heartbroken. Roy later regrets, as he realizes he has fallen in love with Tia. He decides to return the painting to her. After a small clash with the painting's new owner, Roy manages to get it back. On receiving the painting, Tia realises that Roy is now a changed man and forgives him.\r\n\r\nMeanwhile, Kabir's film Guns 3 is released and is hugely successful. It is then revealed that 'Roy' was just an imaginary character in Kabir's film, and that Roy and Tia's story was actually the script of Guns 3. In the end, Kabir proposes to Ayesha and they reunite, just like Roy and Tia in Kabir's film. However, the role of the fictional character 'Roy' in Kabir's movie was played by in-movie Ranbir Kapoor. The movie ends with Roy and Tia walking together over a bridge, similar to the stolen painting.","TrailerLink":"https://www.youtube.com/watch?v=ahz3kTiGo3s","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/ahz3kTiGo3s\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":7,"Rating":1.55,"CensorRating":"U/A","ReleaseDate":"2/11/2015","Runtime":146,"Budget":400000000,"Revenue":580000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/230064BED3AED0E480135E74A84CF3C0.jpg"},{"Id":"f440f290","ImdbId":"tt2979920","OriginalTitle":"Bombay Velvet","Title":"Bombay Velvet","Description":"Set in 1960s Bombay, the film tells the story of Balraj (Ranbir Kapoor), a street fighter/boxer who is in love with the jazz singer Rosie. Seeing Rosie (Anushka Sharma) with wealthy men further sparks his dream of becoming a \"big-shot\", believing that if he manages to become rich, he might win Rosie's heart. Balraj and his friend Chimman (Satyadeep Misra) then catch the eye of Kaizad Khambatta (Karan Johar), a wealthy businessman who is impressed by Balraj and offers him to manage his club \"Bombay Velvet\", which Khambatta uses to further his illegal tasks and activities. He also nicknames Balraj \"Johnny\", which then becomes his identification. As well as this, Johnny and Chimman fulfill minor tasks for Khambatta, including capturing a dirty photograph of a minister who Khambatta wants to blackmail. This news reaches Jimmy Mistri, a media reporter, who also happens to be the same wealthy man Johnny had previously seen with Rosie.\r\n\r\nRemembering that Johnny had a crush on Rosie, Mistri takes advantage of this and sends Rosie to Johnny's club to get her hands on the photograph of the minister. However, Rosie and Johnny eventually fall in love, until Mistri threatens to reveal Rosie's true identity to Johnny. Therefore, Rosie begins to supply information about Johnny & Khambatta's activities to Mistri. After a photograph of a secret meeting between Bombay's big-shots is leaked, Khambatta guesses that it was Rosie supplying the information and orders her to be killed. Johnny hears of this and forms an enmity with Khambatta, the man who brought him into the crime world.\r\n\r\nJohnny fakes Rosie's death and makes her act as if she is her long dead twin sister Rita. But soon Khambatta realises the truth, kidnaps Rosie and tries to kill Johny and they get into a stand off at Bombay Velvet. Khambatta shoots Rosie to provoke Johnny and fatally injures her. Johnny angry at this stabs Khambatta and is himself shot dead while trying to carry Rosie to the hospital, outside the club.","TrailerLink":"https://www.youtube.com/watch?v=AmMIQZ1TAig","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/AmMIQZ1TAig\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":12,"Rating":2.85,"CensorRating":"U/A","ReleaseDate":"5/15/2015","Runtime":149,"Budget":1200000000,"Revenue":318500000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/016453E626732C541D417607B27905E3.jpg"},{"Id":"d2194d76","ImdbId":"tt3863552","OriginalTitle":"Bajrangi Bhaijaan","Title":"Bajrangi Bhaijaan","Description":"In Sultanpur, a picturesque village in Azad Kashmir, villagers gather to watch a televised cricket match between India and Pakistan. Among them is a pregnant woman (Meher Vij) who, after giving birth, names her daughter Shahida after Shahid Afridi, the player who wins the game for Pakistan. One afternoon, Shahida (Harshaali Malhotra), now six years old, falls off a cliff, but is saved by an overhanging tree. Her worried mother takes her to the shrine of Sufi saint Nizamuddin Auliya in Delhi, with the hope that it will cure Shahida's speechlessness.\r\n\r\nReturning from Delhi, the train stops for repairs and Shahida gets off to play with a lamb. Unbeknownst to Shahida, the train drives off. Shahida boards a freight train, and winds up in Kurukshetra in the state of Haryana. There, she meets Pawan Kumar Chaturvedi also known as Bajrangi (Salman Khan), a devout Brahmin and an ardent devotee of the Hindu deity Hanuman. He calls Shahida \"Munni\" and tries in vain to find where she lives.\r\n\r\nIn sequences of flashback, it is revealed that Bajrangi has been a disappointment to his father, because Bajrangi failed his school exams ten times. When Bajrangi finally graduates on his eleventh try, his father dies of shock. Bajrangi, looking for a job, goes to the house of his father's friend and wrestling coach, Dayanand (Sharat Saxena), in Delhi. Having spent time together with his daughter Rasika (Kareena Kapoor Khan), they fall in love with each other and Dayanand promises of getting them married on the condition that Bajrangi get a job and buy a house. In the present, Bajrangi brings Munni to meet Dayanand, another devout Brahmin, who lets Munni stay, believing that with her fair complexion, Munni must be a Brahmin as well. Munni gets accustomed to being part of the household. It is eventually revealed that Munni is a Pakistani Muslim. An enraged Dayanand orders Bajrangi to make arrangements to have her sent to Pakistan through the Pakistan Embassy, where Bajrangi's pleading fails. A sudden turn of events stirs him to take Munni to her parents in Pakistan, in person and without a passport and visa.\r\n\r\nBajrangi and Munni are able to enter Pakistan. Shortly after their arrival, Bajrangi is arrested, suspected of being an Indian spy. He escapes with Munni and meets Chand Nawab (Nawazuddin Siddiqui), a journalist who works for a Pakistani television channel. Nawab has closely been following the developments. Moved by the story, Nawab joins Bajrangi to help him find Munni's parents. They are joined by an Islamic religious scholar (Om Puri), who helps them avoid capture by police. He directs the group to Azad Kashmir after Munni recognizes an area similar to her hometown in a photo from a calendar.\r\n\r\nNawab documents their journey on video, but no television station agrees to air it. Disappointed, he uploads the video on the Internet. While reviewing the footage, Munni recognizes her mother walking by in the background. With a bus driver's assistance, the trio identify Sultanpur as Munni's hometown. They board a bus to Sultanpur, and are stopped by police who are looking for 'the Indian spy'. Devising a plan to divert their attention, Bajrangi gets off the bus and runs toward the jungle in full view. He gets tracked down, beaten, and shot in the arm. Meanwhile, Nawab and Munni reach Sultanpur, where Munni is finally reunited with her mother.\r\n\r\nThe videos uploaded by Nawab go viral throughout India and Pakistan. A compassionate senior officer Hamid Khan (Rajesh Sharma) realizes that Bajrangi is innocent, and has him released, defying the order of keeping him in jail, which he felt would be petty on the part of Pakistan. Thousands of Pakistanis come to see Bajrangi off and Indians come to receive him. As Bajrangi crosses the border, Shahida, who is also in the crowd, runs toward the fence and cries out for him with her now regained speech. Bajrangi is ecstatic to see her and they run towards each other and embrace.","TrailerLink":"https://www.youtube.com/watch?v=vyX4toD395U","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/vyX4toD395U\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Drama","RatingCount":17,"Rating":4.1,"CensorRating":"U/A","ReleaseDate":"7/17/2015","Runtime":163,"Budget":900000000,"Revenue":6260000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/E8A8A8A35BC795046BDE5425D8C8233C.jpg"},{"Id":"1eb69cf7","ImdbId":"tt3767372","OriginalTitle":"Piku","Title":"Piku","Description":"Piku Banerjee (Deepika Padukone) is a Bengali architect residing in Delhi, with her 70-year-old father, Bhashkor (Amitabh Bachchan). Bhashkor has problems with chronic constipation and traces every problem to his bowel movements. His habits often lead to quarrels with the servants and irritates Chhobi Mashi (Moushumi Chatterjee), who often visits them. Piku loves her father and, as her mother has died, takes good care of him but gets extremely irritated with him at times because of his eccentricities. Her colleague, Syed Afroz (Jisshu Sengupta) is a good friend, and she is a regular client of Syed's friend, Rana Chaudhary's (Irrfan Khan) taxi business. Rana has his own family problems with his mother and sister.\r\n\r\nPiku wants to sell their ancestral home in Kolkata, Champakunj, but Bhashkor objects vehemently and decides to go to Kolkata. Piku has to accompany him, since she cannot let him travel alone. Bhashkor brings up his constipation problem and decides to travel by road. Due to Piku being very problematic with other drivers of Rana, they back away before Piku's trip. Piku, disappointed with the agency tries to book a flight, but soon, Rana arrives at their home to take the family to Kolkata himself, without informing his family about the trip.\r\n\r\nOn the way, the group encounters many incidents, including Rana on the verge of losing patience due to Bhashkor's fussy behaviour and constipation. They finally reach Kolkata, where Piku's relatives live in the old house and Bhashkor asks Rana to stay for some time. Piku and Rana go out in the city and gradually grow close. Rana also subtly hints not to sell the house during a discussion.\r\n\r\nRana leaves Kolkata the next day and asks Bhashkor to stop his eccentricities which he eventually listens to. Piku changes her mind and decides not to sell the house. Meanwhile, Bhashkor's sudden desire to bicycle increases as he cycles through a part of the city alone, leaving everyone tense since he did not tell them about it. When Bhashkor returns, Piku berates him for eating street food and for being irresponsible, but he simply states that his constipation is cleared and he needs to bicycle every day. He remembers Rana who had told him to eat everything and not be choosy and picky about food. Piku is secretly happy but does not emote much.\r\n\r\nThe next day, everyone discovers that Bhashkor has died in his sleep, probably from sleep apnea or cardiac arrhythmia. Piku states that he always wanted a peaceful death. She returns to Delhi, where she arranges his funeral. There, Dr. Srivastava (Raghubir Yadav), Bhashkor’s doctor, reveals to her that Syed, too, has constipation and Bhashkor knew about it for a long time. A few days later, she pays up whatever due she owes Rana. She renames the Delhi house \"Bhaskor Villa\" in her father’s memory and the maid, who had left due to Bhashkor’s tantrums, returns to work.","TrailerLink":"https://www.youtube.com/watch?v=oeiKUlUUNQ8","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/oeiKUlUUNQ8\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":16,"Rating":3.85,"CensorRating":"U/A","ReleaseDate":"5/8/2015","Runtime":123,"Budget":420000000,"Revenue":1040000000,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/41A5DF88753FA2577FBEE6DEAC6A69C3.jpg"},{"Id":"c945692d","ImdbId":"tt3836958","OriginalTitle":"Shamitabh","Title":"Shamitabh","Description":"Danish (Dhanush), born mute in rural Igatpuri, loves films. He acts out scenes before his class, amazing his peers and teacher, and spends all his time in the local Paradise theatre. He even tries to board a Mumbai bus to go become a film star but is pulled off by his mother's friends. When he grows up, Daanish brings pakodas to the local video-store owner and watches films every day. His mother feigns illness and keeps him from going to Mumbai but when she dies, Daanish leaves for Mumbai.\r\n\r\nDaanish gets into Film City past its guards and finds shelter in an actor's vanity van, hiding under the sofa. Travelling around in the empty van, Daanish desperately tries to meet directors but cannot. He meets assistant director Akshara Pandey (Akshara Haasan) who is impressed by his talent. She shows his video, shot on her phone, to a director but he rejects casting a mute hero. Akshara's father, a doctor, treats Daanish after he gets into a fight with security guards. On his recommendation, Daanish and Akshara arrive at Finland to meet his friend who shows Daanish their new \"Live Voice Transfer Technology\", that uses embedded micro-recorders and ear-pieces and enables mute people to communicate via a \"borrowed\" voice.\r\n\r\nAkshara and Daanish return to Mumbai with the equipment and find Amitabh Sinha (Amitabh Bachchan), a failed actor and drunkard. Although he was rejected because of his deep baritone, the duo are actually impressed with the same baritone and ask him to lend his voice to Daanish; he accepts, and signs an agreement not to disclose himself as Daanish's voice. Their first project becomes a major success and numerous film offers come for Daanish, now named \"Shamitabh\" (a portmanteau of Daanish and Amitabh).\r\n\r\nAmitabh, who is officially Daanish's valet, also wants a role in accepting or rejecting scripts. He tells Daanish his voice is as big — if not bigger — a star than Daanish's talent. The friction between them grows. Amitabh gets fever and Daanish makes him take an injection. In retaliation, Amitabh makes Daanish accepts singing a song in his new film. Amitabh sings the song \"Piddly\", but is horrified by its picturisation of toilets across snowy peaks, suggested by Daanish to tease him.\r\n\r\nDaanish arrives at London to deliver a speech which Amitabh voices for him, but Daanish treats him like a servant. Amitabh later becomes inebriated and attacks a police officer, leading to his arrest, but Daanish bails him out.\r\n\r\nWhen the duo return to Mumbai, journalists ask Daanish if he is apologetic about the incident. Amitabh mischievously makes him reply in negative, much to Daanish's fury. The duo parts ways; Daanish plays a mute person in his next film, while Amitabh dubs for another actor in a different film. Both films fail.\r\n\r\nMeanwhile, Akshara, who had gone to Sikkim to write a script for Daanish, returns but berates Daanish when he refuses to apologise to Amitabh. She forces Amitabh and Daanish to reconcile.\r\n\r\nA media reporter, having discovered the secret that Daanish was born mute, threatens to expose the duo but they decide to tell the truth and surprise the world. Daanish and Amitabh accept to work in Akshara's debut film, and Daanish tells Akshara that he loves her. While Daanish and Amitabh are on the way to Akshara's film ceremony, they have a car accident; Daanish is killed while Amitabh's larynx is damaged, making him mute.\r\n\r\nSome time later, Amitabh paces around Daanish's grave with Akshara's script, imagining that Daanish is still alive and practicing his lines for the film.","TrailerLink":"https://www.youtube.com/watch?v=CzJfGRrHlxY","TrailerEmbedCode":"<iframe width=\"850\" height=\"450\" src=\"https://www.youtube.com/embed/CzJfGRrHlxY\" frameborder=\"0\" allowfullscreen></iframe>","Country":"IN","Region":"BOLLYWOOD","Genre":"Action","RatingCount":14,"Rating":3.5,"CensorRating":"U/A","ReleaseDate":"2/6/2015","Runtime":155,"Budget":250000000,"Revenue":0,"PosterPath":"https://s3-ap-southeast-1.amazonaws.com/cinemalytics/movie/A5A1C2971916D5C49B7B6A01F2A47876.jpg"}]